[{"Content":"Bear market account challenge update:\n\nIn mid-2022, I started trading futures. I aimed to make $1m in profits to buy a beach vacation house. 8 Months later, I got the house\n\nFor 2023+ I extended my goal to $10m. Currently sitting at $2.3m realized\n\nHere are 5 things I learned: https://t.co/9sXdEwOrN0","Type":"PinnedTweet","Retweets":71,"Likes":1042,"Replies":86},{"Content":"An Ethereum ETF is imminent, and people are sleeping hard on it!\n\n\"Another court case? That's not how we're going to do our approvals this time,\" SEC Commissioner Hester Pierce said when asked about $ETH ETF applications.\n\nSo, how do we prepare for this potential approval?… https://t.co/yMQptKEMVa","Type":"Retweet","Retweets":13,"Likes":0,"Replies":0},{"Content":"The boomers are here and taking all of our coins","Type":"Tweet","Retweets":0,"Likes":67,"Replies":12},{"Content":"If you're exploring token vesting &amp; lockup solutions, use Hedgey.\n\nIt's ready-to-go token vesting &amp; 100% free.\n🌱 Audited by Consensys Diligence\n⛓ 100% onchain &amp; non-custodial\n🤝 Trusted by Arbitrum, Celo, Gitcoin &amp; more.\n\nShare with your team and grab time to chat with ours.","Type":"Tweet","Retweets":248,"Likes":3256,"Replies":157},{"Content":"Events and Catalysts This Week (12 -18 Feb)\n\nMonday, February 12, 2024\n• $XRP vs SEC\n• $JUP SLP22 Integration\n• $UFT V2 Mainnet Launch\n• $COIN vs SEC Redaction Requests\n• $APT ~9.55% Supply unlocked (corrected)\n\nTuesday, February 13, 2024\n• $US CPI Numbers\n• $TOKEN… https://t.co/87uyOwj6Cq","Type":"Retweet","Retweets":6,"Likes":0,"Replies":0},{"Content":"Yesterday, Bitcoin ETFs attracted a huge $405M, boosting Bitcoin's price. \n\nBut let's look closer:\n\n•Since Jan 22, $GBTC is losing about $100M daily\n•Other ETFs gain around $200M daily, outweighing losses https://t.co/xnyg4k3M3W","Type":"Retweet","Retweets":6,"Likes":0,"Replies":0},{"Content":"Came back fresh from vacay and instantly donated -$100k on futures. I missed this feeling. https://t.co/GphyAM9rPf","Type":"Tweet","Retweets":2,"Likes":144,"Replies":10},{"Content":"Lately, I've been juggling many different things at once. I kind of miss the days when you just grind towards a single goal, laser-focused without distractions. \n\nWould you be more profitable if you were trading in solitude alone? I'm curious to know what you think.","Type":"Tweet","Retweets":0,"Likes":94,"Replies":21},{"Content":"Some honest advice on how to profit from repeating patterns","Type":"Tweet","Retweets":5,"Likes":42,"Replies":4},{"Content":"Pre-Market trading platforms are gaining significant attention. But exactly how accurate are their prices?\n\nWe analyzed five coins on @aevoxyz, comparing their pre-market prices to the listing prices on Binance.\n\nHere's what we discovered: https://t.co/vYLY7OoRe0","Type":"Retweet","Retweets":25,"Likes":0,"Replies":0},{"Content":"Bybit apes bidding $2 while dex is trading at $0.60. We are so early. https://t.co/OjuYUmyRWn","Type":"Tweet","Retweets":19,"Likes":314,"Replies":13},{"Content":"With a record 8 million trades and over $3 billion in volume in the last week, $JUP is now the most anticipated crypto airdrop of 2024.\n\nHere's how Jupiter is taking over the competition and everything you must know ahead of the launch: https://t.co/0anCqufMUz","Type":"Retweet","Retweets":7,"Likes":0,"Replies":0},{"Content":"This month I did very little trading and a lot of spot  holding. Life hasn't been this calm in ages. I like it.","Type":"Tweet","Retweets":6,"Likes":126,"Replies":14},{"Content":"Events and Catalysts For The Week (29 January - 4 February)\n\nMonday, January 29, 2023\n• EVERGRANDE Liquidation Hearing\n• GOOGLE Allows Crypto Trusts &amp; ETF Ads\n• $DYDX V3.0 Protocol Upgrade\n• $MNT mETH on EigenLayer\n• $AUCTION - Bounce Finance Announcement\n• $FXS SfrxETH on… https://t.co/5iSEYmidfs","Type":"Retweet","Retweets":5,"Likes":0,"Replies":0},{"Content":"With so many new tokens getting airdropped in 2024, pre-market products should gain a decent amount of traction in the coming months","Type":"Tweet","Retweets":2,"Likes":55,"Replies":2},{"Content":"We will expand our coverage beyond event and narrative summaries as we advance. I'm thinking about publishing potential trade ideas alongside case studies from old trades.\n\nLet me know if there's something specific, you guys would like to see or are interested in.","Type":"Tweet","Retweets":2,"Likes":86,"Replies":7},{"Content":"Effort always goes unnoticed until the results become visible. \n\nIn a year from now, people will call us extremely lucky again.","Type":"Tweet","Retweets":10,"Likes":155,"Replies":4},{"Content":"How to get rich in crypto with no money:\n\n1) Post on Twitter\n2) Farm Airdrops and document\n3) Pick up an intern job and save\n4) Re-invest in your farm and buy low caps\n\nThe new class of crypto bros don't know how easy they have it now. Back then, we didn't have this luxury.","Type":"Tweet","Retweets":37,"Likes":496,"Replies":40},{"Content":"Y'all are aping because theres only 1k btc in confirmed Grayscale transactions.\n\nDon't forget btc is slow as fuck and there might be pending transactions in the mempool.","Type":"Tweet","Retweets":3,"Likes":66,"Replies":9},{"Content":"If your thesis works out, but you were too early to the play, were you even right?\n\nFor example, I bet the ETF approval or the latest launch will be a sell the news event.\n\nI sold before before Christmas, expecting a potential approval before the holiday season.\n\nYes, the BTC… https://t.co/d0fXcHOmWB","Type":"Tweet","Retweets":5,"Likes":91,"Replies":10},{"Content":"Honestly, it’s pretty nice to see that at least a part of this humongous outflow was due to this","Type":"Tweet","Retweets":5,"Likes":66,"Replies":3},{"Content":"Events and Catalysts For The Week (22 January - 28 January)\n\nMonday, January 22, 2023\n• BITHUMB Delists $ANV And $EVER\n• $MINA Testnet Ends\n• $AXS AOC Migration Snapshot\n• $BNB - SEC v. Binance Motion To Dismiss Hearing [15:00 - 21:00]\n\nTuesday, January 23, 2023\n• $AVAX Web… https://t.co/KZr0Gs0qos","Type":"Retweet","Retweets":9,"Likes":0,"Replies":0},{"Content":"How to have highly profitable trades:\n\nTake highly profitable setups only.\n\nSounds too simple. Maybe even stupid. But take a moment and think about how many shitty trades you enter on a daily basis. \n\nMany of us would be more profitable by simply doing less.","Type":"Tweet","Retweets":33,"Likes":241,"Replies":11},{"Content":"CT comment section never ceases to amaze me https://t.co/85OWWq9Wab","Type":"Tweet","Retweets":1,"Likes":41,"Replies":2},{"Content":"Been in the kitchen cooking and looking for decent projects to invest in next to trading.\n\nIf you're launching a project and looking to raise money, feel free to DM me your pitch decks.\n\nBuilding a team to find the best stuff to position for the bull market.","Type":"Tweet","Retweets":117,"Likes":166,"Replies":16},{"Content":"I see lots of accounts on the timeline getting celebrated with high leverage positions during uponly\n\nNow they're all getting liquidated and leaving Twitter\n\nDon't let yourself get suckered into believing this is how you make it. Steady eddy wins, and survival is how you make it","Type":"Tweet","Retweets":29,"Likes":326,"Replies":30},{"Content":"Was thinking about all the things I could do to maximize life enjoyment rather than wealth. \n\nBut then I realized it’s a bull market and I should rather maximize wealth instead of life enjoyment.\n\nWhat a life https://t.co/CGikFvnVK9","Type":"Tweet","Retweets":5,"Likes":202,"Replies":14},{"Content":"Events and Catalysts For The Week (15 January - 21 January)\n\nMonday, January 15, 2023\n• BINANCE MVB 7 Accelerator Application Ends\n• $FET Mainnet Upgrade\n• $PMON Onchain Monsters Battles Launch\n• $ENJ Governance Rewards Begins\n• $YGG World Crypto Forum, DWF And YGG CEO… https://t.co/NOMaV6GJZ4","Type":"Retweet","Retweets":9,"Likes":0,"Replies":0},{"Content":"Fake the news szn","Type":"Tweet","Retweets":4,"Likes":26,"Replies":4},{"Content":"Two fake etf approvals showed you the true reaction before the real thing actually happened.\n\nYou can’t make this shit up. I love this industry","Type":"Tweet","Retweets":5,"Likes":147,"Replies":11},{"Content":"Apes are firing into any btc, etf, or sec headline resulting in big wicks on both sides.\n\nI’ve been on the sell the news boat for a while. It’s interesting so many people flipped and are looking to buy the news now.\n\nI don’t see myself having an edge here so I’m chilling in spot…","Type":"Tweet","Retweets":11,"Likes":158,"Replies":16},{"Content":"Events and Catalysts For The Week (8 January - 14 January)\n\nMonday, January 8, 2023\n• $FET Releases Network Upgrade Governance Proposal\n• $JOE - $MOE TGE\n\nTuesday, January 9, 2023\n• $BAKE Bitcoin Cats Genesis NFT\n• $BSV Gets Delisted From Coinbase\n• $XAI Binance Launchpool… https://t.co/3NnyWs5fj2","Type":"Retweet","Retweets":6,"Likes":0,"Replies":0},{"Content":"1 week into the month, many plays have been covered here.\n\n- $SKL put on a 50% pump on the same day\n- $DYDX underperformed relative to market\n- $AGLD put on 30% pump on the same day\n- $GMT is putting on a huge delayed run now\n\nNot gonna pretend we took all the trades; bottom and…","Type":"Tweet","Retweets":4,"Likes":79,"Replies":7},{"Content":"If this is your first cycle:\n\nSet a $ goal and make list of what you gonna do with the money.\n\nOnce you hit it, get out and do exactly what you planned to do.\n\nYou are not a genius investor/trader. You just got lucky and most likely will give it all back. Almost all of us did.","Type":"Tweet","Retweets":94,"Likes":823,"Replies":39},{"Content":"Do what most people don’t.\n\nExplore new chains and airdrops to interact with. Post your ideas online. Discover patterns and dig for inefficiencies.\n\nThe more you do these things, the luckier you will get.","Type":"Tweet","Retweets":11,"Likes":180,"Replies":8},{"Content":"One of the easiest things you can do in an uptrending market is to have a bunch of resting bids at optimistic key levels.\n\nThe flushes will always come. While others ape and chase, I prefer to drink some tea and wait for the inevitable fill to happen, then sell shortly after. https://t.co/FcHhDN7LKF","Type":"Tweet","Retweets":12,"Likes":266,"Replies":20},{"Content":"I’ve been holding mostly majors on spot. Looking to get back more into the lower caps to place some bull market bets.\n\nShill me all your coins that you would hold for at least one year from now and why.\n\nI’ll go through all of them and buy your bags if it’s something good.","Type":"Tweet","Retweets":7,"Likes":122,"Replies":61},{"Content":"If you keep doing the same things you've been doing, you’ll get the same results as the years before.\n\nThe way you take this statement depends on how well you’ve been doing.","Type":"Tweet","Retweets":13,"Likes":199,"Replies":7},{"Content":"Being lucky or running hot whenever you get started in crypto makes such a big difference.\n\nI often think about the people who joined at the top or during peak bear, got absolutely raped, and never returned.\n\nIf you start winning immediately, you build massive confidence. The…","Type":"Tweet","Retweets":8,"Likes":153,"Replies":14},{"Content":"Events and Catalysts For The Week (18 December - 24 December)\n\nMonday, December 18, 2023\n• $ZBC Buyback Complete\n• $ICX Mainnet\n• UBISOFT - Champions Tactics NFT Mint\n• EIGENLAYER Adds 6 New LSTs\n• $ACE Starts Trading On Binance Spot\n\nTuesday, December 19, 2023\n• $BAKE -… https://t.co/dADdjyPuov","Type":"Retweet","Retweets":13,"Likes":0,"Replies":0},{"Content":"What will happen if BTC ETF gets approved by 10th Jan?","Type":"Tweet","Retweets":6,"Likes":25,"Replies":8},{"Content":"Seeing so many things pulling multiples, it surely feels like we are all incredible geniuses.\n\nI always try to remind myself that I'm not that smart. \n\nThe recent move is basically the payout for being active in the bear and selling our bags to the people who haven't been active.","Type":"Tweet","Retweets":6,"Likes":117,"Replies":6},{"Content":"Events and Catalysts For The Week (11 December - 17 December)\n\nMonday, December 11, 2023\n• $STRK - Starknet V0.12.3 Mainnet\n• $LINK Staking V.02 General Access\n• $BAKE - BakerySwap Launches Three BRC-20 Launchpads, Beginning Today\n\nTuesday, December 12, 2023\n• US CPI… https://t.co/Wpg1BhQvL6","Type":"Retweet","Retweets":15,"Likes":0,"Replies":0},{"Content":"Serious question:\n\nDid you outperform Bitcoin this year?\n\nI didn't. Crazy to imagine I could've chilled in a single spot position all year and done better than trading all year.\n\nDon't get me wrong. Trading did very well, but not as well as a 2.5x without much effort and stress. https://t.co/yhuqKOLNQW","Type":"Tweet","Retweets":23,"Likes":476,"Replies":105},{"Content":"Events and Catalysts For The Week (4 December - 10 December)\n\nMonday, December 4, 2023\n• $RLC V8.3 Upgrade\n• $BNB Greenfield Upgrade\n• $DATA Streamr 1.0 Testnet\n• BITTREX End of Service\n• $NEO Neo-CLI V.3.6.2 Mainnet\n• $TVK VANRY Important Announcement\n• $OSMO Co-Founder… https://t.co/IuKseGd6xr","Type":"Retweet","Retweets":10,"Likes":0,"Replies":0},{"Content":"Important to add:\n\nExpand your timeframe of how long you will hold these entries. Do not sell for minimal gains. Do not sell everything until one or two years in.\n\nTaking profits on Futures is fine, but I make sure to convert some of the positions into spot bags and let them run.…","Type":"Tweet","Retweets":13,"Likes":122,"Replies":4},{"Content":"Although price action has been dull in the past week, I have little reason to be bearish throughout the next month.\n\nI have been mainly sitting on my hands in a few selected positions and am waiting for the fomo to kick in again.\n\nAll it takes is a little bit of patience.","Type":"Tweet","Retweets":6,"Likes":81,"Replies":6},{"Content":"What I love about trading is that it can pay extremely well with little to no costs involved.\n\nWhat I hate about it is that it still requires you to trade your time for money.\n\nEveryone making fun of wagies doesn't understand that they are wagies with golden handcuffs themself.","Type":"Tweet","Retweets":8,"Likes":247,"Replies":29},{"Content":"There are not too many relevant events coming up for the next week, so we're sticking with the things that could actually lead to some price action https://t.co/P3rIzP7xFE","Type":"Retweet","Retweets":8,"Likes":0,"Replies":0},{"Content":"Months ago, I set out the playbook to long hard once the DOJ news hit.\n\nI expected a similar PA like with the SEC news. Some dump, then up quickly.\n\nLittle did I know that shorting after 1 minute was already too late. I got trapped in the position, unprepared for what to do in…","Type":"Tweet","Retweets":9,"Likes":160,"Replies":19}]