[{"Content":"Gm. Sent my Bitcoins to an offline wallet so Blackrock can’t take them..","Type":"Tweet","Retweets":4,"Likes":266,"Replies":34},{"Content":"Funding rates are too damn high. For you sake and ours, I suggest you deleverage a bit.. https://t.co/efTD94AX1g","Type":"Tweet","Retweets":18,"Likes":545,"Replies":43},{"Content":"CT gets the airdrop: “Best coin ever, future of finance, genius team”\n\nCT doesn’t get the airdrop: “Tokenomics so bad, FDV is too high, insiders will dump all the coins”","Type":"Tweet","Retweets":8,"Likes":194,"Replies":32},{"Content":"the \"whataboutism\" for ETH is incredible\n\ni'll make it even simper with this tweet:\n\nETH will get an ETF this cycle, AND NOTHING ELSE WILL\n\nthis is the easiest setup in crypto history, with BTC showing what's possible with an ETF, yet many here will find a way to totally F it up","Type":"Retweet","Retweets":27,"Likes":0,"Replies":0},{"Content":"Whoever been selling $SEI like crazy last week, glad to see you getting rekt..","Type":"Tweet","Retweets":13,"Likes":220,"Replies":20},{"Content":"RIP to bears who thought it was a good idea to short the market on hot CPI print..","Type":"Tweet","Retweets":28,"Likes":467,"Replies":23},{"Content":"Didn’t even bother doing something to get $STRK airdrop. But if this thing starts trading with anything less than $10bn FDV, I’m smashing the green button..","Type":"Tweet","Retweets":4,"Likes":97,"Replies":9},{"Content":"Hot CPI print?\n\nTime to pull out the inflation hedge narrative..","Type":"Tweet","Retweets":5,"Likes":191,"Replies":12},{"Content":"Gm. That dip buying worked out well for me once again.. $BTC https://t.co/3UgYgVpEsb","Type":"Tweet","Retweets":35,"Likes":1470,"Replies":142},{"Content":"Break of $50k and ethbtc still green.\n\nMarket is paying eth holders 10%/30% apr over the next couple of months to do absolutely nothing, and that might even be on a conservative basis.\n\nFor you to scramble out of eth now, you need to be confident in it holding below .047, with no…","Type":"Retweet","Retweets":23,"Likes":0,"Replies":0},{"Content":"Well, now that the Grayscale scare is over there’s nothing holding $ETH from gigapumping as the ETF deadline comes closer..","Type":"Tweet","Retweets":18,"Likes":286,"Replies":19},{"Content":"What happened to all the people posting bearish targets last week? Still not invalidated?","Type":"Tweet","Retweets":5,"Likes":192,"Replies":33},{"Content":"Gm. How’s everyone positioned for this week? What’s looking good?","Type":"Tweet","Retweets":2,"Likes":100,"Replies":65},{"Content":"Gm. Just checked the charts again. I was right. We indeed went higher..","Type":"Tweet","Retweets":2,"Likes":146,"Replies":27},{"Content":"It appears that Bitcoin miners finally ran out of coins to sell..","Type":"Tweet","Retweets":11,"Likes":301,"Replies":27},{"Content":"You all probably get my point now. The market needs a narrative and Ethereum ETF is the best one we have here. Buy some $ETH and the market will take care of the rest..","Type":"Tweet","Retweets":14,"Likes":196,"Replies":23},{"Content":"Ethereum ETF is coming sooner or later. See you at $5k..","Type":"Tweet","Retweets":24,"Likes":410,"Replies":29},{"Content":"Dencun is now live on the Holesky testnet!\n\nNext up, mainnet Ethereum, with a date to be announced for that possibly within the next 24 hours 👀\n\nEIP-4844 is coming 🌊","Type":"Retweet","Retweets":116,"Likes":0,"Replies":0},{"Content":"Have they tried to turn it off and on again?","Type":"Tweet","Retweets":19,"Likes":368,"Replies":57},{"Content":"Gm. Can you all start bidding $ETH so we have another bull run? Otherwise we get stuck in this low volatility environment forever..","Type":"Tweet","Retweets":5,"Likes":212,"Replies":58},{"Content":"I also have an account on Farcaster if you want to follow: https://t.co/etTSNHvojd","Type":"Tweet","Retweets":3,"Likes":74,"Replies":31},{"Content":"Gm. Just checked the charts. We are going higher..","Type":"Tweet","Retweets":10,"Likes":285,"Replies":51},{"Content":"Here’s a pepper spicey take:\n\nThe BTC ETF was a success, the reason ETH isn’t getting bought up now is that people percieve it as a sell the news due to GBTC. They fear ETH ETF is not worth front running and will do the same.\n\nImagine the FOMO when BTC crawls to new highs.","Type":"Retweet","Retweets":7,"Likes":0,"Replies":0},{"Content":"Few days ago everyone was talking how JUP is some revolutionary project but now they say the team are serial ruggers. I'm confused..","Type":"Tweet","Retweets":10,"Likes":280,"Replies":54},{"Content":"Gm. Thanks to Powell I woke up poor today. Will skip breakfast to save money..","Type":"Tweet","Retweets":9,"Likes":245,"Replies":36},{"Content":"Powell immediately stopped making any sense. “We need good data”. Wtf is “good data”?","Type":"Tweet","Retweets":4,"Likes":94,"Replies":32},{"Content":"No suprises here but I expect Powell to give a dovish speech and mentioning that rate cuts could happen soon. Stay tuned..","Type":"Tweet","Retweets":8,"Likes":116,"Replies":17},{"Content":"Gm. Are people really selling because of FED meeting? Don’t see any logic in this..","Type":"Tweet","Retweets":6,"Likes":270,"Replies":57},{"Content":"I simply buy the one that’s cheaper.. https://t.co/lsPmP3SoFT","Type":"Tweet","Retweets":16,"Likes":463,"Replies":50},{"Content":"If they asked me to describe pain I will show them this chart. 11 daily red candles in a row. Like how? https://t.co/KyRIl4L9Rk","Type":"Tweet","Retweets":27,"Likes":519,"Replies":107},{"Content":"They’re getting everyone ready for rate cuts that could happen as soon as March..\n\nhttps://t.co/lCD69xAc7v","Type":"Tweet","Retweets":4,"Likes":37,"Replies":9},{"Content":"Another $1k increase in $BTC and people will start deleting their bearish tweets..","Type":"Tweet","Retweets":19,"Likes":521,"Replies":56},{"Content":"Soon Grayscale will run out of coins to sell, FED starts cutting rates, halving in less that 3 months. It’s hard to find reasons to be bearish..","Type":"Tweet","Retweets":73,"Likes":929,"Replies":94},{"Content":"Gm. Everyone patiently waiting for the Grayscale number to make a bet..","Type":"Tweet","Retweets":2,"Likes":162,"Replies":30},{"Content":"Gm. Some good movements on weekend, fundings going towards negative side. Tomorrow is going to be very interesting..","Type":"Tweet","Retweets":10,"Likes":188,"Replies":33},{"Content":"You see this type of shit in bottom of the cycle, not top.. https://t.co/U19yc0UmwJ","Type":"Tweet","Retweets":15,"Likes":324,"Replies":22},{"Content":"Every cycle people say Bitcoin halvening is not bullish, and every cycle it ends up being bullish. I don’t make the rules.. https://t.co/q09k9qt5Hl","Type":"Tweet","Retweets":17,"Likes":263,"Replies":32},{"Content":"Gm. Looking at $BTC price action I can say that the amount of bitcoins sent from Grayscale is going to be quite low today..","Type":"Tweet","Retweets":5,"Likes":219,"Replies":31},{"Content":"If you think about it, selling $BTC because of some investors at Grayscale are cashing out is a very shortsighted move. Once the dust settles down, people will understand how bullish the ETF approval is..","Type":"Tweet","Retweets":23,"Likes":365,"Replies":40},{"Content":"So at what point do geniuses working at Grayscale realize that people are not willing to pay the higher fees and maybe they should just lower them to match the fees offered on similar products in the market?","Type":"Tweet","Retweets":11,"Likes":215,"Replies":48},{"Content":"Gm. So how many BTC was sent to Coinbase by Grayscale today?","Type":"Tweet","Retweets":3,"Likes":249,"Replies":83},{"Content":"Are we sure Grayscale is selling BTC and not ETH instead?","Type":"Tweet","Retweets":13,"Likes":362,"Replies":60},{"Content":"People really nuked $BTC 30% to save 1% on fees..","Type":"Tweet","Retweets":46,"Likes":1445,"Replies":124},{"Content":"Buenos dias! https://t.co/9tFmGNO7Vb","Type":"Tweet","Retweets":2,"Likes":142,"Replies":42},{"Content":"$BTC is going down like Satashi came back and printed more coins..","Type":"Tweet","Retweets":22,"Likes":529,"Replies":64},{"Content":"Are you sure we can’t do another ETF thing?","Type":"Tweet","Retweets":10,"Likes":177,"Replies":34},{"Content":"If these ETF experts want to stay relevant, they better start talking about Ethereum ETF soon..","Type":"Tweet","Retweets":6,"Likes":216,"Replies":44},{"Content":"So now we have to sit and wait for Grayscale to run of Bitcoins to sell?","Type":"Tweet","Retweets":17,"Likes":564,"Replies":76},{"Content":"I hate these long weekends. 3 days without any meaningful price moves is just too much..","Type":"Tweet","Retweets":17,"Likes":318,"Replies":50},{"Content":"Gm. I hope you all had a good weekend. Praying for bullish action this week 🙏","Type":"Tweet","Retweets":17,"Likes":241,"Replies":71}]