[{"Content":"Very funny to read the comments in hindsight","Type":"Tweet","Retweets":44,"Likes":1545,"Replies":119},{"Content":"Most boring Q1 ever","Type":"Tweet","Retweets":48,"Likes":1277,"Replies":93},{"Content":"This game is a treasure for RPG fans🔥🔥","Type":"Tweet","Retweets":303,"Likes":983,"Replies":173},{"Content":"Gold people in my mentions saying\n\"But Gold has a 4000-year history\"\n\nBro, it took gold 4000 years to get to $2000?\nAnd you're trying to say that's an argument for gold, not against it?\nMe? I like things that go up more than $0.5 a year","Type":"Tweet","Retweets":60,"Likes":1080,"Replies":108},{"Content":"Real talk\n\nGold is stupid\nSo either BTC goes to the mcap of gold\nor gold goes to the mcap of BTC\n\nWhichever way around I don't care but the world is wrong until that's the case","Type":"Tweet","Retweets":88,"Likes":1763,"Replies":143},{"Content":"BTC absorbing selling like a chad\nOne of my favorite indicators of strength","Type":"Tweet","Retweets":192,"Likes":2822,"Replies":118},{"Content":"Not gonna lie, the ETF event played out significantly more bullish than I expected\n\nWe're down a bunch but every passing day it looks more like a dip to buy and less like mindless speculation\n\nIf sentiment shifts slightly bearish, it's a strong buy IMO","Type":"Tweet","Retweets":902,"Likes":4185,"Replies":351},{"Content":"Your boy DonAlt has made it\n\nGetting sponsorship offers from Microsoft\n\nWe in the big leagues now https://t.co/b70Nob8ybS","Type":"Tweet","Retweets":36,"Likes":1044,"Replies":79},{"Content":"GM my frens https://t.co/JjpsW8JlsR","Type":"Tweet","Retweets":24,"Likes":1025,"Replies":83},{"Content":"We'll Be Sharing Our Next Pump Signal On Our TG Channel \n\n🔗 https://t.co/cUtBcqsurI","Type":"Tweet","Retweets":6,"Likes":53,"Replies":5},{"Content":"At the end of the day\n\nThis is a beautiful and bullish chart, even if we should retest $32k (32k being an absolute gift to get, not sure the gods will be that kind)\n\nCan't lose sight of the price and the price is much higher prices as long as we don't get a trad market collapse https://t.co/bMARbcBDHD","Type":"Tweet","Retweets":178,"Likes":2214,"Replies":88},{"Content":"I've been saying that the ETH ETF narrative is gonna face trouble if the BTC ETF ends up a sell-the-news event\n\nLast weeks price action seems to validate that train of thought\n\nStill think it'll be a good trade later down the line but the weaker BTC is, the weaker ETH will be","Type":"Tweet","Retweets":28,"Likes":978,"Replies":39},{"Content":"$BTC\n\nThis chart is all you need IMO\nWicks below $35k seem like a good buy\nConsolidation at $35k seems like a decent buy\n\nThe longer it takes the better, just need to absorb all the sell the news/GBTC/CME front running/whatever else and then hope macro stays decent https://t.co/OI1PIjlKVO","Type":"Tweet","Retweets":72,"Likes":1733,"Replies":55},{"Content":"Digestion of the ETF has honestly been much better than I expected\n\nA 15% drop is nothing in the grand scheme of things\n\nGonna be interesting to observe the rest of the month to see if that strength sticks around or not","Type":"Tweet","Retweets":13,"Likes":1316,"Replies":48},{"Content":"Where we dropping? Dominion🔥You know what's better than fighting monsters? Fighting monsters in a team! Find your guild and get to work in Hero Wars👇","Type":"Tweet","Retweets":15,"Likes":55,"Replies":5},{"Content":"Is what it is, you'll get it next time champs https://t.co/8TdYUG8sXO","Type":"Tweet","Retweets":6,"Likes":948,"Replies":86},{"Content":"So when are we getting the 10B of ETF buying\n\nAsking for a friend","Type":"Tweet","Retweets":4,"Likes":725,"Replies":81},{"Content":"$ETH\n\nI've been shit-talking this thing for more than a year since 0.065+\nThe reason for that was it lacked a clear narrative and the BTC ETF was just the more obvious bet\nI also have been saying other alts are much better bets over ETH\n\nNow that the BTC ETF is through, that is… https://t.co/7Hbw7Docjj","Type":"Tweet","Retweets":5,"Likes":1065,"Replies":82},{"Content":"We recorded this so long ago, that I actually don't know what I said in it anymore\n\nThat said I remember enjoying my time so if you're into ducks it's probably worth a listen","Type":"Tweet","Retweets":3,"Likes":231,"Replies":3},{"Content":"People in my comments mega upset I'm just... not doing anything\n\nBrothers, today is a day to celebrate, I'm happy for the market as a whole, the ETF being here is amazing news\n\nI buy when the market is dying, you buy when it's doing well, both are valid strategies\nJust... chill?","Type":"Tweet","Retweets":4,"Likes":1377,"Replies":64},{"Content":"$BTC\n\nNow that the ETF is through, we can finally start considering levels on the chart again\n\nI'm still on break but if we either retest ~$35k or $45k (after a move-up) in the next ~3 months I could be convinced to get active again\n\nStraight up and I'd have to wait a bit longer https://t.co/tzMJiE58lX","Type":"Tweet","Retweets":5,"Likes":786,"Replies":46},{"Content":"If this continues they'll launch the LTC ETF before they'll launch the BTC ETF","Type":"Tweet","Retweets":3,"Likes":640,"Replies":30},{"Content":"Imagine if FTX didn't go down the ultra-fraud route\n\nThey'd all be giga-rich at this point, BTC would be above $60k, Sam would be considered the genius of the century\n\nUnbelievable fumble, they risked it all for essentially nothing and now the world is moving on without them","Type":"Tweet","Retweets":3,"Likes":1712,"Replies":116},{"Content":"Centralized exchanges gotta shit themselves seeing ETF fees of sub .3%\n\nWhy would any large trader risk getting robbed by a shady exchange when they can just have fun trading an insured ETF instead?\n\nFeels like this space is gonna be suited up in no time","Type":"Tweet","Retweets":7,"Likes":1337,"Replies":75},{"Content":"The thing with memes is that you have to either\n\n1) Be very early - Make loads, give loads back, oh well\n2) Buy into momentum - And sell the moment it disappears\n3) Not buy this garbage at all\n\nThe biggest nono is buying trash up 10k% and then holding it once the momentum is gone","Type":"Tweet","Retweets":3,"Likes":857,"Replies":36},{"Content":"Was so tired I went into the sauna and forgot to take my glasses off\n\nThe heat fucked the glass somehow\nNew ones arriving in 2 weeks\nI see blurry now\n\nSplendid start of the year","Type":"Tweet","Retweets":2,"Likes":578,"Replies":101},{"Content":"Capo be like\n\n\"I'm gonna single handedly destroy this market\"\nThe power he's got is unfathomable for us mere mortals\n\nRespectfully https://t.co/sjtv0At2i5","Type":"Tweet","Retweets":9,"Likes":904,"Replies":71},{"Content":"Matrixport analysts hedging their predictions better than CT influencers do https://t.co/1c7Stmd8be","Type":"Tweet","Retweets":2,"Likes":677,"Replies":35},{"Content":"Dominion awaits, come be a hero🔥 Like the man said: heroes get remembered, but legends never die. Step up to the plate in Hero Wars and start swinging👇","Type":"Tweet","Retweets":9,"Likes":72,"Replies":7},{"Content":"Market trading like the ETF got accepted","Type":"Tweet","Retweets":2,"Likes":1203,"Replies":56},{"Content":"What a year 2023 has been\n\nAs I sit here with my daughter sleeping on my chest while my absolutely amazing waifu takes a well-deserved rest I realize how lucky I am\n\nFortunate to have such a lovely family and friends and also fortunate enough to have been at the right time and…","Type":"Tweet","Retweets":2,"Likes":2105,"Replies":113},{"Content":"My 2024 prediction is that\n\nIt'll be worse than most people on here predict\nIt'll be much better than the beartards think","Type":"Tweet","Retweets":2,"Likes":1356,"Replies":143},{"Content":"Recorded a casual Friday episode with Cred today where we talk about 2023 and what we expect for 2024\n\nVery casual and a lot of humor in between segments, go check it out if you're interested\n\nhttps://t.co/59jPD58uuq","Type":"Tweet","Retweets":1,"Likes":551,"Replies":29},{"Content":"We'll Be Sharing Our Next Pump Signal On Our TG Channel \n\n🔗 https://t.co/cUtBcqsurI","Type":"Tweet","Retweets":4,"Likes":56,"Replies":0},{"Content":"market turned to full-blown scam in seconds\n\netf narrative was the final exit pump and we all fell for it","Type":"Tweet","Retweets":2,"Likes":922,"Replies":107},{"Content":"alt season has been raging for weeks\n\nthis is what ethbtc looks like https://t.co/3HV0Q26n3M","Type":"Tweet","Retweets":3,"Likes":619,"Replies":56},{"Content":"For the people trading on WOO\n\nThey're hosting a $1 million trading competition going into Christmas\nMy contact at WOO asked me to share it to and I quote \"save me from getting my balls broken lol\"\n\nBig price pool, little signups, little competition\n\nhttps://t.co/0kJwTBzwGi","Type":"Tweet","Retweets":1,"Likes":235,"Replies":20},{"Content":"The reason why crypto trades so exceptionally well is that deep down we all know it's a little bit of a scam\n\nSo every time it goes low that doubt creeps up on us making us do dumb shit\n\nAnd when crypto goes up the doubt gets nuked by euphoria making us do even dumber shit","Type":"Tweet","Retweets":3,"Likes":1321,"Replies":80},{"Content":"Was out with the family today walking toward a Christmas market\n\nSaw a car slowly approaching and then suddenly speed up\nCar tires start squealing, the car hits an iron pole, completely flattens it, and then crashes into a house not even 5 meters in front of us\nAll airbags go…","Type":"Tweet","Retweets":3,"Likes":627,"Replies":94},{"Content":"Can't wait till all of our decentralized coins are traded as ETFs so we don't have these kinds of problems anymore\n\nThat defeats the purpose?\n\nShhhhhhhhhh, silence my little one https://t.co/eRps8VluYV","Type":"Tweet","Retweets":3,"Likes":408,"Replies":22},{"Content":"My thesis is basically\n\nETF is almost fully priced in by the rally from 16k to 44k and anyone buying is gonna get distributed on right before and after the announcement\n\nAn upset would be a denial which would take us sub 25k pretty much immediately\n\nCould be wrong, a duck doesn't…","Type":"Tweet","Retweets":3,"Likes":1365,"Replies":145},{"Content":"$BTC\n\nThe first bull setup I'd be willing to take would be a retest of $32k\n\nBut I would only take that setup if it's occurring before the ETF announcement, if it happens after I think we're fucked\n\nOther than that I've got zilch\nCapo also finally closed his \"shorts\" sooo... https://t.co/mhz0UzhrVN","Type":"Tweet","Retweets":3,"Likes":835,"Replies":63},{"Content":"The same people who called me dumb at $16k for buying citing negative macro as a reason are now telling me I'm dumb for selling given positive ETF news\n\nI have no idea how this plays out but to me that's some serious first-year in crypto line of thinking\nRequires luck to work","Type":"Tweet","Retweets":3,"Likes":925,"Replies":35},{"Content":"Where we dropping? Dominion🔥You know what's better than fighting monsters? Fighting monsters in a team! Find your guild and get to work in Hero Wars👇","Type":"Tweet","Retweets":1,"Likes":22,"Replies":1},{"Content":"$BTC\n\nYear-end is gonna be interesting https://t.co/p0fSOqSQ2v","Type":"Tweet","Retweets":3,"Likes":791,"Replies":70},{"Content":"First night of good sleep in a week\n\nThe duck is back GM","Type":"Tweet","Retweets":3,"Likes":1004,"Replies":82},{"Content":"I thought losing a trade was as bas as it gets\nuntil I got to know sleep regression\nsend help","Type":"Tweet","Retweets":3,"Likes":641,"Replies":115},{"Content":"People on here have been calling for an ETH dominance run for so long, I'm surprised they've not been right yet\n\nThe whole argument at this point is basically\n\"I've been wrong for so long, might as well stick with it because eventually I'll be right\"\n\nFair play, I guess?","Type":"Tweet","Retweets":4,"Likes":749,"Replies":52},{"Content":"Looking at BTC, it'll probably close in an area in which I don't wanna do business in\n\nMakes being on tradecation even easier for me\n\nTime to flood the timeline with European takes that will make Twitter go mald until the new year","Type":"Tweet","Retweets":4,"Likes":597,"Replies":33},{"Content":"It's so annoying to discuss with Americans on the Internet\n\nFor some reason, most Americans think in terms of \"This guy is a Democrat/Republican - Therefore I like/dislike him\n\nNever seen this kind of political cheerleading anywhere else, this is not how the world works","Type":"Tweet","Retweets":4,"Likes":1104,"Replies":186}]