[{"Content":"hey loser, get in\n\njust know that one day i'll dump my bags on you\n\nbut one day we'll all be dead anyway\n\nso now we live for the moment and for the memories https://t.co/5SnAP8NTvQ","Type":"PinnedTweet","Retweets":312,"Likes":2793,"Replies":993},{"Content":"Is the BTC spot ETF already priced in?\n\nDon't ask such a dumb fucking question again. https://t.co/l3PZ9wJ2Md","Type":"Retweet","Retweets":147,"Likes":0,"Replies":0},{"Content":"@DegenSpartan if ether goes above $8k I’ll fuck a degenspartan onahole","Type":"Retweet","Retweets":49,"Likes":0,"Replies":0},{"Content":"cyprus PRI, similar to lower korea\n\n1 day every 2 years to maintain it\n\nkorea minimums ofc a lot higher, and recently tripled\n\nPR's with low/no physical stay requirements are very valuable for plan B's in special cases where you specifically cannot or do not want to be a citizen","Type":"Tweet","Retweets":22,"Likes":114,"Replies":14},{"Content":"correct, but false\n\nhumans do hero worship since forever\n\nthats why we have celebrities and thot leaders\n\njust that its getting worse now\n\nthe ratio of parasocial/normal relationships that people have will only increase with the pervasiveness of social media in the digital medium","Type":"Tweet","Retweets":23,"Likes":242,"Replies":18},{"Content":"Former Ripple CTO Stefan Thomas owned an IronKey hard drive containing 7,002 BTC (currently worth about $244 million) and had only two chances to guess the password, having forgotten the information. Cryptocurrency recovery company Unciphered said it was possible to bypass the…","Type":"Retweet","Retweets":56,"Likes":0,"Replies":0},{"Content":"When your friend says “but idk tho DYOR” after shilling you a shitcoin for the last 1.5 hours https://t.co/31tpK9bm7A","Type":"Retweet","Retweets":68,"Likes":0,"Replies":0},{"Content":"🚨  NEW SOCIAL ENGINEERING ATTACK IN THE WILD 🚨 \n\na bunch of hacked accounts are tweeting about an “AaveHack” hashtag\n\nclicking the hashtag leads to mountains of fake tweets about an aave hack\n\nbut as far as I can tell the aave hack never happened\n\nthey’re trying to get people…","Type":"Retweet","Retweets":86,"Likes":0,"Replies":0},{"Content":"Peter’s gold fund EPGFX has returned ~1% per year since inception in 2013 after fees. Impressively there remains $200M in the fund after 10 years of such abysmal performance.\n\nMoney invested in $SPY would have tripled over the period.","Type":"Retweet","Retweets":32,"Likes":0,"Replies":0},{"Content":"Ok BTC will for sure go up but why buy BTC when I can buy SOL since it will for sure outperform\n\nBut why not just buy BONK instead since it will sure outperform that\n\nBut why even go though this route, can buy a lower cap mcap shitter with onchain going up","Type":"Retweet","Retweets":19,"Likes":0,"Replies":0},{"Content":"@DegenSpartan I was just sucking a dick behind the dumpster. Now people have OF, they have it easy.","Type":"Retweet","Retweets":3,"Likes":0,"Replies":0},{"Content":"this is why i generally disagree with arbitrary prices targets\n\nportfolio target? market doesnt know\nyour position hit some target? market doesnt know\n\nyou sell when its time to sell, not some random milestone, like a 2x 10x or even a house\n\nwhy cant the price still go up? it can","Type":"Tweet","Retweets":33,"Likes":441,"Replies":15},{"Content":"I don't make the rules. https://t.co/yjQrG0SSWF","Type":"Retweet","Retweets":590,"Likes":0,"Replies":0},{"Content":"thanks for playing\n\nyabai desu ne https://t.co/zGFNb7GZbY","Type":"Tweet","Retweets":13,"Likes":241,"Replies":28},{"Content":"the biggest bull trap ive ever seen\n\nbut they wont trap me","Type":"Tweet","Retweets":40,"Likes":917,"Replies":60},{"Content":"id recommend hobbies\n\nranging from constructive self improvement like exercise, reading, cooking, socializing irl etc\n\nto relatively less self destructive (compared to day trading) like watching porn (any genre), hentai appreciation, twitter shitposting, video game addiction etc","Type":"Tweet","Retweets":22,"Likes":315,"Replies":36},{"Content":"@sartajtw Thanks, I’m actually writing a book titled “Poors Participating in Consensus: Why do we let them?” coming out soon","Type":"Retweet","Retweets":13,"Likes":0,"Replies":0},{"Content":"In an attempt to truly understand the social layer, I traveled to the Rust Belt of America and asked a coal miner if he was concerned about Lido centralization and his response:\n\n “what I need is a hard money in which to save and earn that cannot he debased by the bureaucrats","Type":"Retweet","Retweets":49,"Likes":0,"Replies":0},{"Content":"replace \"houses\" with \"coins\"\n\nliterally describing how we turbo autists think about spot crypto\n\nexcept spot crypto has no tenants no cashflow, but also no expenses\n\nanalouge real estate NFTs are out\ndigital global fungible ponzi coins are in","Type":"Tweet","Retweets":19,"Likes":289,"Replies":15},{"Content":"to add to this\n\nwhen i see bots doing guerilla marketing in my replies about projects / companies\n\ni block both the shill and the company that they are promoting","Type":"Tweet","Retweets":5,"Likes":165,"Replies":14},{"Content":"more backing to the theory that ex-US investing will be a dud moving forward","Type":"Tweet","Retweets":11,"Likes":202,"Replies":14},{"Content":"when #bitcoin ETFs are approved, we think these vehicles could see a minimum of $14.4bn of inflows in year 1, ramping to $38.6bn inflows in year 3. \n\nat those levels, BTCUSD could see 75% appreciation the year following approvals 👀 \n\nmore in our new report from today👇 https://t.co/xnA0XpivUp","Type":"Retweet","Retweets":322,"Likes":0,"Replies":0},{"Content":"Men will watch etf tickers appear and reappear all day to gamble their last $500 on instead of getting a job","Type":"Retweet","Retweets":16,"Likes":0,"Replies":0},{"Content":"@DegenSpartan Bullish propaganda: like, comment retweet\n\nBearish Propaganda: mute, block, report","Type":"Retweet","Retweets":8,"Likes":0,"Replies":0},{"Content":"correct\n\nwe will starve the bears out\n\nthis isnt misinformation by omission\n\nthis is just pre-truth","Type":"Tweet","Retweets":22,"Likes":361,"Replies":19},{"Content":"It’s easier to just create a new wallet than revoke premissions fyi","Type":"Retweet","Retweets":6,"Likes":0,"Replies":0},{"Content":"Bloomberg's James Seyffart Unveils How Spot #Bitcoin ETF Issuers Will Compete for Customers with Diverse Services 👀 https://t.co/aSjl0dV40L","Type":"Retweet","Retweets":13,"Likes":0,"Replies":0},{"Content":"you guys are so fucking retarded\n\nmakes me very hopeful and bullish on our future 🙏","Type":"Tweet","Retweets":140,"Likes":1441,"Replies":64},{"Content":"brooooo this guy just took the photo from yesterday's post and added it LMAOOOOOOOO\n\nJust #crypto things lmao \n\nhttps://t.co/zSQiWIxXxK","Type":"Retweet","Retweets":16,"Likes":0,"Replies":0},{"Content":"@BenArmstrongsX @Bethanyliterary @DuchessOfDeFi \"I am getting divorced but just for the avoidance of doubt I AM still getting laid.\"","Type":"Retweet","Retweets":37,"Likes":0,"Replies":0},{"Content":"Wait, with today's update, now the iShares Bitcoin Trust IBTC is gone from DTCC's list?  @EricBalchunas @JSeyff  https://t.co/r5vYkAXroW https://t.co/fH9oy4ribx","Type":"Retweet","Retweets":312,"Likes":0,"Replies":0},{"Content":"BTC down $1000 on news that bitboy does more sex than you","Type":"Tweet","Retweets":26,"Likes":570,"Replies":30},{"Content":"the tardfi mind cannot comprehend this https://t.co/mFhwYt9Nal","Type":"Tweet","Retweets":42,"Likes":461,"Replies":29},{"Content":"im extremely optimistic about a globally sync retarded af ultra omega crypto revanchist supercycle pump\n\nbut im rather pessimistic that it will be this cycle, or even the next\n\ni hope i dont die before i see it happen\n\nit will be absofuckinglutely amazing to behold and be part of","Type":"Tweet","Retweets":18,"Likes":419,"Replies":28},{"Content":"https://t.co/kxr6VpqR4e","Type":"Retweet","Retweets":38,"Likes":0,"Replies":0},{"Content":"most people dont know this\n\n3 years ago i used to be a small alt account that aggregated and posted hentai only\n\nthen i slowly pivoted to crypto after i found out that it was so easy to make money\n\nlater that month was when i bought my very first, one and only, whole unit of ETH","Type":"Tweet","Retweets":13,"Likes":654,"Replies":57},{"Content":"yall want the last month and a half of tweets, or should i nuke them all before i leave so the newbies never find out about the biggest bull trap that ive ever seen which wont trap me","Type":"Tweet","Retweets":10,"Likes":330,"Replies":41},{"Content":"cobie, truly an inspiration to us all\n\ni wonder what language he learnt? hopefully not wassie aww watafak lmwo :3\n\nrenewed conviction to stick to my guns and deplatform myself end of the month","Type":"Tweet","Retweets":22,"Likes":741,"Replies":56},{"Content":"after that, you watch margin call (2011)\n\neveryone's favorite scene is the senior partners emergency meeting, where they decide to \"sell it all\"\n\nbut i also love kevin spacey's fire sale scene, ordering his soldiers to fucking dump it all\n\nkill or be killed\ndump or get dumped on https://t.co/LwDEzU25Uj","Type":"Tweet","Retweets":19,"Likes":386,"Replies":26},{"Content":"We're just getting started. \n\n#bitcoin https://t.co/DkS0SzSVYG","Type":"Retweet","Retweets":76,"Likes":0,"Replies":0},{"Content":"so vombatus, well not a real wombat, a profile on friend tech bought all of its own keys so that he was first on the leaderboard and then he sold them all today for 851 eth to cause chaos on the day that bitcoin broke out. so funny but hard to understand if you dont know crypto https://t.co/iElXrrVbiu","Type":"Retweet","Retweets":37,"Likes":0,"Replies":0},{"Content":"@DegenSpartan How about this https://t.co/X9Ro6TV6kh","Type":"Retweet","Retweets":12,"Likes":0,"Replies":0},{"Content":"we just lost $34k BTC\nprobably losing $1.8k ETH soon too\n\nit's so over\nwe're never coming back from this https://t.co/rlgz4nNpDs","Type":"Tweet","Retweets":35,"Likes":549,"Replies":67},{"Content":"boku no pico\nyabai desu\n\n@DegenSpartan https://t.co/prlTm4Ssg9","Type":"Retweet","Retweets":3,"Likes":0,"Replies":0},{"Content":"to one-up americans on health care, work-life balance, public transportation and lack of tipping culture\n\nbut lose on every other front","Type":"Tweet","Retweets":9,"Likes":257,"Replies":20},{"Content":"intern's latest video has more specific context about today's market\n\nbut this has always been my favorite video\n\n(i also have half the same titles as kerry 😂)\n\nbuy the dips, sell the rips\nabove all else stay alive, no liqs","Type":"Tweet","Retweets":29,"Likes":315,"Replies":10},{"Content":"@DegenSpartan 💪 https://t.co/2wjRG8t4VV","Type":"Retweet","Retweets":5,"Likes":0,"Replies":0},{"Content":"youtube serving me AI generated elon musk deepfake ads about using quantum computing with AI to invest into forex trading to 38x your money in 3 days\n\neven the scammers are off field and not positioned for a crypto bull run \n\nmomo fad investing, just like trad money VCs lmwo 🤣","Type":"Tweet","Retweets":11,"Likes":210,"Replies":10},{"Content":"Directionally if you plan to short a market that you expect to be up 10000% plus over the next decade you are playing russian roulette but the gun is fully loaded.  \n\nName one permabear that survived 2 cycles in crypto. They appear at the froth make money for 1 year and then die.","Type":"Retweet","Retweets":16,"Likes":0,"Replies":0},{"Content":"imagine getting trapped by this obvious bull trap\n\ncouldnt be me\n\n4dding to shorts\n\nblessed are the short, for they will inherit the earth","Type":"Tweet","Retweets":20,"Likes":623,"Replies":36}]