[{"Content":"Sell everything next time I come back if you don't want to be poor.\n\nThis has a 💯 success rate, anon.\n\nBTW, Jurassic Park 🦖 will be making a comeback.\n\nThe first 2 editions in 2022 had millions of impressions + 1000s of RTs.\n\nDM if there's a project you'd like interviewed.","Type":"PinnedTweet","Retweets":0,"Likes":41,"Replies":8},{"Content":"It's okay anon, you had an entire year to deploy.\n\nWish you better luck in 2029.","Type":"Tweet","Retweets":20,"Likes":48,"Replies":10},{"Content":"Sooo, we firing that intern or whut? Hacked eh?","Type":"Tweet","Retweets":1,"Likes":13,"Replies":10},{"Content":"Are there any interesting projects I should interview for the forthcoming edition of Jurassic Park 🦖?\n\nDrop them in comments or DM and I'll reach out to them, no matter big or small.\n\nGot a few projects joining the 3rd edition cohort that I'm really excited for.","Type":"Tweet","Retweets":0,"Likes":14,"Replies":14},{"Content":"Probably @eigenlayer, @monad_xyz, @AvailProject among a few others.","Type":"Tweet","Retweets":11,"Likes":78,"Replies":36},{"Content":"Depositoooors will rejoice in a few months.\n\nDon’t forget to stack.","Type":"Tweet","Retweets":0,"Likes":20,"Replies":5},{"Content":"It's not often you find a mispriced asset that's at the intersection of two sectors that can change the world. \n\nAmbitious roadmap, fat liquidity, smooth token swap, no \"B/S\" taxes + acknowledged by the leaders of their respective sectors as a real need for muh decentralization.","Type":"Tweet","Retweets":7,"Likes":58,"Replies":25},{"Content":"Bountiful airdrops have the least eyes on them and ambiguous instructions.\n\nEmerging chains also have less sophisticated actors and wash traders, making you a big fish in a small pond.\n\nGo where nobody is looking.\n\nFirst it'll lonely, then eventually, you're an early adopter.","Type":"Tweet","Retweets":0,"Likes":47,"Replies":3},{"Content":"People conflate success with luck, but they won't understand the amount of round trips you had to endure.\n\nCritics won't understand the mental gymnastics you play on yourself to even stand a chance.\n\nYour journey from 0 to 100x is not a self-fulfilling prophecy.\n\nAsk them to try.","Type":"Tweet","Retweets":2,"Likes":52,"Replies":5},{"Content":"During periods of continued strength, sometimes it’s better to keep betting on the fastest horse.\n\nYour laggards might be behind because there’s no mindshare, not because it’s undervalued.","Type":"Tweet","Retweets":1,"Likes":90,"Replies":28}]