[{"Content":"🫰✌️ https://t.co/ePvV2XKASo","Type":"PinnedTweet","Retweets":263,"Likes":1469,"Replies":487},{"Content":"friendtech now supports deposits directly from your Coinbase account. Tap your wallet balance in the top right of the app to find the option https://t.co/vsobZL6gjy","Type":"Tweet","Retweets":55,"Likes":437,"Replies":197},{"Content":"Tonight we're doing our final weekly distribution of points for the beta period, bringing the total number of points distributed to 90 million.\n\nThe remaining 10 million beta period points will be distributed during our upcoming v2 launch https://t.co/KjNopV1YFj","Type":"Tweet","Retweets":112,"Likes":721,"Replies":188},{"Content":"A haiku about friendtech v2: \n\nMoney clubs\nPoints will have a point\nCustom curves","Type":"Tweet","Retweets":64,"Likes":536,"Replies":193},{"Content":"We've partnered with Rainbow to celebrate our new external wallet support. They'll be awarding bonus Rainbow Points to users who buy and sell keys on friendtech using their Rainbow wallet this week","Type":"Tweet","Retweets":23,"Likes":188,"Replies":44},{"Content":"It’s 4:20pm on Tuesday, you know what that means! This week’s Rainbow Points have been dropped! Check your wallet to see how many you earned.\n\n🆕 FriendTech Bonus Points ✨✨✨\nWe heard you love Points so we partnered with @FriendTech so that you can earn points while you earn… https://t.co/03o4ceT0Pf","Type":"Retweet","Retweets":54,"Likes":0,"Replies":0},{"Content":"friendtech now supports external wallets for new users.\n\nConnect, trade, and own your keys with your preferred apps and extensions like Rainbow, Metamask, and Coinbase Wallet https://t.co/Xomyjw9QAy","Type":"Tweet","Retweets":41,"Likes":355,"Replies":87},{"Content":"next tuesday 👀 https://t.co/HYGnZFYENx","Type":"Retweet","Retweets":178,"Likes":0,"Replies":0},{"Content":"Apple's iOS 17.1 (both 17.1.1 and 17.1.2) contained a bug which interfered with push notification delivery for PWAs such as https://t.co/YOHabcBL3H.\n\nPlease update to iOS 17.2 in your phone's settings to pick up their fix and re-enable notifications https://t.co/XZOiFXeNkr","Type":"Tweet","Retweets":33,"Likes":160,"Replies":122},{"Content":"We're hiring a Senior Smart Contract Engineer to join the friendtech team. Check our job listing below \n\nhttps://t.co/oYxevq7pR0","Type":"Tweet","Retweets":69,"Likes":445,"Replies":123},{"Content":"We have completed onchain transactions to transfer ownership of the friendtech contract and funds to a new combination of multisig and professional custody.\n\nThese changes will improve the long term security of friendtech and allow us to fulfill tax obligations","Type":"Tweet","Retweets":120,"Likes":572,"Replies":273},{"Content":"Checking the chain is easier with the new top buyer and seller lists on the Explore tab https://t.co/SaQzthsHQm","Type":"Tweet","Retweets":121,"Likes":334,"Replies":209},{"Content":"Keyholders have skin in the game which we believe puts them in the best position to curate the feed and award points.\n\nStarting today, users will receive votes based on the number and price of the keys they hold instead of the price of their own key https://t.co/X0Btg53RZd","Type":"Tweet","Retweets":153,"Likes":551,"Replies":261},{"Content":"Points this week will be given out based on how many votes users receive for their posts. Amplify messages you believe in and reward their creators https://t.co/zxcPDa1wpA","Type":"Tweet","Retweets":187,"Likes":523,"Replies":291},{"Content":"Looking for even more posts to read on https://t.co/YOHabcBL3H? Check out the new Recent feed and profile update https://t.co/qWj0XmUBV8","Type":"Tweet","Retweets":184,"Likes":414,"Replies":191},{"Content":"We've been working to reduce botting. Today, we identified and removed 600k accounts identified as bots from the feed's vote distribution.\n\nIf you believe your account was identified as a bot in error, please contact support@friend.tech and include your X/Twitter username","Type":"Tweet","Retweets":289,"Likes":781,"Replies":338},{"Content":"Introducing the friendtech feed, a globally ranked text feed where users move posts up and down by casting votes.\n\nUsers receive votes to cast every day at 12pm ET based on their key prices.\n\nLive now at https://t.co/IpBpKmyEdK https://t.co/App90TFChq","Type":"Tweet","Retweets":242,"Likes":685,"Replies":201},{"Content":"Voting starts soon. A new way to interact in the https://t.co/YOHabcBL3H app https://t.co/qlCKTYeReN","Type":"Tweet","Retweets":206,"Likes":635,"Replies":245},{"Content":"Introducing Trade Comments, an exclusive perk for keyholders https://t.co/a5dFb6UVbL","Type":"Tweet","Retweets":269,"Likes":722,"Replies":302},{"Content":"We've just completed an upgrade to make data load up to 10x faster in the friendtech app.\n\nThank you for bearing with performance issues as we continue to make improvements during the beta https://t.co/m3eyKFtTTL","Type":"Tweet","Retweets":449,"Likes":985,"Replies":348},{"Content":"The https://t.co/YOHabcBL3H app is back online as we continue to improve our bot protection and scalability. Thank you for your patience during this beta program","Type":"Tweet","Retweets":249,"Likes":532,"Replies":405},{"Content":"You'll find new stats in the Home tab including your global key price rank. What rank are you? https://t.co/kX8mp96NB4","Type":"Tweet","Retweets":289,"Likes":576,"Replies":390},{"Content":"The friendtech app experienced performance issues today due to a denial of service attack on our chat servers.\n\nThe app is once again functioning as normal. Thank you for your patience","Type":"Tweet","Retweets":239,"Likes":575,"Replies":285},{"Content":"Customizable bios are here. Show us yours in the replies https://t.co/h0xQgKw297","Type":"Tweet","Retweets":323,"Likes":864,"Replies":586},{"Content":"You can now add a 2FA password to your https://t.co/YOHabcBL3H account for additional protection if your cell carrier or email service becomes compromised.\n\nNeither the friendtech nor Privy teams can reset these passwords, so please use care when using this feature https://t.co/g0m2E4att2","Type":"Tweet","Retweets":438,"Likes":1051,"Replies":413},{"Content":"Our https://t.co/YOHabcBL3H help desk has moved to support@friend.tech so we can assist more users without worrying about Twitter DM rate limits","Type":"Retweet","Retweets":917,"Likes":0,"Replies":0},{"Content":"The calculation for this week's points distribution contained a bug which resulted in some users having their accrued points set to zero. It was not our intention to remove points from any user.\n\nWe have fixed this bug and redistributed this week's points","Type":"Tweet","Retweets":276,"Likes":1112,"Replies":675},{"Content":"Our https://t.co/YOHabcBL3H help desk has moved to support@friend.tech so we can assist more users without worrying about Twitter DM rate limits","Type":"Tweet","Retweets":917,"Likes":1433,"Replies":1048},{"Content":"New watchlist feature: See real time activity for trades involving your watchlist https://t.co/rFMcJt8E6E","Type":"Tweet","Retweets":286,"Likes":924,"Replies":446},{"Content":"You can now link directly to your profile Copy anyone's link from the top right of their chatroom. Share your link in the replies! https://t.co/TbPmv37MIP","Type":"Tweet","Retweets":420,"Likes":1480,"Replies":1727},{"Content":"Don't own a phone? You can now use https://t.co/YOHabcBL3H in your desktop or laptop web browser https://t.co/bHbfOVSsSA","Type":"Tweet","Retweets":649,"Likes":2586,"Replies":1301},{"Content":"What's the better name?","Type":"Tweet","Retweets":222,"Likes":525,"Replies":544},{"Content":"Keep an eye on your friends before you buy their keys with our new watchlist feature https://t.co/QuK4lohOjz","Type":"Tweet","Retweets":432,"Likes":1492,"Replies":698},{"Content":"See how many people read your message with our new view counts feature https://t.co/NrWxEC53mj","Type":"Tweet","Retweets":369,"Likes":1586,"Replies":881},{"Content":"See if you're mutuals with our new profile tags https://t.co/RK3Tenhb9Z","Type":"Tweet","Retweets":423,"Likes":1725,"Replies":1175},{"Content":"Get personalized recommendations based on the keys your friends hold in the new For You list.\n\nFind it on the Explore tab https://t.co/hZZtbfSCYG","Type":"Tweet","Retweets":243,"Likes":799,"Replies":644},{"Content":"Base has resumed functioning normally and you can once again trade without issues in the friendtech app. Thank you for your patience","Type":"Tweet","Retweets":210,"Likes":560,"Replies":500},{"Content":"Base is experiencing a service interruption. All funds are safe but users are unable to submit txns. The Base team is investigating and providing updates at https://t.co/qWzKcYGiPc\n\nMessaging and search are working as normal in our app. We’ll post a tweet when trading works again","Type":"Tweet","Retweets":199,"Likes":472,"Replies":274},{"Content":"See who is talking right now with the New Posts lists https://t.co/tHHwE38eDO","Type":"Tweet","Retweets":240,"Likes":591,"Replies":611},{"Content":"Signing up is even easier with our new credit card onboarding. Tell your friends who aren’t familiar with crypto to check it out https://t.co/8h9QQ6Gxju","Type":"Tweet","Retweets":342,"Likes":1217,"Replies":537},{"Content":"Make more informed purchase decisions with the last message timestamps we just added to profiles. \n\nYou may need to force-restart the app to see this new feature immediately https://t.co/vTCOVYbbMw","Type":"Tweet","Retweets":198,"Likes":549,"Replies":347},{"Content":"Bug fix: We’ve fixed an issue which was causing some users to incorrectly seen this screen when signing up.\n\nIf you encountered this bug, please give it another try now https://t.co/CKJMjoHdKL","Type":"Tweet","Retweets":149,"Likes":476,"Replies":457},{"Content":"Replies are here 💬\n\nUse them to add context to your messages https://t.co/ex82Om2fqo","Type":"Tweet","Retweets":227,"Likes":1047,"Replies":871},{"Content":"Need to fix a broken or outdated pfp? Use the ‘Sync profile data’ in Settings to have it fetch your latest pfp from Twitter https://t.co/f604O6KnLa","Type":"Tweet","Retweets":191,"Likes":680,"Replies":431},{"Content":"The new Online Now list in the Explore tab lets you see who you can talk to right now https://t.co/VbaqM41G6Q","Type":"Tweet","Retweets":176,"Likes":866,"Replies":340},{"Content":"Happy birthday, Milady.\n\nA gift for you, invite codes for all Milady and Remilio holders. Claim yours at https://t.co/yhDEYN3wR0 https://t.co/D27NlLlui9","Type":"Tweet","Retweets":281,"Likes":1079,"Replies":455},{"Content":"We're partnering with Nick to show our love to all the sewer rats who use the chain every day.\n\nUse Nick's code 𝗳𝘁-𝘀𝗲𝘄𝗲𝗿𝗿𝗮𝘁 to sign up. It has unlimited uses for the next 2 hours","Type":"Tweet","Retweets":265,"Likes":1269,"Replies":377},{"Content":"You can now send photos to your key holders. Say cheese😁 https://t.co/pzu7xNuvxm","Type":"Tweet","Retweets":559,"Likes":2915,"Replies":961},{"Content":"The Trending list has returned to the Explore tab with a better algorithm https://t.co/G1mEHdXefO","Type":"Tweet","Retweets":231,"Likes":1131,"Replies":509},{"Content":"You are now subscribed to Rat Facts","Type":"Tweet","Retweets":153,"Likes":383,"Replies":190}]