[{"Content":"STRK sentiment reminds me of BNT when it came out.  Might mark the middle of the cycle.","Type":"Tweet","Retweets":3,"Likes":58,"Replies":11},{"Content":"I’m surprised this hasn’t happened already.  How much longer must UNI holders subsidize ETH holders? @haydenzadams","Type":"Tweet","Retweets":1,"Likes":18,"Replies":4},{"Content":"What’s an e-beggar?  Wrong answers only.","Type":"Tweet","Retweets":0,"Likes":15,"Replies":4},{"Content":"Study Goodhart’s Law.  Lessons there.","Type":"Tweet","Retweets":0,"Likes":9,"Replies":1},{"Content":"How about this one? https://t.co/81ZGmG6nvf","Type":"Tweet","Retweets":3,"Likes":49,"Replies":15},{"Content":"My takes are so good that both @llamaonthebrink and @0xMert_ show me love.  Glad I was able to broker some common ground between the tribes.  Next up is Israel and Palestine.  I’ll take it from here. https://t.co/mDUFrl1kfu","Type":"Tweet","Retweets":0,"Likes":20,"Replies":1},{"Content":"Ok so I take it you aren’t in favor of staking tokenized points for fractional ownership of a sybil airdrop and points farm?","Type":"Tweet","Retweets":0,"Likes":25,"Replies":2},{"Content":"I made something https://t.co/JE3mauIYOU","Type":"Retweet","Retweets":6,"Likes":0,"Replies":0},{"Content":"I’m so hyped, I can’t wait for tomorrow to become today and next week to become this week and then we can all be even more hyped.","Type":"Tweet","Retweets":0,"Likes":23,"Replies":3},{"Content":"Actually this just in:\n\n1 HYPE = 1.7 HYPE\n\ne/acc, let’s go.  More hype, faster!\n\nLet’s take it to 1 HYPE = 3 HYPE.","Type":"Tweet","Retweets":0,"Likes":15,"Replies":1},{"Content":"Should just call restaking, rehyping instead.  I just can’t wait for max hype.  🥴","Type":"Tweet","Retweets":2,"Likes":42,"Replies":7},{"Content":"Many good points.","Type":"Tweet","Retweets":0,"Likes":9,"Replies":0},{"Content":"Idk what you guys are mad at with 25%/125%. EAs always excelled at attaching random numbers to unmeasurable things to arrive at outcomes they personally wanted. Let them have their fun","Type":"Retweet","Retweets":4,"Likes":0,"Replies":0},{"Content":"I have a feeling that the reason Zizek sticks out his tongue and licks his lips so much is because he just loves the taste of the words he just said and so on.","Type":"Tweet","Retweets":0,"Likes":41,"Replies":3},{"Content":"When you hear the names of legislation or anything done by the government, it is worth remembering that the group that sent so many people to the guillotine during the French Revolution was called “The Committee of Public Safety”, not the “Cut Off Their Heads Committee”…","Type":"Retweet","Retweets":54558,"Likes":0,"Replies":0},{"Content":"Turns out social consensus on what social consensus will be is that there will be no social consensus.","Type":"Tweet","Retweets":0,"Likes":15,"Replies":2},{"Content":"Tether and Circle will just decide which chain is canonical.","Type":"Tweet","Retweets":16,"Likes":167,"Replies":23},{"Content":"Odds of bailout if geth majority client bug happens.","Type":"Tweet","Retweets":2,"Likes":8,"Replies":7},{"Content":"If you don’t stake, you are basically long a CDS contract on geth where the premium you pay is the staking yield and your payoff is the probability of bailout multiplied by fork token airdrop value plus probability of no bailout multiplied by the value of eth supply reduction.","Type":"Tweet","Retweets":3,"Likes":76,"Replies":6},{"Content":"The destruction of the first estate might have been a mistake.","Type":"Tweet","Retweets":2,"Likes":24,"Replies":3},{"Content":"This makes perfect sense because after the surge, scourge, verge, purge, and splurge is the demiurge.  Reincarnation is just one of the steps of the demiurge.","Type":"Tweet","Retweets":1,"Likes":30,"Replies":2},{"Content":"Should be a token with ticker AN so the pair can be ANUSD.","Type":"Tweet","Retweets":0,"Likes":27,"Replies":5},{"Content":"Someone should just make a business that physically prints these custom figurines.","Type":"Tweet","Retweets":0,"Likes":27,"Replies":4},{"Content":"Uhh… they both die in the end tho.","Type":"Tweet","Retweets":1,"Likes":60,"Replies":8},{"Content":"Gox?","Type":"Tweet","Retweets":1,"Likes":37,"Replies":6},{"Content":"Froth.","Type":"Tweet","Retweets":16,"Likes":201,"Replies":40},{"Content":"Ok hear me out.  I got a solution for ETH.  Just have Ethereum Foundation make a new L2 on ETH that’s exactly the same as ETH.  Now we all have more blockspace.  We can call this new L2 MOAR.  Then when you need even more blockspace, you can just make MOAR2 and MOAR3 etc.","Type":"Tweet","Retweets":5,"Likes":132,"Replies":11},{"Content":"In many ways @aeyakovenko is to MLK what @0xMert_ is to Malcolm X.","Type":"Tweet","Retweets":2,"Likes":53,"Replies":9},{"Content":"Turns out there is no consensus at all. 😵‍💫","Type":"Tweet","Retweets":0,"Likes":24,"Replies":4},{"Content":"Turns out this statement is getting too consensus.","Type":"Tweet","Retweets":2,"Likes":115,"Replies":12},{"Content":"As funny as it was, hating on ETH is getting too consensus.","Type":"Tweet","Retweets":5,"Likes":100,"Replies":17},{"Content":"I waited over six and a half years to be right on this one.","Type":"Tweet","Retweets":28,"Likes":408,"Replies":26},{"Content":"This what it looks like to me right now. https://t.co/x4mvrhHoeD","Type":"Tweet","Retweets":9,"Likes":95,"Replies":13},{"Content":"You guys somehow managed to make coins for the whole zodiac.","Type":"Tweet","Retweets":0,"Likes":23,"Replies":1},{"Content":"This is @blknoiz06 and Mentor Chen.","Type":"Tweet","Retweets":1,"Likes":33,"Replies":2},{"Content":"😕","Type":"Tweet","Retweets":0,"Likes":66,"Replies":19},{"Content":"This new guy will surely not require a license for people to make toast in their own toaster.","Type":"Tweet","Retweets":3,"Likes":22,"Replies":3},{"Content":"Next cycle, someone is going to create a token for a 5m tps centralized database on AWS and make the SOL bros cope.  The forever turning wheel of crypto samsara.","Type":"Tweet","Retweets":12,"Likes":183,"Replies":17},{"Content":"Ethereans, it should give you some SOLace to know that what the SOL bros are doing to you right now will one day happen to them as well.  Crypto samsara.  Eternal cycles of suffering and cope.","Type":"Tweet","Retweets":5,"Likes":119,"Replies":7},{"Content":"Is 🦇🔊 the new laser eyes?  Crypto samsara.  Birth and rebirth.","Type":"Tweet","Retweets":3,"Likes":49,"Replies":10},{"Content":"The endless karmic cycles of crypto samsara.","Type":"Tweet","Retweets":0,"Likes":39,"Replies":3},{"Content":"Crypto samsara.  Endless cycles of cope.","Type":"Tweet","Retweets":1,"Likes":44,"Replies":3},{"Content":"Is 0xbc2 just paranoid or do they know something?","Type":"Tweet","Retweets":3,"Likes":15,"Replies":3},{"Content":"Would have preferred a name like wraith, banshee, or spirit in keeping with the tradition.","Type":"Tweet","Retweets":1,"Likes":7,"Replies":3},{"Content":"Money thesis is trying to solve a problem most people don’t believe exists.  Tech thesis targets obvious problems apparent everyone and then usually failing to solve them.","Type":"Tweet","Retweets":5,"Likes":37,"Replies":5},{"Content":"This is our crypto version of samsara.  Endless cycles of suffering.  Very slowly, with every cycle, reducing karmic debt.  Hoping to one day achieve nirvana.","Type":"Tweet","Retweets":2,"Likes":65,"Replies":5},{"Content":"Bored Ape Kennel Club was really seeing-eye dogs all along.","Type":"Tweet","Retweets":1,"Likes":21,"Replies":3},{"Content":"Headlock seems like a good idea.  No obvious way to break it.","Type":"Tweet","Retweets":1,"Likes":7,"Replies":4},{"Content":"At this rate, SCP should just acquire Uniswap Labs instead.  It’s like growing your own food.  For sustainable farming they can airdrop some pnl back to the LPs.  It’s like rakeback.","Type":"Tweet","Retweets":5,"Likes":24,"Replies":3},{"Content":"Turns out CT was right.  More healing was needed.","Type":"Tweet","Retweets":1,"Likes":31,"Replies":5}]