[{"Content":"The pseudonymous crypto trader @GiganticRebirth was feeling bearish at the market top last November. This is how his @RebirthDAO shorted the market crash. @0x_bae reports.\nhttps://t.co/tHHpWnyRuG","Type":"Retweet","Retweets":260,"Likes":0,"Replies":0},{"Content":"Haven't logged into this shadowbanned account in awhile\n\nLot of DMs asking if I died\n\nFor those that didn't know\n\nI've been tweeting on @GCRClassic for an entire year\n\nPeace Be Upon You","Type":"Tweet","Retweets":138,"Likes":1159,"Replies":129},{"Content":"I had always assumed they were hedging it on betfair","Type":"Tweet","Retweets":38,"Likes":747,"Replies":107},{"Content":"I hope. for the sake of the industry, that the final piece of my prophecy does not unfold\n\nThese predictions were made in 2021 at 50k, so don't assume it's going to bottom tick some precise number;  it's always darkest before the dawn","Type":"Tweet","Retweets":309,"Likes":2310,"Replies":171},{"Content":"If you're looking for advice as to where to find safety\n\nThe same advice I gave last week, is where I currently stand;  shame my shadowban prevented more people from seeing it","Type":"Tweet","Retweets":44,"Likes":678,"Replies":69},{"Content":"Can't believe they let me short the top of LUNA [Classic] again, 6 months after the original\n\nBut all good investments must one day be realized\nTotal funding:  $878,600.04\n\nGCR has been liquidated https://t.co/cE0wHqmQM7","Type":"Tweet","Retweets":103,"Likes":1062,"Replies":154},{"Content":"Ironically, most bullish path for $DOGE would be for twitter to never actually integrate it into anything\n\nWould be for Musk to tease, hint, meme, riddle, joke, that there was a master plan for years; allow people's imaginations to go wild\n\nWe call it the Hoskinson; never deliver","Type":"Tweet","Retweets":454,"Likes":5457,"Replies":479},{"Content":"What bear market?\nWe just do a little inverse investing when traders begin to imagine it's a new paradigm again https://t.co/VZjPto30go","Type":"Tweet","Retweets":268,"Likes":2132,"Replies":248},{"Content":"cleanse your mind of your ....","Type":"Tweet","Retweets":30,"Likes":557,"Replies":92},{"Content":"Impressive achievement in decentralized coordination\n\nMany will not fully appreciate the level of difficulty in what was accomplished","Type":"Tweet","Retweets":97,"Likes":1417,"Replies":98},{"Content":"Volatile day in the markets\n\nBitcoin sold off heavily with equities on hotter than expected CPI\nHeavy sell off in LUNC on news that Terraform CEO Do Kwon faces arrest warrant in South Korea\n\nUpdate on my positions [ + fully out of my modest LUNA 2.0 short for now, ~$2.5] https://t.co/UboP3YX7MF","Type":"Tweet","Retweets":76,"Likes":1289,"Replies":155},{"Content":"Surprisingly well written briefing\nTime is a flat circle","Type":"Tweet","Retweets":31,"Likes":535,"Replies":88},{"Content":"Pair trading was an abandoned art discarded in the indiscriminate bull market\nWhen you long strength against collapse, you win on both sides https://t.co/zQiOm4Git5","Type":"Tweet","Retweets":145,"Likes":2061,"Replies":191},{"Content":"4th of July financial advice\n\nLong trump, short DeSantis for the 2024 republican nomination\n\nwherever you can source liquidity [BetFair, online bookies such as ladbrokes/paddypower;  PredictIt; \ncrypto sources Augur, Polymarket, Kalshi, etc]\n\nhttps://t.co/GLyCINK65g","Type":"Tweet","Retweets":90,"Likes":983,"Replies":205},{"Content":"English poet Thomas Howell used to have an old idiom;  don't count your chickens before they hatch\n\nI have acquired the 120,000 LUNA shares necessary to cover \"risk\" associated with the 20 million USD in escrow pending March 2023 price\n\nFinal cost basis to cover:  72 cents https://t.co/3qcsUPNFd5","Type":"Tweet","Retweets":751,"Likes":8374,"Replies":788},{"Content":"note, some of the quotes from the interview are now old","Type":"Tweet","Retweets":47,"Likes":775,"Replies":108},{"Content":"My \"inverse investments\" are with great companies https://t.co/MviEvlouQb","Type":"Tweet","Retweets":231,"Likes":3519,"Replies":337},{"Content":"Update on \"the bet\":  Since my 20 million wasn't able to be matched on $LUNA\n\nI made the bet by myself with derivatives https://t.co/l1SjpFMm99","Type":"Tweet","Retweets":185,"Likes":2381,"Replies":250},{"Content":"@Cryptomodollas high confidence interval that we're very late in the cycle\n[and that cycles still exist]\n\nsecure your freedom if you've won it","Type":"Retweet","Retweets":101,"Likes":0,"Replies":0},{"Content":"thinking of setting up a clinic for trading addictionology\nmost are losing money through physiological dependence;  nothing more\n\na nice resort somewhere in Asia\nnice comforts for all inmates to help unwind, relax, and most importantly\n\ncleanse your mind of your peak net worth https://t.co/gqUEnHRVnI","Type":"Retweet","Retweets":86,"Likes":0,"Replies":0},{"Content":"the market cap of the APE token [6 billion/22b fd] now far eclipses the total cap of BAYC [4 billion];  and is also doing far more volume than alt2 tokens","Type":"Tweet","Retweets":30,"Likes":546,"Replies":39},{"Content":"in your heart, you know it's true","Type":"Retweet","Retweets":19,"Likes":0,"Replies":0},{"Content":"While I'd like to take credit for predicting on @BanklessHQ that other L1s would join the $UST game, that idea came from the wizard @GiganticRebirth.\n\nKey Q. now is whether alt-algostables will complement $UST, or we get a clash that makes the Curve Wars look like a pillow fight.","Type":"Retweet","Retweets":19,"Likes":0,"Replies":0},{"Content":"The success MATIC had gigantically rebirthing as POLYGON in 2021, led dozens of vaporchains to EVM rebrands\n\nSo too, WAVES has runup 5x in past month repositioning itself as a crude facsimile of LUNA\n\nOther teams have taken note; market will soon be flooded with more copycats","Type":"Retweet","Retweets":71,"Likes":0,"Replies":0},{"Content":"Justin Sun adopting the Terra playbook to launch an algo stable with higher yield than Luna is just about the most preordained timeline\n\nMany have already forgotten Sun was the first mover with L1 EVM in '20 defi summer with JustSwap","Type":"Tweet","Retweets":43,"Likes":654,"Replies":22},{"Content":"correct that exit polls are illegal in FR\nhowever, Belgium's RTBF, is not bound by FR media blackout, releases early exits\n\nWestern traders didnt know this in 2017, which allowed more savvy traders to get an early edge on projecting the outcome [mostly alpha for the MOV markets]","Type":"Tweet","Retweets":8,"Likes":134,"Replies":21},{"Content":"In 2017 there was a pervasive belief with both pundits and punters in 'shy Le Pen\" voters \n\nContrary, when the votes were counted, LP actually greatly underperformed polling\n\nWhile 2022 wont be another landslide, we will get the identical result for both round 1 + 2\n\nMacron wins","Type":"Retweet","Retweets":6,"Likes":0,"Replies":0},{"Content":"@knowerofmarkets what ive been telling ppl for weeks\n\nthe greatest threat to any successful project is its own success\n\nsuccess breeds imitation, and this is a mercenary industry that will ruthlessly move to derivatives of original chasing higher upside [from VCs to traders to ultimately retail]","Type":"Retweet","Retweets":61,"Likes":0,"Replies":0},{"Content":"pre·dict·a·ble\nadjective\n𝘢𝘣𝘭𝘦 𝘵𝘰 𝘣𝘦 𝘱𝘳𝘦𝘥𝘪𝘤𝘵𝘦𝘥 https://t.co/09LpQvPt3M","Type":"Tweet","Retweets":14,"Likes":290,"Replies":35},{"Content":"imagine if instead of holding undercollateralized stablecoins [that are increasingly going to be hunted, seized, and possibly frozen by regulators]\n\nyou could just hold BTC\n\nand if, risk averse, you could even short the BTC you hold, collect free funding, and be in synthetic fiat","Type":"Retweet","Retweets":176,"Likes":0,"Replies":0},{"Content":"this isn't going to be popular, but think it's important to drive home;  trading losses don't compare to full hack\n\nand if you're going to self custody, put heavy duty hours into research","Type":"Tweet","Retweets":24,"Likes":484,"Replies":37},{"Content":"bounced right off that $10 meme support as expected\n\nbut not fully a meme;  hard round numbers are obvious convergence points on nebulously valued, reflexive assets;   respect the schelling point","Type":"Tweet","Retweets":15,"Likes":416,"Replies":27},{"Content":"alt3 volume","Type":"Tweet","Retweets":16,"Likes":267,"Replies":15},{"Content":"lowkey tier1 influence:  @insiliconot","Type":"Tweet","Retweets":24,"Likes":565,"Replies":33},{"Content":"Nearly 8 months since this prediction, NFT projects are realizing tokenization is the path towards liquidity, volume, and maximum profit","Type":"Tweet","Retweets":25,"Likes":475,"Replies":22},{"Content":"Since @cobie has tweeted he is setting up multisig \n\nWe owe it to the culture to put some actual real size/conviction on this bet, as was initial spirit\n\nOffering to double this up to 20 million with @stablekwon\n\nI will match/donate 1 milli to @angelprotocol charity if he accepts","Type":"Tweet","Retweets":162,"Likes":1956,"Replies":245},{"Content":"accepted\n\n10 million sent to DAO wallet","Type":"Tweet","Retweets":193,"Likes":2067,"Replies":201},{"Content":"Interested in same bet for 10 million dollars [considered offering 50 million, but escrow becomes tricky]\n\nWould donate half to charity\n\nExpect price to pump short term, but in 1 year, supremely confident the current narrative is lost\n\n@stablekwon","Type":"Tweet","Retweets":428,"Likes":3127,"Replies":428},{"Content":"Manchin and Sinema will vote to confirm","Type":"Tweet","Retweets":3,"Likes":175,"Replies":16},{"Content":"The reason I decided to look into token unlocks was actually a tweet from GCR himself: https://t.co/VjLrdRfbYJ\n\nThis together with some great tweets like this https://t.co/Y54x32Ll5f, made me realise 2022 is the year of unlocks.","Type":"Retweet","Retweets":33,"Likes":0,"Replies":0},{"Content":"A few days ago @GiganticRebirth's ‘Big short’ article popped up. Great read.\n\nA while back I did research on token unlocks myself. I’ve attached a sheet with unlock info of some tokens\n\nIn the thread below, I will share some thoughts on FDV &amp; Unlocks\n\n🧵👇\nhttps://t.co/Z2uan3VxGm","Type":"Retweet","Retweets":403,"Likes":0,"Replies":0},{"Content":"the tree of life","Type":"Tweet","Retweets":16,"Likes":384,"Replies":21},{"Content":"Alexa, what month is it?","Type":"Tweet","Retweets":21,"Likes":697,"Replies":64},{"Content":"Compare the market cap of NFT projects to some prominent meme tokens\n\n-SHIBA reached 60 billion cap at peak\n-Not a single NFT has a 1 billion dollar cap [exception BAYC]\n\nAltcoins 2.0 seem overvalued relative to NFT growth;  I predict tokenization of NFTs to eat into alt2 volume","Type":"Tweet","Retweets":131,"Likes":1041,"Replies":84},{"Content":"imagine a world where you could long or short the networth, earnings, valuation, and growth of other individuals [not corporations]\n\nnow a shareholder in other people;  identifying [+ cultivating] under the radar talent, or flipping bearish on someone as you sense they had peaked","Type":"Tweet","Retweets":167,"Likes":1356,"Replies":176},{"Content":"[2]\nIn reality, theres dozens of other coins with similar setups outside SOL\n\n1-This is PvP season\n2-The Stanfords are coming\n\nYoure only go to be rewarded for rigorous research and contrarian insights;  you have to shed a lot of the habits you acquired the past year and level up","Type":"Tweet","Retweets":25,"Likes":509,"Replies":24},{"Content":"[1]\n\nThe market converged around narrative that only SOL ecosystem tokens had low float/high FDV model\n\nCrowded around the same 8 shorts, months after I introduced, the Big Short thesis [tokens down 90%]\n\nAnd after I announced I closed those positions\n\n$MER just another example","Type":"Tweet","Retweets":9,"Likes":255,"Replies":13},{"Content":"Two ways to view a short\n\n1  A trade\n2 'Inverse investment'\n\nIf confidence interval for 1yr price &gt; 95%, will 'invest' + not concern myself with short term gyrations\n\nI've chosen to 'invest' in $PEOPLE at 9c;  squeeze to ATH is possible, but my investment is with a great company","Type":"Tweet","Retweets":83,"Likes":871,"Replies":53},{"Content":"Future forecast update\n\n\"The Supreme Court’s oldest member — Justice Stephen Breyer — plans to retire, a person familiar with the process said Wednesday\"","Type":"Tweet","Retweets":5,"Likes":216,"Replies":28},{"Content":"@GiganticRebirth Wp man, have my vote for best trader in the space.  Most level headed and unbiased for sure. https://t.co/npduInLzeG","Type":"Retweet","Retweets":3,"Likes":0,"Replies":0}]