[{"Content":"Still maybe my fav crypto vid ever","Type":"PinnedTweet","Retweets":8,"Likes":96,"Replies":28},{"Content":"I often wonder\n\nIn 2021, would BTC have peaked at 42k if Tesla had not bought?\n\nWould the yellow circle have been the peak of the complacency bounce?\n\nMaybe the answer is no if there were enough GBTC inflows? But in some ways, GBTC was better than ETFs because you couldn’t sell… https://t.co/YBc66eFHLb","Type":"Tweet","Retweets":0,"Likes":2,"Replies":1},{"Content":"Kidding aside, if you are sidelined\n\nI think it’s likely we see at least a day of lower inflows when the market panics and we get a decent dip\n\nMaybe next week, I dunno, but even tho today’s inflows were great at $350m, it is a decrease","Type":"Tweet","Retweets":0,"Likes":16,"Replies":6},{"Content":"Gold is to Bitcoin as ETH is to Solana\n\nYeah Gold may go up over time, but it’s so big and old and over-owned\n\nBoomers selling their Gold for the new shiny Bitcoin version which will pump harder\n\nWith this thesis, you don’t even need real interest in BTC - just a simple rotation","Type":"Tweet","Retweets":0,"Likes":10,"Replies":4},{"Content":"What do you think it will look like when the UAE decides to buy $100 billion of BTC?\n\nIt will probably look something like this for a few days straight before a public announcement\n\nIt’s going to happen sooner or later","Type":"Tweet","Retweets":0,"Likes":29,"Replies":4},{"Content":"One of these days we are going to see straight vertical candles like this on Bitcoin that just go up 10k, 20k, 30k in a minute\n\nThere’s just not that much Bitcoin\n\nBeautiful","Type":"Tweet","Retweets":0,"Likes":19,"Replies":2},{"Content":"Gradually and then suddenly \n\nPeople are figuring it out\n\nThe USA is a crumbling shithole","Type":"Tweet","Retweets":0,"Likes":8,"Replies":2},{"Content":"“Muh take profit your entries aren’t generational” \n\nI created my account at the stone bottom. My entries ARE generational. \n\nFuck you.","Type":"Retweet","Retweets":13,"Likes":0,"Replies":0},{"Content":"At this rate it now seems obvious and somewhat inevitable that BTC will get to $70k by halving\n\nAs long as the inflows continue, it will be up only\n\nAnd once we get near $60k, ppl will bang the drums for ATH\n\nAnd once we get near $75k, news headlines will take us to $100k\n\n✌🏻🎌","Type":"Tweet","Retweets":0,"Likes":24,"Replies":2},{"Content":"Wish I had like 3x more BTC than I do\n\nOh well, it is what it is\n\nGlad I don’t have any ETH tho, absolute  garbage\n\nYou better believe I’ll buy some ETH in May tho\n\nWhen the ETFs get rejected and we see a -50% daily candle, I’ll buy the ETH maxi blood and tears","Type":"Tweet","Retweets":0,"Likes":33,"Replies":3},{"Content":"Still scrolling thru timeline from overnight, but this is easily the most important crypto development of the past week\n\nSurprised more ppl not talking about this","Type":"Tweet","Retweets":0,"Likes":37,"Replies":7},{"Content":"Study law\n\nStudy the actual BTC spot ETF approval orders\n\nStudy historical correlation charts for BTC and ETH\n\nThe ETH ETFs are not coming in May - maybe 2025 if the correlation analysis improves and Trump wins","Type":"Tweet","Retweets":0,"Likes":5,"Replies":3},{"Content":"Anyone selling you an “ETH rotation” right now is an idiot, full stop\n\nBTC is going up because of massive new inflows thru the ETFs, none of which will transfer to ETH\n\nCT is dead quiet cuz no one holds BTC, so there won’t be a wealth effect on ETH\n\nThese are facts","Type":"Tweet","Retweets":0,"Likes":37,"Replies":9},{"Content":"Do we think the cartel may try anything crazy like spiking BTC price on Super Bowl Sunday to spark normie fomo?","Type":"Tweet","Retweets":0,"Likes":14,"Replies":2},{"Content":"I never understand why any giga ETH whales ever sell ETH\n\nWhy does Vitamin ever send any ETH to a CEX?\n\nIf you have $300 million, and you want $4 million in liquidity, just put double that in AAVE or something, take the loan in stables and walk away\n\nMakes no sense to me tbh","Type":"Tweet","Retweets":0,"Likes":27,"Replies":9},{"Content":"Sold my shitty ETH longs from 2450\n\nWill use the profits to leverage long BTC when price dips in a few hours after the burgers go to sleep\n\nProbably won’t try longing ETH again until BTC calms down over ATH - just makes no sense in this market to buy anything other than Bitcoin","Type":"Tweet","Retweets":0,"Likes":13,"Replies":5},{"Content":"The ETH underperformance is ASTOUNDING\n\nWhere are all of the amateur fund managers who were hyper bull tweeting two days ago about how retaking is a black hole for pumping ETH?\n\nNo one wants ETH - even its founders are selling it for Bitcoin\n\nWake upppppppp","Type":"Tweet","Retweets":0,"Likes":20,"Replies":9},{"Content":"48k would be the right place to take profits pre-ETFs\n\nWe would range for weeks, maybe dip back to 40k to cleanse leverage\n\nBut with the ETFs, none of the TA matters\n\nThe only thing that matters is if price-indiscriminate inflows continue\n\nIf so, we go straight up no brakes","Type":"Tweet","Retweets":0,"Likes":39,"Replies":8},{"Content":"I like this guy but he’s making the tradfi mistake\n\nApple is not a “stock” anymore - it is a money-like asset for escaping debasement\n\nIt has an inflexible supply as compared to the dollar with a buyback mechanism just like ETH\n\nRevenue doesn’t matter - it’s just another shitcoin","Type":"Tweet","Retweets":0,"Likes":27,"Replies":4},{"Content":"If there is some sort of weekend scam dump to 45k, I’m probably gonna borrow 10% stables against my full spot stack and 10x long it\n\nCuz who cares really\n\nIt’s all just points in a videogame https://t.co/Wn1kprt8qb","Type":"Tweet","Retweets":0,"Likes":21,"Replies":5},{"Content":"If you’re the cartel, and you see 2 days with $1 billion inflows, and now it’s the weekend, you either:\n\n1️⃣Try to scam dump for cheap coins, but it’s risky because everyone sees the coming inflows\n\n2️⃣Run up price as high as possible over weekend to sell high to inflows next week","Type":"Tweet","Retweets":0,"Likes":17,"Replies":2},{"Content":"Longed even more ETH for an ETH/BTC catch-up trade\n\nI plan to close when ETH maxis get irritating on Sunday and plow my profits into Bitcoin\n\n✌🏻🎌","Type":"Tweet","Retweets":0,"Likes":19,"Replies":6},{"Content":"ETH is garbage but I longed on leverage for an ETH/BTC bounce\n\nMy thesis is ETH maxis are so stupid that they’ll keep longing ETH even tho BTC is obviously the strongest asset with the ETF flows\n\nI plan to dump on the ETH maxis and use my profits to purchase additional Bitcoin","Type":"Tweet","Retweets":0,"Likes":20,"Replies":4},{"Content":"Up a shitload and feel terrible because I didn’t have leverage\n\nA uniquely crypto feeling\n\nShould have had 5x leverage on my net worth, what an idiot","Type":"Tweet","Retweets":0,"Likes":19,"Replies":8},{"Content":"Price looks like this heading to the halving, another ETF, whilst stock markets giga rally. \n\nMeanwhile, I have to log on here every day on CRYPTOCURRENCY TWITTER to read about how I should touch grass and de risk to buy back 7% lower, \n\nRespectfully, fuck you. https://t.co/oYs1X3vcHc","Type":"Retweet","Retweets":81,"Likes":0,"Replies":0},{"Content":"I think this is a really good tweet\n\nThe US dollar was never the reserve currency - it was just a correlation with influence/control over energy","Type":"Tweet","Retweets":0,"Likes":10,"Replies":0},{"Content":"Really enjoyed this interview\n\nFeels like seeing behind the curtain of the economy\n\nGreat tidbits about employment holding up being artificial since it’s all healthcare and govt employment expanding\n\nLots of info about the rot in real estate\nhttps://t.co/X0P3l1RNJZ","Type":"Tweet","Retweets":0,"Likes":13,"Replies":3},{"Content":"I find it kind of shocking that the Fed chair is openly criticizing government spending in this way\n\nJPow was very careful over past 2 years to avoid saying this in press conferences\n\nId wager he’s just fed up - he really wants to help his country but can’t if exec does opposite","Type":"Tweet","Retweets":0,"Likes":18,"Replies":5},{"Content":"I think people will increasingly view their countries in this way - simple fenced off economic regions with no loyalty\n\nIf you have nothing in common with the population and they explicitly don’t share and openly hate your values, why would you want to invest in their future?","Type":"Tweet","Retweets":0,"Likes":13,"Replies":1},{"Content":"I can easily see a future where ETF inflows continue around $100-200 million per day, BTC goes to $70k by halving, consolidates $70-90k all summer, then runs to $150-250k thru end of 2024\n\nPeople will look back and say it was unpredictable, but seems very possible to me https://t.co/42rjZjKuB6","Type":"Tweet","Retweets":0,"Likes":34,"Replies":4},{"Content":"Very useful chart\n\nI don’t know how many ppl I’ve heard say some generalization about “oh well the rate cut means things are about to get bad”\n\nThese will be “normalization” rate cuts - this stuff isn’t all the same\n\nWeirdly it’s the macro “experts” conflating this stuff","Type":"Tweet","Retweets":0,"Likes":11,"Replies":6},{"Content":"$750 million net inflow to BTC ETFs in 3 days\n\nInsane","Type":"Tweet","Retweets":0,"Likes":43,"Replies":5},{"Content":"You: Getting rugged by dumb Solana trash and sweating feverishly over the 1 minute chart\n\nMe: Holding spot Bitcoin and contemplating the meaning of the universe as I wait for the ETFs to gradually send prices to infinity\n\n🎌✌🏻 https://t.co/RPX9N5wG2X","Type":"Tweet","Retweets":0,"Likes":27,"Replies":6},{"Content":"2 days in a row with $250 million net inflow\n\nLike you can seriously just forget the macro\n\nForget recessions\n\nForget any supply overhang concerns\n\nAt steady rates of over $50 million per day, BTC will be at all time high sooner rather than later\n\nETFs are black holes","Type":"Tweet","Retweets":0,"Likes":50,"Replies":9},{"Content":"I think metrics like old coins moved and coin hodl days destroyed are going to shock ppl this cycle\n\nLike they’re going to reach the peaks of previous cycles, then just keep going up 5x for months\n\nAll the OGs selling coins to black hole ETFs with no concept of reasonable prices","Type":"Tweet","Retweets":0,"Likes":7,"Replies":3},{"Content":"It just feels so nice to have a stack of Bitcoin in cold storage that I’m not even capable of accessing, knowing that I have zero leverage and will never sell\n\nThe ETFs are going to vacuum all the BTC off the exchanges\n\nThere are going to be real-world riots begging for Bitcoin https://t.co/ceKljGs7gs","Type":"Tweet","Retweets":0,"Likes":15,"Replies":5},{"Content":"Yesterday was the first day that we know with certainty that significant new inflows are coming in that are NOT sourced from prior GBTC outflows","Type":"Tweet","Retweets":0,"Likes":26,"Replies":2},{"Content":"Steady supply\n\nPanic demand\n\nSovereign funds and central banks will see the steady net inflows soon\n\nAnd they will panic\n\nThey’re not going to panic about ETH or SOL\n\nThey’re going to panic about Bitcoin\n\nThis is my thesis https://t.co/hgNbaRJnIh","Type":"Tweet","Retweets":0,"Likes":24,"Replies":5},{"Content":"God damn I love Japan\n\n✌🏻🎌 https://t.co/nlzNIjoxhF","Type":"Tweet","Retweets":0,"Likes":21,"Replies":3},{"Content":"To put this another way, the ETH/BTC ratio is no longer relevant and the chart is meaningless\n\nThere are no support levels on the ETH/BTC chart\n\nIt would be like charting the price of bananas in Chile against the price of goats in rural Mongolia - it’s simply meaningless noise","Type":"Tweet","Retweets":0,"Likes":8,"Replies":1},{"Content":"This chart is so helpful for seeing why ETH is underperforming\n\nETH has the best tokenomics in the industry - but it doesn’t matter if there’s no demand\n\nThe cartel bought all the ETH under $1k, and they’ll be distributing it for years, using newcomer naivete to support BTC price","Type":"Tweet","Retweets":0,"Likes":23,"Replies":6},{"Content":"In January 2024, BTC at $42000 is nearly 3x off the bottom at $15500, and the fundamentals have never been stronger\n\nIn January 2024, ETH at $2250 is nearly 3x off the bottom at $888, and the fundamentals have never been weaker","Type":"Tweet","Retweets":0,"Likes":6,"Replies":3},{"Content":"In June 2022, when ETH was $1000, I understood exactly why I held ETH\n\nIn Jan 2023, when ETH was $1200, I understood exactly why I held ETH\n\nIn Jan 2024, with ETH at $2250, there is no good reason to hold ETH\n\nAn ETH long here is gambling, a leveraged bet on a string of unknowns","Type":"Tweet","Retweets":0,"Likes":6,"Replies":3},{"Content":"What makes an asset a major?\n\nThe answer is liquidity, not market cap\n\nETH does not have liquidity for moving in or out in size\n\nNot only does the lack of liquidity make it inaccessible for serious money, but it makes it dangerous for sudden re-rating lower\n\nETH is not a “major”","Type":"Tweet","Retweets":0,"Likes":15,"Replies":5},{"Content":"Added final 25% around 42k\n\nNow 100% allocated to BTC spot with plan to hold forever\n\nI don’t want to sell before $250k, and I think if BTC gets to $250k, it will achieve a true “alternate sovereign” status, at which point you should plan to denominate in BTC in perpetuity\n\n✌🏻","Type":"Tweet","Retweets":0,"Likes":61,"Replies":15},{"Content":"What are the best ways to get spot BTC exposure and then borrow or mint against your BTC holdings?\n\nI guess Ethereum-based options are the main choices? Any others?\n\nAny safe, reliable options other than wBTC?\n\nAny good lend/mint other than AAVE, COMP and crvUSD?","Type":"Tweet","Retweets":0,"Likes":7,"Replies":26},{"Content":"Added another 25% between 41-42k - now at 75% BTC spot allocation\n\nKeeping 25% dry powder in case this is just a short squeeze, but gut tells me bottom is in - maybe we chop but I doubt we go under 40k and 38.5k probably perma-bottom going forward\n\nZero ETH as it is garbage ✌🏻","Type":"Tweet","Retweets":0,"Likes":36,"Replies":16},{"Content":"I think the crypto landscape has fundamentally changed with the ETFs\n\nNone of the old patterns relied on by CT influenzas are going to work anymore\n\nEveryone will keep being wrong this year and they won’t understand why\n\nBeing an OG will be a liability\n\nReally new paradigm imho","Type":"Tweet","Retweets":0,"Likes":35,"Replies":10},{"Content":"Crypto’s best legal expert thinks that if the SEC blocks the ETH ETF in May, it would likely be mid-2025 or mid-2026 until an ETH ETF can be approved 🚨🚨","Type":"Tweet","Retweets":0,"Likes":3,"Replies":3},{"Content":"Almost every big CT and ETH maxi account retweeted my original thread and said it was wrong and stupid\n\nAnd I was 100% correct\n\nEveryone on CT is retarded","Type":"Tweet","Retweets":0,"Likes":19,"Replies":2}]