[{"Content":"think 2023 will be more about revanche than echoes","Type":"PinnedTweet","Retweets":46,"Likes":685,"Replies":97},{"Content":"market saw a glimpse of the future there, it may finally be ETH's turn","Type":"Tweet","Retweets":205,"Likes":2091,"Replies":179},{"Content":"imagine that in the long run this will have a salutory effect on the market; a form of catharsis allowing the space to look forward, leaving the sins of the last cycle, as much as we can, in the rear view mirror","Type":"Tweet","Retweets":219,"Likes":2204,"Replies":166},{"Content":"a banking crisis in the developed world has advanced Bitcoin's origin story further in the discursive terrain\n\n“The Times 03/Jan/2009 Chancellor on brink of second bailout for banks.”","Type":"Tweet","Retweets":136,"Likes":557,"Replies":73},{"Content":"Without harming others with your shitty model, easy way to figure out that USDC at ~0.9 is likely a +EV buy —\n\nhard to imagine a market composed of people in (1) this state of panic and (2) risk management hell during (3) weekend liquidity are overpricing USDC.","Type":"Tweet","Retweets":42,"Likes":444,"Replies":65},{"Content":"think market takes a Genesis bankruptcy in sanguine stride — \n\nGenesis Global Capital going down without pulling DCG in would quell hysteria surrounding GBTC turning into a spot BTC pinata.","Type":"Tweet","Retweets":41,"Likes":571,"Replies":57},{"Content":"am partial to this thesis, imagine a lot of the drip out that was ahead of us was instead pulled forward by these implosions","Type":"Tweet","Retweets":27,"Likes":320,"Replies":14},{"Content":"the mauling this bear market put on nearly everyone has been savage\n\ntreasure those who have kept it together","Type":"Tweet","Retweets":54,"Likes":871,"Replies":45},{"Content":"@ShadowMonarch2k @bitcoinpanda69 @nevernudejorter oh man he was so close https://t.co/XI1jsTAasX","Type":"Retweet","Retweets":21,"Likes":0,"Replies":0},{"Content":"not that great an experience actually","Type":"Tweet","Retweets":24,"Likes":577,"Replies":20},{"Content":"you come at the king, you best not miss.","Type":"Tweet","Retweets":77,"Likes":888,"Replies":29},{"Content":"re binance vs ftx https://t.co/PJIIzmMprk","Type":"Tweet","Retweets":135,"Likes":1323,"Replies":72},{"Content":"printed sub $0.03 a year later. nothing new under the sun.","Type":"Tweet","Retweets":8,"Likes":318,"Replies":16},{"Content":"took 5 weeks for this to materialize. Bear markets brook no bullshit. \n\nThe 1.2% tax has been aborted after it decimated (in the original meaning of the word) on-chain txn volume.\n\nhttps://t.co/5zF24h9iL8","Type":"Tweet","Retweets":9,"Likes":215,"Replies":27},{"Content":"Insane amount of deadwood to wipe out in the LUNC derivatives complex post-Binance burn announcement: $262.2mm across venues and instruments. \n\nRepresents 11% of the circulating market cap, all levered, all driven by a bankrupt narrative into a sell the news event. https://t.co/qDCVKZYbZX","Type":"Tweet","Retweets":16,"Likes":221,"Replies":29},{"Content":"LUNC managed to add over $1b in market capitalization on a Binance announcement that will see a few million dollars removed from its circulating supply tomorrow. \n\nAnd in the long run, that weekly burn will trend to 0 along with LUNC's volume.\n\nFilled full short again.","Type":"Tweet","Retweets":57,"Likes":872,"Replies":60},{"Content":"Tax has kicked in.\n\nLUNC, extrapolating usage over the last 30 minutes, is burning $3136 a day. It's market cap? $2b.\n\n0.","Type":"Retweet","Retweets":24,"Likes":0,"Replies":0},{"Content":"The longer ETHUSD holds up post-Merge, the more people begin to reconsider thinking that this a \"sell the news\" event.\n\nThe uncertainty in execution is now cleared. \n\nPeople's fear was more a reflection of under-allocation than of the soundness of their concerns.","Type":"Tweet","Retweets":101,"Likes":1032,"Replies":73},{"Content":"find it pretty weak that most everyone wants to just scapegoat a couple people after the fact when the entire space basically went with it while prices were going up","Type":"Tweet","Retweets":29,"Likes":559,"Replies":55},{"Content":"/1 some thoughts on the LUNC burn catalyst  —\n\nOr, how I learned to stop worrying and love the pump and dump.","Type":"Retweet","Retweets":227,"Likes":0,"Replies":0},{"Content":"Luna Ripping  BTC and ETH humming cant help but think about 3AC RIP you would have loved this","Type":"Retweet","Retweets":23,"Likes":0,"Replies":0},{"Content":"lads collected 1-2% in funding to lose 20-40% on the exposure.\n\nwith money sloshing to LUNA2, ANC, other alts, and back into BTC and ETH, this thing is now even more likely to 0 quickly.","Type":"Tweet","Retweets":8,"Likes":199,"Replies":10},{"Content":"the pain of seeing my timeline flooded with shallow takes about funding dynamics on an asset that has been marked for death by the entity running the book on it","Type":"Tweet","Retweets":21,"Likes":479,"Replies":24},{"Content":"between the asset they chose to rip and the binance mm eating its children, market's gotten pretty nihilistic","Type":"Tweet","Retweets":4,"Likes":147,"Replies":8},{"Content":"Think LUNC burn trade is about to implode — everyone knows what a game of musical chairs is and momentum just broke. \n\nBinance announcement on not burning CEX volumes thins right tail.\n\n5x from lows in these market conditions means elevator down is a high probability. https://t.co/3OlXXRqFTr","Type":"Tweet","Retweets":48,"Likes":619,"Replies":38},{"Content":"worth reading, have found Hayes' transformation from exchange priest to trader fascinating","Type":"Tweet","Retweets":21,"Likes":286,"Replies":31},{"Content":"think the lion's share of this re-pricing has now occurred. \n\nthe end of the beginning.","Type":"Tweet","Retweets":19,"Likes":327,"Replies":34},{"Content":"(live)stock2flow","Type":"Tweet","Retweets":5,"Likes":188,"Replies":39},{"Content":"scorcher of a day to be sitting outside, next to the pool\n\nmajority of market participants are down bad in 2022, hard to expect the emotional control required to not chase","Type":"Tweet","Retweets":14,"Likes":249,"Replies":23},{"Content":"shorts had days to get out on BTC. 0 reason to be short it when ETH did what it did. \n\nA large asset in the ecosystem ripping 40% stokes risk seeking behavior everywhere else. It makes people consider that assets can in fact go up in price. It leads to catch-up/rotational flows.","Type":"Tweet","Retweets":29,"Likes":300,"Replies":17},{"Content":"if the last few days of price action didn't make it obvious, the merge has filled the narrative void.\n\nMacro calming opened space for a return to asset specific drivers.","Type":"Tweet","Retweets":38,"Likes":369,"Replies":27},{"Content":"if you trade based on random thoughts people post on twitter you have bigger problems than being someone's liquidity. \n\non another note, the mouthbreathing responses about this being resistance makes me more confident we break it.","Type":"Tweet","Retweets":16,"Likes":222,"Replies":26},{"Content":"\"everyone is a macro trader now,\"\n\nbut virtually everyone has no edge in being one.\n\nmany now choose to wait to deploy because of parroted macro narratives.\n\nthis puts the cart before the horse. price drives narrative, not the other way around.","Type":"Tweet","Retweets":55,"Likes":533,"Replies":42},{"Content":"expect people will shift from a comatose state of fear to the realization that tens of billions of $ in forced spot selling (LFG, 3AC, lenders, miners) were a capitulation/risk transfer rivaled only by the Covid crash","Type":"Tweet","Retweets":128,"Likes":1155,"Replies":59},{"Content":"The $470MM in wBTC pulled from the Maker vault is now on the move to an address that subsequently interacts with FTX. Uncertain whether has been sold already OTC.\n\nApart from their stETH holdings, this transfer likely marks the final stages of supply pressure from Celsius. https://t.co/ASQHDgSGxZ","Type":"Retweet","Retweets":28,"Likes":0,"Replies":0},{"Content":"The market now lacks a viable schelling point narrative. Yet its desire for one is palpable.\n\nIt wants to make back what it lost. We will suspend disbelief in an effort to do so once a vehicle emerges to carry this latent desire.\n\nIn the wreckage are nascent roots.","Type":"Tweet","Retweets":73,"Likes":1195,"Replies":128},{"Content":"a look under the hood of how Maple, a DeFi uncollat lending protocol, is faring as CeFi credit markets seize up","Type":"Tweet","Retweets":14,"Likes":152,"Replies":40},{"Content":"FT: \"Just last week, Bankman-Fried helped crypto broker Voyager Digital pull back from the brink with a loan that totalled about $485mn in cash and bitcoin.\"","Type":"Tweet","Retweets":14,"Likes":217,"Replies":30},{"Content":"*BINANCE CEO ZHAO SPEAKS AT CRYPTO EVENT IN ZURCH\n\n*BINANCE CEO SAYS 'WORST PART IS PROBABLY OVER' FOR CRYPTO ROUT","Type":"Tweet","Retweets":34,"Likes":416,"Replies":45},{"Content":"More likely forced selling - someone capping with icebergs on Bitfinex, causing price to trade at a discount in last few hours.\n\nh/t @lowstrife https://t.co/Xn0V5jn2Af","Type":"Tweet","Retweets":15,"Likes":284,"Replies":29},{"Content":"Celsius looks to have stopped selling 2 days ago. Now the liquidation point of their Maker vault, which probably iced buyers, is being defended, at $16.8k and moving down.\n\nIf they went short to trade their way out of a hole, they are now a future buyer in an illiquid market.","Type":"Tweet","Retweets":52,"Likes":486,"Replies":39},{"Content":"and so one of the greatest exit pumps of this year ($550mm in USDC/USDT borrowed and realized as profit through Vires using a parabolic WAVES that later imploded as collateral) is unwound: \n\nhttps://t.co/SX4Wnu6bCM\n\nand just like CLAMS on Poloniex, naive lenders got hosed.","Type":"Tweet","Retweets":12,"Likes":231,"Replies":44},{"Content":"down 90%+, $6b+ in paper wealth wiped out","Type":"Tweet","Retweets":16,"Likes":316,"Replies":29},{"Content":"down to 0, $60b+ in paper wealth wiped out","Type":"Tweet","Retweets":9,"Likes":465,"Replies":24},{"Content":"down 80% in a month, $17b in paper wealth wiped out","Type":"Tweet","Retweets":25,"Likes":465,"Replies":31},{"Content":"In hindsight, took a lot of mental contortion to find reasons to justify being long  on the way down to here.\n\nNow, here, it finally makes intuitive sense with no need for mental justifications. I am comfortable that we've seen full capitulation in the short/mid term.","Type":"Tweet","Retweets":58,"Likes":996,"Replies":56},{"Content":"Might be tempting to capitulate to the siren song of bearish influencers after the rout of last week.\n\nBut, find courage in the fact that every person I know who has made 9 figures or more from this space is adding to longs in this move down.","Type":"Tweet","Retweets":116,"Likes":1483,"Replies":98},{"Content":"If you've gotten this far, you need to be expressing some long position. It either bottoms here or at $30k, but in 3 months it won't matter.\n\n\"If you don't believe me or don't get it, I don't have time to try to convince you, sorry.\"","Type":"Tweet","Retweets":223,"Likes":2734,"Replies":179},{"Content":"Bitfinex whales are buying your capitulation again anon, like they did in July last year\n\ntwap in addition to limit bid walls https://t.co/OhdXnQk0h0","Type":"Tweet","Retweets":210,"Likes":1576,"Replies":93},{"Content":"Lot's of absorption here sub-34k soaking liquidity from panic into the low","Type":"Tweet","Retweets":32,"Likes":675,"Replies":36}]