[{"Content":"I don’t have a public Telegram.\n\nYou only have it if I’ve directly given it to you or we’re working together in some capacity.\n\nIt is NOT my Twitter username.","Type":"PinnedTweet","Retweets":23,"Likes":175,"Replies":38},{"Content":"To the winners, losers or breakeven traders. To those at the top of their game or those just starting out, If you turn up every day to engage with these markets and put your balls on the line, I salute you.","Type":"Retweet","Retweets":146,"Likes":0,"Replies":0},{"Content":"Dominion awaits, come be a hero🔥 Like the man said: heroes get remembered, but legends never die. Step up to the plate in Hero Wars and start swinging👇","Type":"Tweet","Retweets":11,"Likes":67,"Replies":29},{"Content":"Going to use myself as an example of how things (tend to) work in a bull market.\n\nTeeka recently got exposed as taking money to shill projects via PBC.\n\nBut just remember that in a bull market these grifters unfortunately, make a lot of money.\n\nSo when you see KSI coming back..…","Type":"Tweet","Retweets":20,"Likes":401,"Replies":40},{"Content":"No one is ever ready for @OhBabyGames. New patch almost every day and we are still in the Beta phase.\n\nHere is a raw footage of the gameplay:\n\nMap: Space\nMode: Duo Grand Prix\nCharacter: @LomahCrypto \n\nNow what we are waiting for is new skins for Loma!💙\nFounder @passytee will… https://t.co/F8S6fC8LyW","Type":"Retweet","Retweets":4,"Likes":0,"Replies":0},{"Content":"First area of interest for me. Will look to add more in the $2,500s if things pullback here.\n\nSlow and steady, then all at once. https://t.co/cTWzueMUaE","Type":"Tweet","Retweets":15,"Likes":229,"Replies":14},{"Content":"traces the history of the India-Maldives relationship and examines the implications of the recent diplomatic spat in the face of China's increasing presence in the island nation. Read more on SAV.","Type":"Reply","Retweets":129,"Likes":1762,"Replies":20},{"Content":"Keeping all spot positions unless we start trading below $41K.\n\nCut about 30% of leverage exposure at roughly $49,800.\n\nHoping for markets to chop to grab more spot + perp exposure.\n\nStill think we're going to make a muted ATH, where the best risk-adjusted asset is probably still… https://t.co/KmGJLEoqMz","Type":"Tweet","Retweets":27,"Likes":515,"Replies":20},{"Content":"All spot ETF buyers are (significantly) above water.\n\nRemember how it felt when you first got into crypto and made outsized abnormal returns at an alarming rate.\n\nDo with that, what you will.","Type":"Tweet","Retweets":131,"Likes":1580,"Replies":79},{"Content":"Almost, if not all, of my large losses have come because I was stubborn.\n\nWhich is to say that most of you aren’t necessarily bad traders because of poor analyses or ideas..\n\nBut rather, you just let your losses run so large, that you never make it to see your future winners.","Type":"Tweet","Retweets":70,"Likes":815,"Replies":46},{"Content":"January:\n\nBitcoin essentially same price as yearly open. Mostly just day traded Bitcoin in January.. didn't hold much risk overnight.\n\nExpecting same approach for Feb. and March.\n\nCurrent market focus seems to be more on meme coins (lol) and somewhat random lower liquidity CEX… https://t.co/tUc9xv8Bfx","Type":"Tweet","Retweets":51,"Likes":1062,"Replies":149},{"Content":"🚨GIVEAWAY🚨\n\nWe're giving away 2 signed UFC gloves by superstars Jon Jones and Ilia Topuria! \n\nTo enter you must follow @overdogsbet, tag two MMA fans, RT and sign up for beta/free play to be entered. \n\nWe'll pick one winner for both gloves in 7 days.\n\nGood luck 🫡 https://t.co/oFyJ8ZIoGb","Type":"Retweet","Retweets":51,"Likes":0,"Replies":0},{"Content":"gm! \nCommission work for @LomahCrypto \nThank you so much 🖤 https://t.co/8gykxa8Z3h","Type":"Retweet","Retweets":13,"Likes":0,"Replies":0},{"Content":"• 17 year old, claims to make a million off an airdrop\n\n- on-chain says otherwise, but the lie(s) generate income for him via content + engagement\n\n• BitBoy stops streaming and has “lost everything”\n\n- in the midst of a divorce, where his wife would (rightfully) take a good…","Type":"Tweet","Retweets":97,"Likes":1532,"Replies":98},{"Content":"@Tradermayne Imagine if they took your money at the literal stone bottom and gave it back to you at the literal top. https://t.co/JaTyqMSKet","Type":"Retweet","Retweets":10,"Likes":0,"Replies":0},{"Content":"Out of all the people I’ve helped, there’s only been a (very) small handful that have actually managed to stay out of trouble.\n\nAlmost as if most people are a victim of countless irresponsible decisions rather than one unlucky twist of fate.\n\nAt this point, I think I just do it…","Type":"Tweet","Retweets":22,"Likes":526,"Replies":58},{"Content":"I know traders that know everything related to markets.\n\nHistorical rates, patterns, cycles, every terminology. Read thru every bestselling book. Subscribed to every finance-platform under the sun.\n\nBut end up make very little (if any) money.\n\nThen I know a few traders that don't…","Type":"Tweet","Retweets":168,"Likes":1433,"Replies":104},{"Content":"Generally speaking, until higher timeframe structures break down, I'm treating this as a pullback within an uptrend.\n\nLooking for somewhere in the 70's or price accepting back above $90-92 to get involved.\n\nPullbacks are a double-edged sword. An opportunity for the prepared, a… https://t.co/ejzCJgGW58","Type":"Tweet","Retweets":42,"Likes":501,"Replies":34},{"Content":"Got some bids filled in the $38,000s, a good amount left below unfilled (yet?).\n\nStill think we’re rangebound in the $39-45K for a bit but I’m hoping that we just set the temporary low of said range.\n\nRegardless, its been a good break to reset before action picks back up.","Type":"Tweet","Retweets":14,"Likes":296,"Replies":16},{"Content":"Bitcoin volatility anchored around TradFi hours as of late.\n\n- Consolidations/intraday spikes on weekends.\n\n- GBTC + speculation on GBTC selling on weekdays.\n\n- Volatility mostly around legacy opens and closes.\n\nWonder how many more weeks we have of this pattern before the fun…","Type":"Tweet","Retweets":21,"Likes":323,"Replies":47},{"Content":"Caught what feels like the David Goggins of Colds.\n\nBeen getting my ass beat all week, and this PA isn’t making it any better. https://t.co/7eiWmoxE9j","Type":"Tweet","Retweets":15,"Likes":332,"Replies":50},{"Content":"We went from \"Bitcoin ETFs will allow TradFi to get exposure and buy our bags\" to \"Why aren't they all buying on day 1?\"\n\nThe space treating this like a Binance listing of their favourite shitcoin because they don't know any other way.","Type":"Retweet","Retweets":103,"Likes":0,"Replies":0},{"Content":"What makes trading so fuckin hard is it doesn’t matter how good you are at anything. It’s how good are you in the moment\n\nYou could’ve got shit canned yday, or up a ton. Market doesn’t care. And neither should you\n\nWe’re in a battle of moments. Right here. Right now","Type":"Retweet","Retweets":47,"Likes":0,"Replies":0},{"Content":"• Add to spot/longer-term positions from $36-38,000\n\n• Use Bitcoin as a guide for entering spot positions on other coins\n\n• Message Cobie and Loomdart for prophetic financial advice(s)\n\n• Trade intraday + intraweek with the assumption that we chop suey for a few months\n\n•… https://t.co/3VbHlyNFAN","Type":"Tweet","Retweets":100,"Likes":1027,"Replies":79},{"Content":"It seems my sophisticated strategy consisting of buying every dip and generally staying net long across a multitude of assets did not perform well today.","Type":"Tweet","Retweets":24,"Likes":485,"Replies":47},{"Content":"Pov, if CT was honest https://t.co/WXHsTEUCSh","Type":"Retweet","Retweets":114,"Likes":0,"Replies":0},{"Content":"5% down for us, just another day. Barely a pullback.\n\nFor institutional TradFi boomers, this is apocalyptic.\n\nWe’re not in here with you. You’re stuck here with us. https://t.co/KWtiq7mUj0","Type":"Tweet","Retweets":148,"Likes":1328,"Replies":60},{"Content":"I thought this was obvious but.. timeline says otherwise:\n\n$5B in ETF flows ≠ $5B into Bitcoin","Type":"Tweet","Retweets":16,"Likes":404,"Replies":58},{"Content":"Stop letting perp traders influence what you do with your long term spot holdings!","Type":"Retweet","Retweets":59,"Likes":0,"Replies":0},{"Content":"What if both bulls and bears are wrong and we just sit sideways in a range for most of Q1 as ETF buyers and Sell-The-News doomers fight it out https://t.co/UQd8YUsrQ0","Type":"Tweet","Retweets":31,"Likes":650,"Replies":83},{"Content":"Market pretty inefficient at pricing things in the short-term.\n\nThat’s to your benefit as a market participant.\n\nSomehow, billions of capital inflow with a halving coming up means the top is in after less than a day of the ETF being live.","Type":"Tweet","Retweets":143,"Likes":912,"Replies":40},{"Content":"Less than 6 months ago, we were gambling on hamster races.\n\nToday, we’re approved for a spot ETF with billions of expected cash flow.\n\nYeah, we should be happy. Why even log on this app everyday if this doesn’t put at least a little cheeky grin on your face.","Type":"Tweet","Retweets":95,"Likes":1085,"Replies":63},{"Content":"BlackRock doesn't lose. Looking like August for $ETH ETF. https://t.co/G2sbA0Mysl","Type":"Retweet","Retweets":427,"Likes":0,"Replies":0},{"Content":"Is the BTC spot ETF already priced in?\n\nDon't ask such a dumb fucking question again. https://t.co/l3PZ9wJ2Md","Type":"Retweet","Retweets":147,"Likes":0,"Replies":0},{"Content":"Anyone worried that this was a potential fakeout again. NOPE. \n\nThe 19b-4 approval order has officially hit the SEC front facing part of the website: https://t.co/5WVBHzVdHf","Type":"Retweet","Retweets":438,"Likes":0,"Replies":0},{"Content":"3 years later.\n\nSame shit innit 😂","Type":"Tweet","Retweets":20,"Likes":420,"Replies":36},{"Content":"@blknoiz06 \"hey, yah my name is gary gensler\"\n\ntmobile: \n\"ok here you go\"","Type":"Retweet","Retweets":72,"Likes":0,"Replies":0},{"Content":"THE HAT STAYS ON!!! https://t.co/aE0Np0tT1Q","Type":"Tweet","Retweets":147,"Likes":1919,"Replies":87},{"Content":"Hmm https://t.co/1I9PtNK13k","Type":"Retweet","Retweets":24,"Likes":0,"Replies":0},{"Content":"Sources: trust me, bro","Type":"Tweet","Retweets":32,"Likes":393,"Replies":24},{"Content":"Red Dot ; 赤い点\n\nCommission to @LomahCrypto \nthank you so much for the support!! 🤍✨ https://t.co/yZwn7VIbFW","Type":"Retweet","Retweets":8,"Likes":0,"Replies":0},{"Content":"SEI casually putting in a 20% daily, as the entire market pulls back.\n\nMaybe time for me to learn what this thing does","Type":"Tweet","Retweets":53,"Likes":1038,"Replies":97},{"Content":"I know you guys want a reversal to new yearly highs but usually when we see a liquidation move of that nature, the market tends to be a ghost town for a little bit.\n\nWait for risk appetite to rebuild and losers to lick their wounds.","Type":"Tweet","Retweets":78,"Likes":902,"Replies":39},{"Content":"“long SCALP on AVAX to $50-55.\n\nPrice was $40.\n\nPrice drops to $30.\n\nNO CHANGES! Adding more”\n\nThis whole sequence is comical.\n\n• Calls for a scalp but is in the position for days\n\n• No invalidations, just vibes. Price nukes 20%, nothing changed.\n\n• Capo is a great example of…","Type":"Tweet","Retweets":24,"Likes":689,"Replies":72},{"Content":"First New Year’s, since I was a kid, where my resolutions have nothing to do with money.\n\nHappy New Year’s everyone.\n\nMay you have the strength to work towards everything you’ve asked for.","Type":"Tweet","Retweets":25,"Likes":508,"Replies":25},{"Content":"I sometimes forget that there’s a lot of people that don’t fluently speak English which makes it a terrible idea for me to be sarcastic in tweets.","Type":"Tweet","Retweets":11,"Likes":256,"Replies":29},{"Content":"No longer safe 🥲 https://t.co/yQeQgTbvRq","Type":"Tweet","Retweets":18,"Likes":890,"Replies":58},{"Content":"Whoever’s pumping $TRB, I wanna shake your hand.\n\nYou absolute god.","Type":"Tweet","Retweets":23,"Likes":437,"Replies":63},{"Content":"🚩Marked safe from any profits on $TRB","Type":"Tweet","Retweets":32,"Likes":468,"Replies":31},{"Content":"BlackRock just dropped its updated S-1 and it DOES name the APs: Jane Street and JPMorgan (which is kinda ironic). Looks we have our first horse that at the starting gate. https://t.co/H3UmaesygJ","Type":"Retweet","Retweets":724,"Likes":0,"Replies":0}]