[{"Content":"All my 2024 writing in one place.\n\nWriting is the single best tool to beat your bias","Type":"PinnedTweet","Retweets":12,"Likes":224,"Replies":21},{"Content":"The respect you earn within crypto is incredibly fragile.\n\nDo you ever think about how you earn it or more importantly, where you spend it?\n\nWithin crypto, one's respect increases from a good signal but is spent with a bad one. A few bad calls and you are very quickly back to…","Type":"Tweet","Retweets":2,"Likes":38,"Replies":10},{"Content":"be particularly careful of PNL larps over the next few months\n\nThe truth is that most people who are genuinely successful do not want to share their PNLs because it’s not good for security \n\nso 90% of the time people share big PNLs it’s fake larp for engagement farming","Type":"Retweet","Retweets":9,"Likes":0,"Replies":0},{"Content":"This aged amazingly well for $PENDLE, amazing to see BTC and ETH flying too. \n\nTook my first time off in 2 years+ full time, feeling refreshed and ready to go.\n\nStill been grinding in the backgrounds, time to get back into trading right before a mega altszn 🫡","Type":"Tweet","Retweets":3,"Likes":88,"Replies":24},{"Content":"Pendle 500 million TVL 👀 https://t.co/ftJs0ihKEA","Type":"Retweet","Retweets":12,"Likes":0,"Replies":0},{"Content":"Send it back to 48k","Type":"Retweet","Retweets":18,"Likes":0,"Replies":0},{"Content":"Impressive figures, especially for a weekend:\n\nWe've just achieved a new all-time high:\n\n- Daily Trading Volume ✅: 9.4M \n- Daily active Users ✅ : 4.7K \n- Daily active Trades ✅ : 80k \n\nThese metrics are too robust to overlook and @UnibotOnSolana is too good to pass up. 🦄 \n$SOL… https://t.co/5DT19ySS6Y","Type":"Retweet","Retweets":42,"Likes":0,"Replies":0},{"Content":"The only platform to:\n\n🔷️ Trade restaking yields\n\n🔷️ Earn points on both @eigenlayer and double points on @ether_fi \n\n🔷️ Receive $PENDLE rewards in the process.\n\nThis year will be huge for @pendle_fi","Type":"Retweet","Retweets":14,"Likes":0,"Replies":0},{"Content":"The blockchain is a public ledger, which means it almost never makes sense to attach your identity to your main wallet(s).\n\nIf you plan on doing so, you need to understand that every subsequent wallet you attach to them is now public forever, past and future actions.\n\nAny public…","Type":"Tweet","Retweets":5,"Likes":36,"Replies":18},{"Content":"The beautiful thing about people building in public in crypto is you can show your faith in them by putting your money behind them.\n\nThey then reward your faith in them by giving you a huge win later down the line.\n\n@Teeznutz11 re-pegging is an excellent example. https://t.co/WKm0zJ3u7R","Type":"Tweet","Retweets":15,"Likes":78,"Replies":20},{"Content":"You may not like it, but this is what peak performance looks like https://t.co/gfAEOvzifz","Type":"Retweet","Retweets":9,"Likes":0,"Replies":0},{"Content":"I can't tell you how weird it feels to log back into crypto after being away for +1 week and half my feed is how much $wif everyone fumbled.\n\nIf you feel FOMO from the posts, just imagine how many people fumbled and bull post like they didn't, it's tragically common","Type":"Tweet","Retweets":2,"Likes":25,"Replies":10},{"Content":"I wasn't spot on, but I was pretty close, and my conviction is getting rewarded.\n\nI will sell my $MUBI and $BSSB on binance","Type":"Tweet","Retweets":3,"Likes":30,"Replies":8},{"Content":"It's hard to post every day on this app when the tokens you have been holding for months are making you filthy rich\n\nFeels amazing not having to trade, anyone else?","Type":"Tweet","Retweets":0,"Likes":38,"Replies":20},{"Content":"We've onboarded 10k users within just 10 days of our launch on $SOL. \nWe also hit a new all-time high in daily active users yesterday. \n\nAnd we haven't even started delivering our key features yet. Exciting times ahead. https://t.co/dmdxvLdVN2","Type":"Retweet","Retweets":47,"Likes":0,"Replies":0},{"Content":"I'm gonna put that I held $unibot throughout it's accumulation on my resume.\n\n2.7k users today","Type":"Tweet","Retweets":3,"Likes":93,"Replies":19},{"Content":"I looked in my wallet, and now I'm ashamed https://t.co/eOj2CuoEmN","Type":"Tweet","Retweets":0,"Likes":10,"Replies":7},{"Content":"It stopped working, but I kept getting sicker","Type":"Tweet","Retweets":2,"Likes":44,"Replies":9},{"Content":"Is the market dump in the room with us right now? https://t.co/3CZtPTEFtK","Type":"Tweet","Retweets":5,"Likes":92,"Replies":16},{"Content":"First L2 to launch a decentralized sequencer sat below $500m market cap.\n\nWe all know how much Vitalik preaches true decentralization, $METIS working dilligently to fill his vision.\n\nWith the help of his mum too, of course.\n\nCalm before the storm. https://t.co/xrOXBm4g4W","Type":"Retweet","Retweets":62,"Likes":0,"Replies":0},{"Content":"I remain sick so my bags can remain up only.\n\n$PENDLE has been one of my best performers over the bear market and will continue to be over the bull.\n\nWe're still a long way from $10 https://t.co/Ai4i54NomE","Type":"Retweet","Retweets":8,"Likes":0,"Replies":0},{"Content":"i think we all know direction is up &amp; to the right if you zoom out\n\nfor those of us actively commenting i think it should be assumed we’re looking at 5m-4h charts \n\nbecause it’s fun and we like to gamble \n\n🎲🃏","Type":"Retweet","Retweets":12,"Likes":0,"Replies":0},{"Content":"I remain sick so my bags can remain up only.\n\n$PENDLE has been one of my best performers over the bear market and will continue to be over the bull.\n\nWe're still a long way from $10 https://t.co/Ai4i54NomE","Type":"Tweet","Retweets":8,"Likes":112,"Replies":21},{"Content":"$unibot holders realizing that they’re out of the range https://t.co/YQCWZjihmL","Type":"Retweet","Retweets":9,"Likes":0,"Replies":0},{"Content":"[ Exploring @MetisDAO difference ]\nMetis DAO 's hybrid rollup design &amp; decentralised squencer\n+\nCatalyst &amp; why i think Liquid staking on decentralised squencer will big https://t.co/uIj7hOirDn","Type":"Retweet","Retweets":46,"Likes":0,"Replies":0},{"Content":"Missed my longer post today, so I will be doubling up at the end of the week.\n\nI underestimated how hard it is to write meaningful content every day without randomly shilling some trash protocol.\n\nThank you for the love on the recent posts \n\n365/365 🤝","Type":"Tweet","Retweets":3,"Likes":45,"Replies":9},{"Content":"I'm seeing so many bet on a black swan event, some serious bear market PTSD.\n\nPeople forget that although the world can be irrationally bad, it can also be irrationally good.","Type":"Tweet","Retweets":5,"Likes":68,"Replies":13},{"Content":"If you're considering an investment involving crypto assets, be cautious. \n\nCrypto asset securities may be marketed as new opportunities but there are serious risks involved. \n\nRead @SEC_Investor_Ed's Director Take:","Type":"Retweet","Retweets":1803,"Likes":0,"Replies":0},{"Content":"Spending my downtime learning the best ecosystems to stake within for airdrops.\n\nOther than $INJ I'm way behind.\n\nWhat do you suggest?","Type":"Tweet","Retweets":2,"Likes":41,"Replies":33},{"Content":"Slowly making my way through this report by @ReveloIntel and am very impressed so far.\n\nHighly recommend the Layer 1 playground section if you want to broaden your knowledge\n\nI challenge any threadooor to summarize it into a singular long post, might just do it myself.","Type":"Tweet","Retweets":2,"Likes":9,"Replies":8},{"Content":"The most anticipated upcoming launch on @MetisDAO has to be @TheHerculesDEX.\n\nI wrote about @CamelotDEX before they launched and now, over 1 year later, Hercules is looking to emulate their success with their friendly fork.\n\nThis time around, there's even more incentives ↓ https://t.co/0BJv80Rnit","Type":"Retweet","Retweets":42,"Likes":0,"Replies":0},{"Content":"I'm more of a private sale layup maxi than a trader","Type":"Tweet","Retweets":1,"Likes":25,"Replies":16},{"Content":"Lucky to live in a world where taking risks to change your life can be done from the comfort of your home.\n\nI create my own luck yes, but no period in time before us was wealth, let alone easy wealth, even a pipe dream.\n\nThe laymen of leaders risked everything, for nothing. https://t.co/MnVlpjJukr","Type":"Tweet","Retweets":6,"Likes":30,"Replies":4},{"Content":"Both $MUBI and $BSSB have seen a bounce from this tweet. \n\nIf $BTC rallies from the ETF news it's more likely than not that BRC20 tokens will as well.\n\nHowever, we still need them to both break their downtrend.\n\nThe successful $TOKA launch definitely helped. https://t.co/L1yL8SLuub","Type":"Tweet","Retweets":3,"Likes":25,"Replies":7},{"Content":"You are so fucking lucky to be in crypto.\n\nBut being lucky doesn't take away from your work ethic, they're not mutually exclusive.\n\nIf you don't think you're lucky, go type in ''average savings in [insert any country you want]'', then come back to this tweet.\n\nBeing aware of how…","Type":"Tweet","Retweets":11,"Likes":79,"Replies":20},{"Content":"The recent $ARB rally has boosted volumes &amp; general activity, but we're still waiting to see this value trickle down to the rest of the ecosystem.\n\nFew imagine the numbers that Arb can pull off in a real bull run. There's almost 0 hype for it rn.\n\n&amp; this is $GRAIL today... 🤔 https://t.co/3cEGdfzayv","Type":"Retweet","Retweets":18,"Likes":0,"Replies":0},{"Content":"Gary about to get the juiciest KOL packages the world has ever seen \n\nThreadoooor arc","Type":"Tweet","Retweets":7,"Likes":41,"Replies":4},{"Content":"Never re-entering a project I sold too early is some of the best advice I've received.\n\nRun with the profits and don't look bag, the edge of being early is already gone.","Type":"Retweet","Retweets":14,"Likes":0,"Replies":0},{"Content":"Buying the BRC-20 trio.\n\n$MUBI $BSSB $TOKA\n\nIf ETF is approved this flies. Good luck.","Type":"Retweet","Retweets":6,"Likes":0,"Replies":0},{"Content":"Founders who still believe this phrase are delusional and shouldn't be trusted.\n\nIn almost everything in life, great things don't happen purely because X is good, or Y is talented.\n\nThe planned or organic marketing is what takes a project next level, regardless of utility.","Type":"Tweet","Retweets":3,"Likes":52,"Replies":17},{"Content":"Starting in 2002 when I left school to play poker for a living I have been around people who are always looking for quick and easy ways to get rich. \n\nThe premise that most ppl can trade small amounts of capital and get wealthy is flat out wrong and to be quite frank, a path to a…","Type":"Retweet","Retweets":18,"Likes":0,"Replies":0},{"Content":"Many ppl say $GRAIL @CamelotDEX is undervalued as the biggest DEX on Arbitrum and top-20 globally in collected fees. \n\nBut something no one talks about as a huge driver for $GRAIL is their launch on L3 @XAI_GAMES \n\nXAI was just announced on Binance Launchpad. The current…","Type":"Retweet","Retweets":15,"Likes":0,"Replies":0},{"Content":"My brain just before I open up charts to check the price of the coin I keep on DCAing \n\nAnyone else know this feeling? https://t.co/LmWZI9pc2x","Type":"Tweet","Retweets":5,"Likes":86,"Replies":24},{"Content":"Never re-entering a project I sold too early is some of the best advice I've received.\n\nRun with the profits and don't look bag, the edge of being early is already gone.","Type":"Tweet","Retweets":14,"Likes":169,"Replies":31},{"Content":"Do or die moment now for both $MUBI and $BSSB which is often the best place to bid if you believe in the projects.\n\nAnother great example of how hype cycles / twitter excitement contribute to price.\n\nLucky me I'm a massive bagholder 🫥","Type":"Tweet","Retweets":6,"Likes":63,"Replies":20},{"Content":"After hearing about the Friend Tech situation, it made me realize how fucked working in the crypto space can be.\n\nBelow is advice I put together from my 3 years working in crypto.\n\nRead this if you do any type of business in the crypto space.\n\nMixing business with personal is an…","Type":"Tweet","Retweets":17,"Likes":97,"Replies":22},{"Content":"Why does this always happen:\n\nGood trade occurs, FDV now bloated \n\nPeople start commenting that it was a good trade, but wait until X, that's the real hold \n\nX comes, delayed, underwhelming, never living up to its expectations \n\nWe're just trading attention","Type":"Tweet","Retweets":2,"Likes":28,"Replies":7},{"Content":"Gm https://t.co/ibdk0eseCo","Type":"Tweet","Retweets":2,"Likes":56,"Replies":25},{"Content":"Yet another reason why $PENDLE is an elite hold till the end of this bull.\n\nThe only unlocks remaining are linear incentives. https://t.co/3gcRzrWJ6h","Type":"Tweet","Retweets":9,"Likes":66,"Replies":3},{"Content":"Babe wake up another athlete fumbled his entire career earnings and is letting us know on the timeline","Type":"Tweet","Retweets":3,"Likes":26,"Replies":4}]