[{"Content":"I think all 3 of these products get repriced considerably higher (2 don’t even have tokens yet)\n\nWe’re still in an NFT bear market with a few outliers, the market will turn around, volumes will make new all time highs it’s just a matter of time https://t.co/6R8MAQJM68","Type":"Tweet","Retweets":21,"Likes":146,"Replies":19},{"Content":"its simple\n\nyou never tell a living soul about CT or that you own crypto or nfts, its easier that way.","Type":"Tweet","Retweets":51,"Likes":673,"Replies":36},{"Content":"I automatically assume all crypto AI coins technology wise are complete dogshit because if they werent they would just make a traditional company + IPO for tens of billions of dollars, so it’s really going to boil down to who has good memes and narratives as in crypto tradition","Type":"Tweet","Retweets":33,"Likes":668,"Replies":67},{"Content":"My toxic trait is continually planting Kale in my garden even though I hate Kale because it’s aesthetic","Type":"Tweet","Retweets":1,"Likes":66,"Replies":21},{"Content":"Tensor probably still one of the best r/r for points / airdrop rewards\n\npeople are simply too lazy to setup LP ranges or bid on a regular basis, even with a couple dozen SOL you can be pretty highly ranked on a weekly basis","Type":"Tweet","Retweets":7,"Likes":151,"Replies":19},{"Content":"\"if you missed cryptopunks how can you expect to make money off NFTs\"\n\nwhat kind of dumbass logic is this lmao","Type":"Tweet","Retweets":8,"Likes":105,"Replies":18},{"Content":"*buys a coin up 5000% in a 3 month span*\n*makes 20%*\n\n*goes around on every persons post saying*\n\n\"cope\" \"ngmi\" \"we got an already pumpoored over here\"","Type":"Tweet","Retweets":4,"Likes":104,"Replies":16},{"Content":"$ETH completely melting upwards and its radio silence on the timeline\n\ndid you guys get impatient and sell right before this happened.... or?","Type":"Tweet","Retweets":7,"Likes":250,"Replies":32},{"Content":"Yeah I got plans https://t.co/6EtYDOyFHg","Type":"Tweet","Retweets":0,"Likes":92,"Replies":13},{"Content":"The bull market is basically making a bunch of money then logging on twitter and feeling terrible because some is up more than you","Type":"Tweet","Retweets":63,"Likes":968,"Replies":40},{"Content":"I love crypto so much","Type":"Tweet","Retweets":1,"Likes":92,"Replies":13},{"Content":"I like the coin","Type":"Tweet","Retweets":98,"Likes":361,"Replies":123},{"Content":"Who’s the main characters for this cycle?\n\nNeed to figure out which projects to buy before they go 100x so I can sell before they go to zero and ruin everyone’s lives","Type":"Tweet","Retweets":16,"Likes":497,"Replies":148},{"Content":"what do we think of RWA?\n\n$ONDO https://t.co/xJO4mhQ5SV","Type":"Tweet","Retweets":13,"Likes":176,"Replies":54},{"Content":"I think Blast season is what people have been trying to say Base season was going to be\n\nyou have billion+ dollars ready to be unlocked and thousands of teams entering their hackathon","Type":"Tweet","Retweets":6,"Likes":199,"Replies":19},{"Content":"every DEFI power user and NFT whale I know got 0 starknet tokens\n\nso where are all the tokens going then? https://t.co/pBKd0WMhOf","Type":"Tweet","Retweets":9,"Likes":268,"Replies":42},{"Content":"the paraswap of L2s just dropped. study the chart.","Type":"Tweet","Retweets":11,"Likes":89,"Replies":6},{"Content":"so who even qualified for the starknet airdrop lmao\n\nI have accounts with more defi and nft transactions than 99% of the planet and got nothing lol\n\nnot sure its such a great idea to launch an L2 and give nobody any tokens 🙈","Type":"Tweet","Retweets":18,"Likes":390,"Replies":48},{"Content":"“We have to top at $50k here, we just have to!” - guy who’s who’s so on the sideline he’s in physical pain","Type":"Tweet","Retweets":12,"Likes":201,"Replies":11},{"Content":"its fun to joke around about ETH because its been a little slower moving than other coins but the reality is its an absolute monster setting up for a yuge move higher\n\ncountless L2s building, (re)staking, RWA, widespread stablecoin adoption, NFTs + more\n\nEthereum is a behemoth","Type":"Tweet","Retweets":48,"Likes":589,"Replies":52},{"Content":"Imagine having to explain to your family you blew your chance to make it because you got bearish that 50 cartoon characters and farm animals who spend 72 hours a day on crypto got excited that the market went up","Type":"Tweet","Retweets":23,"Likes":217,"Replies":23},{"Content":"who on the sidelines right now? https://t.co/PIXYd2r6bd","Type":"Retweet","Retweets":43,"Likes":0,"Replies":0},{"Content":"Missed the airdrop?\n\nDont worry you’ll probably miss the next one too","Type":"Tweet","Retweets":14,"Likes":328,"Replies":14},{"Content":"I’m not selling anything until Saylor is the richest person in the world","Type":"Tweet","Retweets":23,"Likes":422,"Replies":22},{"Content":"◵ ◵ https://t.co/F1YkcVEcdg","Type":"Tweet","Retweets":9,"Likes":149,"Replies":17},{"Content":"Target acquired https://t.co/8edcSePKWD","Type":"Tweet","Retweets":1,"Likes":57,"Replies":12},{"Content":"ive gotten more airdrops for owning BTC NFTs in 1 month of owning them than I have in years of owning ETH NFTs, if this is a sign of things to come its going to get ridiculous","Type":"Tweet","Retweets":15,"Likes":304,"Replies":36},{"Content":"heads up if you own any $BTC Ordinals there was another airdrop that went out to holders (im not sure exactly who qualified)\n\nthese are worth about 0.013 BTC each right now, $600.\n\ncheck your wallets for a lil guy","Type":"Tweet","Retweets":4,"Likes":59,"Replies":15},{"Content":"“Saylor has to be liquidated before we can go up” https://t.co/R8DFhLASVO","Type":"Tweet","Retweets":42,"Likes":1015,"Replies":43},{"Content":"sometimes I wake up at night and worry the guy who wicked WIF to $5 and lost 90% of their money instantly is going to outtrade me the next year on that move","Type":"Tweet","Retweets":13,"Likes":405,"Replies":24},{"Content":"the bull market started in Oct-Nov\n\nso its been basically 4 months so far, they usually last around 2 years","Type":"Tweet","Retweets":39,"Likes":568,"Replies":38},{"Content":"I think people forget how ridiculous it can get\n\nan \"average\" memecoin was hitting billions and billions in marketcap last cycle\n\nmost the last year or so could barely crack $1 billion\n\nits going to get so silly, more silly than you can even imagine","Type":"Tweet","Retweets":82,"Likes":797,"Replies":66},{"Content":"“It was easier to BUILD in the bear market”\n\nMfs on here wasnt building nothing but a sassy attitude, disappointment from their familys, and farts","Type":"Tweet","Retweets":8,"Likes":172,"Replies":19},{"Content":"The price is telling us, they are in fact, floor apes.","Type":"Tweet","Retweets":19,"Likes":275,"Replies":31},{"Content":"unpopular (ish?) opinion\n\nBLAST is going to go apeshit and be an instant top 3 L2 if not the #1 $ETH L2","Type":"Tweet","Retweets":17,"Likes":283,"Replies":48},{"Content":"one thing to think about when buying a memecoin is can it get listed on a CEX\n\nif it has any corporate branding, ripoff names, stolen images, stolen tickers it has no shot. 0%.\n\nlook at the handful of memes binance / bybit / coinbase have listed so far, its all original stuff","Type":"Tweet","Retweets":39,"Likes":465,"Replies":111},{"Content":"going to wait for $BTC to clear $69,000 and reenter the market so I know its safe","Type":"Tweet","Retweets":24,"Likes":691,"Replies":46},{"Content":"it takes 2-3 good trades to change your life","Type":"Tweet","Retweets":56,"Likes":760,"Replies":35},{"Content":"everyone knows the real bull market starts after we break old all time highs","Type":"Tweet","Retweets":30,"Likes":402,"Replies":15},{"Content":"Wormhole FDV is now into the billions and from my understanding only 50k wallets interacted with it before the snapshot\n\nmight be the next banger airdrop for SOL participants that nobody was really expecting, similar to JITO","Type":"Tweet","Retweets":14,"Likes":483,"Replies":59},{"Content":"The European mind cannot comprehend this https://t.co/lAZ0Z8hQpi","Type":"Tweet","Retweets":16,"Likes":243,"Replies":14},{"Content":"Crypto went up 5% and I havent seen a single tweet about fartcaster, order is restored","Type":"Tweet","Retweets":10,"Likes":374,"Replies":38},{"Content":"It’s an election year and you aren’t buying the silliest little coins you can find? https://t.co/ezTT0H10YD","Type":"Tweet","Retweets":45,"Likes":550,"Replies":42},{"Content":"Opepens are a masterpiece, Jack’s magnum opus\n\nThe quintessential digital art collection that’s been released in the last couple years imo\n\nOnly 15% of sets have been released, this entire collection is a grail and will be in museums","Type":"Tweet","Retweets":37,"Likes":194,"Replies":23},{"Content":"Crypto 2021 - everytime I go to make a trade I think about would an idiot make this trade? If an idiot would make this trade then I do not make that trade \n\nCrypto 2023 - everytime I go to make a trade I think about would an idiot make this trade? If an idiot would make this…","Type":"Retweet","Retweets":38,"Likes":0,"Replies":0},{"Content":"You want to get into Ordinals sooner than later because it forces you to hold bitcoin in your portfolio before you’re completely priced out of it when it’s 6+ figures each","Type":"Tweet","Retweets":17,"Likes":273,"Replies":43},{"Content":"Tell me you are on the sideline… without telling me you are on the sideline \n\n“Top vibes, pico top vibes” https://t.co/MxLoo3bvsG","Type":"Tweet","Retweets":18,"Likes":321,"Replies":13},{"Content":"Job isnt finished until we all have quadrillions","Type":"Tweet","Retweets":11,"Likes":143,"Replies":18},{"Content":"Yeah, I’m thinking we’re back. https://t.co/NmTSGomvv5","Type":"Tweet","Retweets":79,"Likes":921,"Replies":57},{"Content":"Higher for longer until you puke your brains out","Type":"Tweet","Retweets":6,"Likes":151,"Replies":21}]