[{"Content":"My word of the next few months, Patience.","Type":"PinnedTweet","Retweets":33,"Likes":381,"Replies":31},{"Content":"With BTC ETF flows surprising to the upside, the halving 2 months away, the STX Nakamoto upgrade coming in late April and the STX Bitcoin awareness marketing campaign ongoing, we continue to like STX and think it should outperform into what is a truly transformative upgrade.","Type":"Tweet","Retweets":35,"Likes":217,"Replies":35},{"Content":"Still believe ETH will eventually flip BTC. BTC has more long term structural concerns. Less clear to me whether it comes from ETH up or BTC down.","Type":"Tweet","Retweets":28,"Likes":343,"Replies":78},{"Content":"The most expensive bitcoin fund might be MSTR, not GBTC https://t.co/38NDZWkLrb","Type":"Retweet","Retweets":9,"Likes":0,"Replies":0},{"Content":"While these names have corrected from their highs we feel downside remains. Specifically for MSTR, the stock continues to trade at a ~20% premium to its underlying BTC (using conservative assumptions). We do not see a rational reason for this premium to persist, and we have… https://t.co/0NNKnQDTA8","Type":"Tweet","Retweets":13,"Likes":104,"Replies":11},{"Content":"Interesting times ahead, think for yourself, don’t listen to others. Be careful, good luck.","Type":"Tweet","Retweets":8,"Likes":197,"Replies":11},{"Content":"STX testnet Neon is now live with 5 second blocks","Type":"Tweet","Retweets":16,"Likes":140,"Replies":6},{"Content":"This is getting more priced in now. Less clear on the outlook from here IMO. As we approach the ETF launch not a whole lot is obvious to me and we are favoring smaller and fewer positions as a result (except STX, leaving that unchanged). Mostly sitting on hands and awaiting new…","Type":"Tweet","Retweets":4,"Likes":96,"Replies":11},{"Content":"Nearly one month later and STX remains the alt that we feel is most likely to rerate. When we look around most alts have already re-rated to the 10B+ FDV range, yet STX is still sitting below 3B with relatively low ongoing emissions. Furthermore, with the Nakamoto upgrade and…","Type":"Tweet","Retweets":54,"Likes":262,"Replies":24},{"Content":"https://t.co/TFrZqV7gvK","Type":"Tweet","Retweets":5,"Likes":99,"Replies":14},{"Content":"Well here we go, now we get to see if it's priced in, my bias is that it indeed mostly is, but let's see\n\nhttps://t.co/ZdCRT1qXT9\n\n\"The two executives who participated in Thursday's meetings with SEC officials said the agency indicated it could grant approval in the first few…","Type":"Tweet","Retweets":5,"Likes":40,"Replies":6},{"Content":"Was planning to post this tomorrow but it seems the market is in fast mode at the moment so I'll share some thoughts now. Some of the below overlaps with my earlier ETHBTC post, but with the first Dencun testnet now slated for mid-January and mainnet targeting a Feb launch it…","Type":"Tweet","Retweets":90,"Likes":633,"Replies":65},{"Content":"Does anyone know why Celsius seems to be converting Crypto assets to fiat? My understanding of their plan was that all distributions, and seeding of a potential NewCo would be in kind. So in this context I’m not sure why they appear to be selling (can be seem on chain).","Type":"Tweet","Retweets":3,"Likes":73,"Replies":11},{"Content":"Looking forward to this. Will be a key milestone to monitor as we approach the upgrade.","Type":"Tweet","Retweets":3,"Likes":53,"Replies":4},{"Content":"Seems there is no adverse tax consequence on GS therefore the cash create issue may not impede their conversion.","Type":"Tweet","Retweets":1,"Likes":54,"Replies":2},{"Content":"Agree with James take here. The fact that after the first year it can be taxed as long term cap gains makes this not a huge deal. In net, I don't think this meaningfully changes the ETF impact and think most significant impact is that it may make Grayscale wait to convert.","Type":"Tweet","Retweets":1,"Likes":64,"Replies":13},{"Content":"This is interesting. Still want to see it officially announced but Eric hasn’t gotten much wrong…","Type":"Tweet","Retweets":2,"Likes":48,"Replies":2},{"Content":"Have exited all long Grayscale trust positions. Grayscale is not going to want to convert in a cash convert only scenario as their product will be very tax inefficient due to the low cost basis of their BTC and will therefore very possibly not convert with the first round of…","Type":"Tweet","Retweets":6,"Likes":148,"Replies":17},{"Content":"My guess on the net effect here is that it will cause some people to avoid allocating on the initial product launch as they may already have wanted to wait to see how things settled out and now have added incentive to wait for a more tax efficient product.","Type":"Tweet","Retweets":3,"Likes":43,"Replies":10},{"Content":"This was my concern. The rally from 25k to 42k was predominantly caused by an ETF that is now likely not going to be as attractive as holding spot BTC. It's unclear how large the magnitude of the impact is here but it's definitely relevant.","Type":"Tweet","Retweets":5,"Likes":111,"Replies":26},{"Content":"This issue of cash vs in-kind create/redeem for the ETF could potentially be relevant. Seems the SEC is dug in on only allowing cash creation which would make the spot ETF less tax efficient. Investors would be taxed on a portion of their gains regardless of whether they sell or…","Type":"Tweet","Retweets":36,"Likes":240,"Replies":20},{"Content":"As a separate point adding on to my earlier post, think it's a fairly good bet that MSTR's premium compresses post ETF. Currently it trades at ~40% premium. Think this trends closer to 0, and potentially negative, post ETF. Will have more detailed thoughts on this later. https://t.co/p7NsHHYnKA","Type":"Tweet","Retweets":5,"Likes":90,"Replies":20},{"Content":"Strong confluence for ETHBTC developing into January, many factors have been structurally keeping the cross heavy but are set to reverse. Some scattered thoughts:\n\nOn a fundamentals basis BTC has been extremely strong headed into both the ETF and Halving with macro also providing…","Type":"Tweet","Retweets":100,"Likes":720,"Replies":85},{"Content":"tend to agree w this","Type":"Tweet","Retweets":8,"Likes":72,"Replies":8},{"Content":"Mkt seems a bit exhausted, nothing clear to me, mostly just sitting on hands, seems its time for patience again","Type":"Tweet","Retweets":2,"Likes":91,"Replies":31},{"Content":"eventual move higher starts now","Type":"Tweet","Retweets":14,"Likes":155,"Replies":16},{"Content":"looks like alts drew the short straw for now, these little flushes are a necessary part of an eventual move higher IMO though","Type":"Tweet","Retweets":1,"Likes":60,"Replies":4},{"Content":"for most of this rally, there have been distinct leaders at any one time, its harder for it to all move in unison","Type":"Tweet","Retweets":1,"Likes":37,"Replies":3},{"Content":"not enough liquidity to go around to support BTC, ETH, BNB, alt leaders, BLUR rewards, PYTH airdrop, something likely has to give","Type":"Tweet","Retweets":2,"Likes":108,"Replies":13},{"Content":"also the initial twt was poorly worded and mostly cope on my end, I do think the sharpest part of the rally is indeed over, but I still think there will be another decent up move as we approach actual ETF approval, calling it the \"real UpOnly\" prolly inaccurate tho","Type":"Tweet","Retweets":2,"Likes":68,"Replies":8},{"Content":"getting closer, my guess is that it starts toward the beginning of Dec","Type":"Tweet","Retweets":4,"Likes":71,"Replies":12},{"Content":"I do think the alt L1 trade is a bit overdone, and would rather look in the app layer for value from here\n\nSOL clearly has value and is here to stay some others like MATIC, OP likely here to stay as well, but the valuations make upside harder to come by and the speculative chase…","Type":"Tweet","Retweets":6,"Likes":74,"Replies":17},{"Content":"we have a relatively small position, think its solid RR but still plenty of risk\n\nrather own this than chasing the next alt L1 tho","Type":"Tweet","Retweets":0,"Likes":25,"Replies":4},{"Content":"logic for $10 dydx goes something like this\n\n~$100mm of run rate revenue that could grow to $200mm, one of the only tokens that has large and expanding TAM that also returns revenue to holders, in a strong market it's not crazy to see this trade at 50x revs due to scarcity value…","Type":"Tweet","Retweets":4,"Likes":71,"Replies":23},{"Content":"if there aren't any technical hiccups $10 dydx may not be a meme","Type":"Tweet","Retweets":1,"Likes":49,"Replies":11},{"Content":"dats a funny lookin up only\n\nreal up only starts soon tho, for a bit","Type":"Tweet","Retweets":2,"Likes":194,"Replies":55},{"Content":"So everyone thinks UpOnly huh?","Type":"Tweet","Retweets":22,"Likes":465,"Replies":108},{"Content":"TL filled with \"yeah this was fake, but it shows what will happen when then real thing happens, and so now we should continue grinding higher into approval\" takes. Will be interesting to check back in with these fellas in a month.","Type":"Tweet","Retweets":15,"Likes":163,"Replies":47},{"Content":"Took a lot of profit on GBTC today, at a ~14% discount, most of the easy money has been made. Still leaving all ETHE for now.","Type":"Tweet","Retweets":4,"Likes":65,"Replies":9},{"Content":"What odds do we ascribe that the buying yday was frontrunning this fake news?","Type":"Tweet","Retweets":1,"Likes":68,"Replies":14},{"Content":"lel https://t.co/M7iaDx20Xl","Type":"Tweet","Retweets":2,"Likes":33,"Replies":3},{"Content":"ty news traders https://t.co/0GJO2BXcDy","Type":"Tweet","Retweets":0,"Likes":34,"Replies":6},{"Content":"now we very slowly stop resisting the urge","Type":"Tweet","Retweets":3,"Likes":65,"Replies":5},{"Content":"EFUT is doing a cool ~100k of daily volume. Surely this is what VanEck envisioned when they marketed the product.","Type":"Tweet","Retweets":4,"Likes":78,"Replies":15},{"Content":"Today one of those days that the TL is so absurdly bearish you have to fight hard not to countertrade it","Type":"Tweet","Retweets":2,"Likes":103,"Replies":12},{"Content":"Base case for EIP4844 seems to be shifting to early '24.","Type":"Tweet","Retweets":4,"Likes":74,"Replies":4},{"Content":"FWIW, we have no posn in LDO, despite the fact we think it's overvalued, we think there are still many other more compelling shorts out there. We have no interest in shorting LDO from here mainly because its tokenomics are already almost fully diluted, and it's already at the…","Type":"Tweet","Retweets":3,"Likes":40,"Replies":8},{"Content":"Ever since before Shanghai I cautioned that LDO was overvalued, lacked growth drivers and would likely underperform. Since then not only is ETHBTC downonly but so is LDOETH (has now reversed almost the entire rally since the start of the year). LDO has underperformed all relevant…","Type":"Tweet","Retweets":4,"Likes":100,"Replies":20},{"Content":"@krugermacro BTC futures equally useless, got 1B of inflows in 2 days. This product did 1/1000th of that. There is a real signal in the fact that there was no interest to buy the ETH product despite several ads and no prior way to get equity exposure. Whether people wanna accept that signal…","Type":"Retweet","Retweets":3,"Likes":0,"Replies":0},{"Content":"Obviously the issuers are going to be optimistic about these products, they are looking for growth drivers for their businesses. Starting to look to me like they were all a bit too optimistic, time will tell.","Type":"Tweet","Retweets":0,"Likes":21,"Replies":9}]