[{"Content":"🔥Time To Build An Open Metaverse 🔥\n\nAll 6529 mega-threads are pinned in this thread of threads:\nhttps://t.co/yKBRMtBrE4\n\nThe team game plan is here: \nhttps://t.co/bkdYYU2dbj\n\nHop on board fam, we are going to save the world.","Type":"PinnedTweet","Retweets":2951,"Likes":11194,"Replies":2785},{"Content":"Apparently some folks don't get \"data-driven physics engine\", so let me clarify. Sora is an end-to-end, diffusion transformer model. It inputs text/image and outputs video pixels directly. Sora learns a physics engine implicitly in the neural parameters by gradient descent…","Type":"Retweet","Retweets":165,"Likes":0,"Replies":0},{"Content":"object permanence in the new openai video model is pretty wild\n\nthe weird logo and text are untouched after the woman's head slowly blocks the whole sign https://t.co/FdjiA2TV2g","Type":"Retweet","Retweets":330,"Likes":0,"Replies":0},{"Content":"I wanna paint this on a building in LA. https://t.co/kJDzU5yqO2","Type":"Retweet","Retweets":58,"Likes":0,"Replies":0},{"Content":"NY Mag's personal finance columnist was convinced by a cold caller claiming to be a CIA agent in Langley that she needed to empty her bank account, put the money in a shoebox and give it to a guy coming to meet her on the street. https://t.co/c7vbLZ5kun https://t.co/4k0fVSGlUD","Type":"Retweet","Retweets":1585,"Likes":0,"Replies":0},{"Content":"I think within 5 years, most of the internet is going to know the word “provenance”","Type":"Retweet","Retweets":2,"Likes":0,"Replies":0},{"Content":"Sand is the new oil. Who is the Saudi Arabia of sand?","Type":"Retweet","Retweets":9,"Likes":0,"Replies":0},{"Content":"Obviously","Type":"Tweet","Retweets":2,"Likes":77,"Replies":7},{"Content":"No wonder all the actors/actresses and writers went on strike!\n\nProvenance!\n\nIt may not mean a whole lot now to many people, but wow is that about to change. The timestamp on human creativity before the AI cambrian explosion (i.e., NOW!) is going to be gold I think. We'll see.","Type":"Retweet","Retweets":8,"Likes":0,"Replies":0},{"Content":"What does winning look like to me?\n\nWhen family and frens start talking about an artist or collection that I have collected.\n\nI can’t imagine another NFT outcome that will make me more happy. \n\nWhat does winning look like to you? https://t.co/UPg9pgR2Se","Type":"Retweet","Retweets":4,"Likes":0,"Replies":0},{"Content":"Congratulations @refikanadol to an incredibly successful institutional debut in the UK at @SerpentineUK. Echoes of the Earth: Living Archive exceeds all expectations and sets a new benchmark for digital exhibitions. 10/10 https://t.co/4kKrvwR2gW","Type":"Retweet","Retweets":8,"Likes":0,"Replies":0},{"Content":"gm","Type":"Tweet","Retweets":1,"Likes":242,"Replies":208},{"Content":"wtaf is going on today https://t.co/jB8kWE29c0","Type":"Retweet","Retweets":356,"Likes":0,"Replies":0},{"Content":"THIS, SO MUCH THIS. \n\nWant to create infinite demand for the dollar and cement it as dominant in global trade? Legalize the crap out of instant cross-border dollar-denominated stablecoins.","Type":"Retweet","Retweets":29,"Likes":0,"Replies":0},{"Content":"Great to see Gov. Waller making a point that should be more widely understood and discussed in economic policy and even national security circles: DeFi is a potent tool for preserving the dollar's power globally. Unlike China's CBDC plans, stablecoins issued on permissionless…","Type":"Retweet","Retweets":9,"Likes":0,"Replies":0},{"Content":"idk how this isn't immediately obvious to people","Type":"Retweet","Retweets":31,"Likes":0,"Replies":0},{"Content":"pebbles are tiny rocks https://t.co/6k9UaQ6Kqh","Type":"Retweet","Retweets":48,"Likes":0,"Replies":0},{"Content":"There is some pure elegance coming in tomorrow's Meme card by @apeinacoupe","Type":"Tweet","Retweets":29,"Likes":186,"Replies":40},{"Content":"TIL - MC Hammer is e/acc","Type":"Tweet","Retweets":1,"Likes":24,"Replies":9},{"Content":"The best rememe to ever come out of the @punk6529 ecosystem has just been dropped by @nft_lady_007 with @TheMeansCreator! I can’t believe Julia’s illustration and animation skills! 👏👏 \n\n@6529er take note for The Memes!","Type":"Retweet","Retweets":6,"Likes":0,"Replies":0},{"Content":"🔥🔥🔥🔥🔥","Type":"Tweet","Retweets":5,"Likes":126,"Replies":10},{"Content":"my thesis since buying my first piece of generative art 👇","Type":"Retweet","Retweets":3,"Likes":0,"Replies":0},{"Content":"GM!\n\nUTOPIA: London (on SR) https://t.co/AjwTJ2ESqE","Type":"Retweet","Retweets":38,"Likes":0,"Replies":0},{"Content":"fun fact: \n\nI tried to propose to \"major camera manufacturer\" tokenized photos for provenance about 5 years ago.\n\ntoo early in that case, did not go anywhere","Type":"Tweet","Retweets":2,"Likes":126,"Replies":30},{"Content":"It’s subjective ofc, but to me, this thread from @punk6529 is the best of the best\n\nOfc he did not write it for me, but sometimes I’ve found that the universe will try very hard for you to hear what you need to hear at that moment\n\nFor me, this thread was the universe speaking to…","Type":"Retweet","Retweets":9,"Likes":0,"Replies":0},{"Content":"there is almost no better fit for NFTs than long-form generative art\n\nit is more or less impossible to do without a public blockchain","Type":"Tweet","Retweets":51,"Likes":453,"Replies":46},{"Content":"65/ On Is Money Just A Game?\n\nThe thread is 55 tweets long - twitter is being strange on threading so you may have to click on the last visible tweet a few times to see all the tweets\n\nhttps://t.co/7hZXfnsW6d","Type":"Retweet","Retweets":21,"Likes":0,"Replies":0},{"Content":"been brave/rabby for a while now and am enjoying it.\n\nso far, so good, we will see if some issue emerges.","Type":"Tweet","Retweets":7,"Likes":194,"Replies":26},{"Content":"Anyone else noticing the U.S. increasingly geo-fenced completely out of crypto?\n\nThe land of the free won't allow its citizens to access airdrops because what - free money is scary?\n\nImagine if the U.S. geo-blocked itself from the internet in the 90s.\n\nTruly the dumbest timeline","Type":"Retweet","Retweets":67,"Likes":0,"Replies":0},{"Content":"Currently witnessing a valentines date where a bushwick man is explaining the power of modular blockchains while his date chugs her martini","Type":"Retweet","Retweets":12,"Likes":0,"Replies":0},{"Content":"Happy 3 years to Twin Flames NFTs 👯 https://t.co/wzvpwOfYEI","Type":"Retweet","Retweets":43,"Likes":0,"Replies":0},{"Content":"gm","Type":"Tweet","Retweets":6,"Likes":402,"Replies":331},{"Content":"Hey we were right. Turns out making a huge gigantic stink about this and not letting it go for month can work. Also - shame on you WSJ you nasty regime shills","Type":"Retweet","Retweets":230,"Likes":0,"Replies":0},{"Content":"“it’s just an accounting ledger”\n\n~ Gary Gensler, February 14, 2024","Type":"Retweet","Retweets":68,"Likes":0,"Replies":0},{"Content":"Can someone do a wellness check on @PeterSchiff? https://t.co/mUc2xGwK2j","Type":"Retweet","Retweets":144,"Likes":0,"Replies":0},{"Content":"We have been so excited to finally show everyone the final result of our collab with the extraordinary @nft_lady_007 😃\nAnd here it is for the world to see! 💚✈️\n\nIt's a celebration of one of this space's most talented and hardworking animation artists, a tribute to the… https://t.co/ZuQNojhnYE","Type":"Retweet","Retweets":17,"Likes":0,"Replies":0},{"Content":"1/ Spare just 30 seconds to dive into the remarkable creations by @TheMeansCreator. It embodies the vision @Ars0nic dreams of: crafting a collaborative universe where creativity knows no bounds and is not restricted to one person and why we'll always support SgtPepe creations. 👇","Type":"Retweet","Retweets":12,"Likes":0,"Replies":0},{"Content":"The most beautiful thing I've seen today. \"Love Ripples\" by @deekaymotion. Turn the sound on and enjoy. \n Happy Valentine's Day Twitter Fam! https://t.co/aamFaMaoCN","Type":"Retweet","Retweets":75,"Likes":0,"Replies":0},{"Content":"in public now","Type":"Tweet","Retweets":2,"Likes":53,"Replies":10},{"Content":"\"The Black &amp; White Vault\".\n\nIf I send your art there, it means I consider it to be some of my fav BnW work, and not for sale anytime soon.\n\nNew inductees:\n* @seanbonner \n* @SunyeJulien\n* And me. Yep, ME. I'm proud of my @punk6529 meme and I'm keeping one.\n\nhttps://t.co/3gMMokFleY https://t.co/xvoejNVuAb","Type":"Retweet","Retweets":4,"Likes":0,"Replies":0},{"Content":"SUPER PUMPED to be partnering with the Savanah College of  Art and Design to have a Student Showcase at Beeple Studios this spring!!   🤘\n\nstudents will create work to take over our immersive space -- aiming give them experience creating in these environments that i believe will… https://t.co/5Y175RIqMX","Type":"Retweet","Retweets":90,"Likes":0,"Replies":0},{"Content":"Meme Card #199\n“Minting Factory”\n@jsky_crypto \n\nLots of rememing potential here.  \nIn P0 now, going to P1 soon. https://t.co/XwyAuBBDh1","Type":"Tweet","Retweets":22,"Likes":159,"Replies":18},{"Content":"Gmeme all 💖\nPebbles # 75\n\nThe Zebra @ZUPHIOH @punk6529 @Ars0nic https://t.co/BvmqvnTFiY","Type":"Retweet","Retweets":8,"Likes":0,"Replies":0},{"Content":"Thanks\n\nWill never need to buy a Valentine's Day card again\n\n🤝","Type":"Retweet","Retweets":13,"Likes":0,"Replies":0},{"Content":"airdrop farmers seem like the worst possible users to acquire","Type":"Retweet","Retweets":46,"Likes":0,"Replies":0},{"Content":"I feel early everywhere I go\n\nExcept Dubai. Spent a month here over the last 6 months \n\nGo to lunch, go to dinner, go for drinks\n\n20%+ chance you will overhear someone discussing NFTs (not just crypto, NFTs specifically)\n\nAt lunch now. Not even sure what language this family is…","Type":"Retweet","Retweets":3,"Likes":0,"Replies":0},{"Content":"Great to see @KristyGlas @6529collections MemeCard irl ! https://t.co/aeijXOo4UH","Type":"Retweet","Retweets":9,"Likes":0,"Replies":0},{"Content":"CEO of Nvidia, says each person, each country, must own their own data, and implement their own AI. It can not be an AI operated by someone else. AI is the basis of the next platform of industrialization. (Paraphrasing)","Type":"Retweet","Retweets":44,"Likes":0,"Replies":0},{"Content":"gm 🖼️ \n\nShare your Pebble below and I’ll create a custom framed AR showcase for free! \n \nTo all Pebble holders by @Ars0nic @Ze_blocks and the @punk6529 team. https://t.co/VmBudmuEpX","Type":"Retweet","Retweets":21,"Likes":0,"Replies":0},{"Content":"kicking rocks with a pebble in my shoe https://t.co/bj6wcba9DI","Type":"Retweet","Retweets":29,"Likes":0,"Replies":0}]