[{"Content":"Thread: Isolation, Wifi Money, And The Prison Of Modern Society\n\n🧵\n\nOne of my all-time favorite stories is The Count Of Monte Cristo...\n\nI've read and/or watched different versions of it ever since I was a kid, and its always resonated with me intensely.\n\n1/x https://t.co/DCVrxwP0YC","Type":"PinnedTweet","Retweets":414,"Likes":1902,"Replies":151},{"Content":"I second this. @RaoulGMI got me into crypto as well🤝","Type":"Retweet","Retweets":1,"Likes":0,"Replies":0},{"Content":"https://t.co/XnIVEVUUPL","Type":"Retweet","Retweets":135,"Likes":0,"Replies":0},{"Content":"Just created the new youtube channel for defi top signal. \n\nwe need 50 subs so me @Hard_abs2013 and @Dynamo_Patrick  can live stream tonight\n\nsim por favor 🙏 \n\nhttps://t.co/2Z3gZipPSe https://t.co/YeEZQmA1yY","Type":"Retweet","Retweets":5,"Likes":0,"Replies":0},{"Content":"The Daily Degen - Thursday, February 15th, 2024\n\nStacks, Curves, Cows, Sauce, Airdrops, Videos, + New Protocols!\n\nClick below for all important crypto/macro alerts/data/news/etc condensed into a quick 5 min read!  📷🗞️ \n\nToday's Issue &gt;&gt;&gt; https://t.co/jPKmZRCgPE\n\n1/x https://t.co/WMaCSdXeOO","Type":"Retweet","Retweets":9,"Likes":0,"Replies":0},{"Content":"Some of the best performers over the past few months, and yet still no major exchange listings 🫡 \n\n$tao\n$trac\n$cacao","Type":"Retweet","Retweets":2,"Likes":0,"Replies":0},{"Content":"Surely I'm not the only one that finds it amusing that the ATH for Bitcoin is precisely $69,000. https://t.co/qdFYJuFiwb","Type":"Retweet","Retweets":3,"Likes":0,"Replies":0},{"Content":"Me. Smaller bags barely visible. \n\nI only ever have 2 max super high conviction holdings w/ 80% of my portfolio. Liquidity is a big issue too so I can't go super heavy into iliquid stuff anymore.\n\n2018-2021 $LINK\n2022 lost/mostly in stables farming and dumping\n2023-2024 $KAS $SOL… https://t.co/vvqrj5bbf3","Type":"Retweet","Retweets":4,"Likes":0,"Replies":0},{"Content":"Mishima is an utterly unique figure in the literature of the last 200 years. Militant, physical, spiritual, erudite. Brutally clear-eyed in depiction of life in all its perversities and beauty; a man who started to train for war in his 30s and kept at it until the day he died. https://t.co/LrXNOdjIzB","Type":"Retweet","Retweets":176,"Likes":0,"Replies":0},{"Content":"You can trade this market for several years and then the future of France is pumping, but you never heard of it before","Type":"Retweet","Retweets":1,"Likes":0,"Replies":0},{"Content":"Narratives of the week :\n\n- All green across the board : $BTC went straight from $43k to $52k without barely any dip. BTC.D is going up too, and $ETH is on par with BTC\n\n- Gaming has been one of the hottest sectors, $MAVIA 4x helped getting attention. Also : $BEAM $SUPER $PRIME…","Type":"Retweet","Retweets":17,"Likes":0,"Replies":0},{"Content":"Modular thesis really hitting stride right now, definitely something to pay attention to 👀","Type":"Retweet","Retweets":3,"Likes":0,"Replies":0},{"Content":"Son of a gun, they did it. \n\nI'm convinced this is still one of the best use cases for crypto.\n\nFor those who haven't been following, Miguel started off feeding hungry children around Venezuela during the last bull market. \n\nDuring the bear, he started also providing medical bill…","Type":"Retweet","Retweets":21,"Likes":0,"Replies":0},{"Content":"Everyone is exposed to a potential takeover.\n\nRecently, @Hercules_Defi got hacked and managed to take back his X account after 37 days.\n\nUse these tricks to protect yourself, so you don't become a victim.\n\nFrom a hobby cyber security engineer.🧵 https://t.co/CefDv9dNjd","Type":"Retweet","Retweets":21,"Likes":0,"Replies":0},{"Content":"Flox aka Fraxtal Blockspace Incentives is designed in a way to draw activity and TVL to Fraxtal. Fraxtal WILL NOT be a  one-time get-rich-quick airdrop. So for those thinking that FXS is sell the news on Fraxtal, think again. \n\nMy view is Fraxtal launches -&gt; TVL grows as dApps…","Type":"Retweet","Retweets":10,"Likes":0,"Replies":0},{"Content":"Feels more and more like total DeFi TVL is gonna teleport to an ATH sooner than people expect. https://t.co/zVXYetensL","Type":"Retweet","Retweets":8,"Likes":0,"Replies":0},{"Content":"Coins go lower than you think in a bear market. \n\nCoins go higher than you think in a bull market. \n\nLucky for you we are in a bull market.\n\nHold onto your winners.\n\nAll you have to do is nothing. https://t.co/E8Onc21ef3","Type":"Retweet","Retweets":35,"Likes":0,"Replies":0},{"Content":"Everything You Need To Know About Fraxtal w/ @samkazemian - Flywheel #91\n\nWatch the full interview w/ Sam Kazemian, the founder of @fraxfinance, to learn what to expect from Frax's novel modular L2, as we unravel its revolutionary Flox mechanism, boosting, blockspace incentives +… https://t.co/YLGAKV9XR1","Type":"Retweet","Retweets":35,"Likes":0,"Replies":0},{"Content":"Anybody know how to get a YouTube account reinstated? His channel is golden compared to most of the BS that Crypto YouTube promotes","Type":"Retweet","Retweets":11,"Likes":0,"Replies":0},{"Content":"4 of the most underrated airdrop farming plays \n\n(Trust me, you'll want to bookmark this for later)\n\n1. @KriyaDEX - Kriya is a perpetual Dex built on the @SuiNetwork. With $55m in TVL, it ranks as the 5th largest dapp on Sui. It stands out as the largest protocol on Sui that has… https://t.co/e0J6a4qSXR","Type":"Retweet","Retweets":4,"Likes":0,"Replies":0},{"Content":"Got a list of 400 \"alphatoooor\" accounts? Overkill and ineffective. Most of us can't handle that noise.\n\nI'm giving you 10 accounts to help you win this bull run. Yes, it's that simple.\n\nSupport them. It will be your best investment.\n\n👇🧵 https://t.co/ZtbVMnc7Ma","Type":"Retweet","Retweets":7,"Likes":0,"Replies":0},{"Content":"The New Token Standards\n\n→ The introduction of ERC404 by @Pandora_ERC404 has opened up exciting new opportunities in the NFT market and fractionalization.\n\n→ But how does it compare to other established standards like the ITEMS standard, newly launched DN404 and other existing… https://t.co/7zxuXwOxQU","Type":"Retweet","Retweets":25,"Likes":0,"Replies":0},{"Content":"If the homie is saying something retarded on the timeline ?\n\nYou can just keep on scrolling…\n\nTo publically countersignal your boy? Is a betrayal. Take it up in the DMs if you feel so strongly.","Type":"Retweet","Retweets":32,"Likes":0,"Replies":0},{"Content":"https://t.co/fvtHcqgLfr","Type":"Retweet","Retweets":54,"Likes":0,"Replies":0},{"Content":"$COIN about to melt faces. \n\nATH in Q3. https://t.co/HHxnIVtsNA","Type":"Retweet","Retweets":3,"Likes":0,"Replies":0},{"Content":"It's Valentine's Day. I love you.\n\nHere's a picture of me and gf. https://t.co/iAycQqBM5I","Type":"Retweet","Retweets":1,"Likes":0,"Replies":0},{"Content":"I have so much love for you crypto bros legit idk how to put it into words \n\nThis thread should arm you with some of the tools to kill it as alts truly begin entering the bull market zone \n\nLet’s get this bread \n\nGm \n\n❤️","Type":"Retweet","Retweets":4,"Likes":0,"Replies":0},{"Content":"In 2024 you gotta be a tracking maxi...\n\nTrack your points\nTrack your income\nTrack your airdrops\nTrack your expenses\nTrack your net worth\nTrack your happiness\n\nFor what gets tracked, gets measured.\n\nAnd what gets measured, gets done.","Type":"Retweet","Retweets":4,"Likes":0,"Replies":0},{"Content":"🌟 🌟 @CoWSwap just announced the first ever MEV-capturing AMM! Finally, there could be 1 AMM protecting LPs’ interest against MEV. 1 year ago I wrote a 🧵 of when it makes economic sense to be LPs for AMMs, and introduced LVR - the largest loss of LPs on AMMs that costs LPs…","Type":"Retweet","Retweets":27,"Likes":0,"Replies":0},{"Content":"Just left curve it. Cute cats. Orange coin good. Internet money. Penguins. Airdrops. Hodl. Number go up. Sound money. Stake it. Up only. 4. Bull market. Vibes are good. ETF approved. I’m not selling. Return to ZIRP. Future of Finance.\n\nJust. Left. Curve. It.","Type":"Retweet","Retweets":16,"Likes":0,"Replies":0},{"Content":"My $COIN Q4 earnings estimate is $0.19 eps. \n\nI’m assuming the same crypto impairment amortization schedule from previous quarters, but if they decide to adopt FASB early, earnings could explode to $2.00 eps based on crypto gains.","Type":"Retweet","Retweets":10,"Likes":0,"Replies":0},{"Content":"BTC has already hit an ATH measured against the Japanese Yen (JPY) and the Argentine Peso (ARS).\n\nIt's only 15% off it's ATH measured in Australian dollars (AUD).\n\nThe fiat currency dominoes are falling rapidly.\n\nOnly a matter of time until USD falls as well. https://t.co/52HG3xbax7","Type":"Retweet","Retweets":7,"Likes":0,"Replies":0},{"Content":"Close circles, DMs and reply guys are filled with people who are winning and I don’t gotta deal with haters because I got none lmao\n\nLet’s keep fucking crushing it wagmi is actually not a meme among us\n\nI appreciate the genuine continuous support, frog is a mindset, an idea that… https://t.co/kGESIGaO2M","Type":"Retweet","Retweets":15,"Likes":0,"Replies":0},{"Content":"So funny to see the airdrop playbook play out exactly like expected a year ago while the consensus was literally making fun of us farmers\n\nEvery single protocol is tokenizing and every single protocol is using airdrops as a community engaging and marketing tool\n\nWe got a decent… https://t.co/kQGOL9cUXU","Type":"Retweet","Retweets":15,"Likes":0,"Replies":0},{"Content":"“If you're alive, you can get better.”\n\nOddly enough, while somehow finding myself deep in the grip of crippling depression a few years ago there was one thing I couldn't let go of no matter how bad it got and that was scraping myself out of bed to get to the gym. \n\nLooking back… https://t.co/z0xSYWnv5C","Type":"Retweet","Retweets":7,"Likes":0,"Replies":0},{"Content":"Gm fam ☕️\n\nGm back if you’re taking matters in your own hands in life\n\nThis is how u gmi 🌸 https://t.co/prhn41spit","Type":"Retweet","Retweets":2,"Likes":0,"Replies":0},{"Content":"\"But its kind of a silly song, don't you think? All he does is sing 'Grandma take me home' over and over again...\"\n\n\"Shakespearean tragedy. A visceral reinterpretation of the pain of growing up within a post-1960's societal paradigm. His Baby-Boomer parents left him to 'go to a… https://t.co/rSzqwpIa5c","Type":"Tweet","Retweets":2,"Likes":22,"Replies":5},{"Content":"Turns out that was indeed the rock bottom for $PRIME\n\nThings about to get interesting imo, many people will want to be part of this and very little liquidity available\n\nI expect some kind of second launch effect when Binance lists it (negative funding, squeezing etc)\n\n$20 soon https://t.co/Wejmf4VlbC","Type":"Retweet","Retweets":7,"Likes":0,"Replies":0},{"Content":"Feb. 14, 2024: All's Fair in L2's and $CRV Wars 💖🎖️\n$crvUSD seduced onto sidechains in supply sink strategem\n\n🧵1/9👇 https://t.co/fcXD8J2kgj","Type":"Retweet","Retweets":9,"Likes":0,"Replies":0},{"Content":"this is also one of the reasons I am lowkey trying to sabotage the rising success and awareness of @blocmatesdotcom, I discovered @nftperp via them last year on a video which only has 300 views.\n\nI need to cap their reach, I need to cap their success, I need to keep them lowkey…","Type":"Retweet","Retweets":4,"Likes":0,"Replies":0},{"Content":"Just re-read this while doing research for a schizo thread I'm working on...\n\nAbsolutely cannot recommend it highly enough: \n\nhttps://t.co/5f04ONXbSP","Type":"Tweet","Retweets":5,"Likes":24,"Replies":8},{"Content":"This aged amazingly well for $PENDLE, amazing to see BTC and ETH flying too. \n\nTook my first time off in 2 years+ full time, feeling refreshed and ready to go.\n\nStill been grinding in the backgrounds, time to get back into trading right before a mega altszn 🫡","Type":"Retweet","Retweets":3,"Likes":0,"Replies":0},{"Content":"F O R E X  R E P O S  I N  B I O","Type":"Retweet","Retweets":6,"Likes":0,"Replies":0},{"Content":"NFT-Fi will be the next trend and if this market is like the previous then the NFT bull run starts later and tops out later. \n\nyou need to be paying attention to @nftperp anon. \n\nonce again, it will be one of the most obvious plays in hindsight. \n\nalso in the coming weeks there… https://t.co/06jzciJIrN","Type":"Retweet","Retweets":4,"Likes":0,"Replies":0},{"Content":"The Daily Degen - Wednesday, February 14th, 2024\n\nSunshine, Lions, Airdrops, Inflows, Macro, Videos, + New Protocols!\n\nClick below for all important crypto/macro alerts/data/news/etc condensed into a quick 5 min read!  📷🗞️ \n\nToday's Issue &gt;&gt;&gt; https://t.co/lttASdTaqi\n\n1/x https://t.co/8ZXkTPL6dt","Type":"Retweet","Retweets":8,"Likes":0,"Replies":0},{"Content":"Very much true.\n\nHave met so many great people along the way.","Type":"Retweet","Retweets":1,"Likes":0,"Replies":0},{"Content":"Pro tip: your nation GDP doesn’t matter if you can’t feel safe taking the tube","Type":"Retweet","Retweets":3,"Likes":0,"Replies":0},{"Content":"Very nice $BTC ETF flows https://t.co/duI61X4iJz","Type":"Retweet","Retweets":1,"Likes":0,"Replies":0},{"Content":"Speed Running Financial History, Lessons from TradFi for DeFi\n\nPart 2: Why Did Investors Stop Demanding Dividends?\n\n1600s-1900s: What Does the Stock Do?\n2020s: What Does the Token Do?\n\nDeFi needs more awareness of our TradFi parallels. Many of our problems, discoveries, life… https://t.co/jmkeJ3BJXp","Type":"Retweet","Retweets":17,"Likes":0,"Replies":0},{"Content":"Original content creator: @schizoxbt (06/27/2023) https://t.co/8oex33IvUL","Type":"Retweet","Retweets":2,"Likes":0,"Replies":0}]