[{"Content":"huge props to @samczsun and everyone who has worked on this - it has been awesome to get to watch and help this come together 🙌","Type":"Retweet","Retweets":7,"Likes":0,"Replies":0},{"Content":"Delighted to be among the founding members of the Security Alliance alongside @paradigm, @a16zcrypto, @ethereum, and @VitalikButerin","Type":"Retweet","Retweets":9,"Likes":0,"Replies":0},{"Content":"thanks to @samczsun for initiating and gathering so many people, ScamSniffer is very excited to participate in it, let's contribute to the security of crypto together!","Type":"Retweet","Retweets":10,"Likes":0,"Replies":0},{"Content":"A pivotal initiative. Sam does so much behind the scenes to improve security in the space.","Type":"Retweet","Retweets":9,"Likes":0,"Replies":0},{"Content":"This is was one of the good “u up?” type of moments\n\nI cannot overstate how lucky we are that we have people and teams that push everyone forward with initiatives like these 💜","Type":"Retweet","Retweets":10,"Likes":0,"Replies":0},{"Content":"I haven't actively participated in war rooms until the Vyper vulnerability\n\nSubsequently, joining SEAL 911 was a no-brainer, and working side by side with security leaders is a lot of fun\n\nWith such a team, the web3 future is protected🛡️\n\nhttps://t.co/69xuyNg9iE","Type":"Retweet","Retweets":8,"Likes":0,"Replies":0},{"Content":"excited to partner with @samczsun and the @_SEAL_Org team to help make crypto more secure!","Type":"Retweet","Retweets":6,"Likes":0,"Replies":0},{"Content":"@_SEAL_Org  is one of the most exciting Crypto Security projects I've seen and I'm so excited that we got to collaborate alongside such amazing minds.  Securing smart contracts and reducing hacks FTW! https://t.co/pOCaf75frK","Type":"Retweet","Retweets":5,"Likes":0,"Replies":0},{"Content":"We're excited to announce that Framework has officially joined @_SEAL_Org as a founding partner and donor!\n\nWith the emergency hotline, Whitehat Safe Harbor Agreement, &amp; war games, SEAL is a massive step forward in crypto security.\n\nS/O @samczsun for leading the initiative! https://t.co/NqqmFbPVk1","Type":"Retweet","Retweets":15,"Likes":0,"Replies":0},{"Content":"Awesome to see this go public, after being worked on so hard by so many behind the scenes for so long.\n\nSEAL, beyond directly addressing one of the core challenges facing decentralization tech today (security), proves out a new model for coordinating diverse entities to achieve…","Type":"Retweet","Retweets":6,"Likes":0,"Replies":0},{"Content":"We're very excited for @nascentxyz and @NascentSecurity to be collaborating with Sam and the rest of the @_SEAL_Org team.\n\nWe started out leading the charge on the Incident Response Playbook, a part of the SEAL Crisis Handbook https://t.co/lbQVgmj67g\n\nMore to come from this crew!","Type":"Retweet","Retweets":6,"Likes":0,"Replies":0},{"Content":"Super excited to share the work @samczsun and @_SEAL_Org have been doing to defend decentralized networks and protocols. \n\nWhite hats play a key role in our ecosystem, and SEAL provides a crucial venue for their partnership, coordination, and terms of engagement.","Type":"Retweet","Retweets":1,"Likes":0,"Replies":0},{"Content":"Had a lot of fun working on @_SEAL_Org with @samczsun and the collection of experts he pulled together to make this happen. \n\nThere are going to be a lot of truly novel solutions coming out of this org, which should elevate security across the sector.","Type":"Retweet","Retweets":4,"Likes":0,"Replies":0},{"Content":"A fantastic initiative for optimizing incident response in our industry.\n\nPreventative measures are only one step of the equation. Swiftly identifying the proper procedures and talent to respond to an exploit is a must-have for any protocol.\n\nGreat stuff @samczsun &amp; @_SEAL_Org💪","Type":"Retweet","Retweets":2,"Likes":0,"Replies":0},{"Content":"In web3, decentralization creates new vulnerabilities in a way that makes security everyone’s responsibility 🤝\n\nThose who build, protect, and propagate DeFi need to be aligned... enter @_SEAL_Org 🦭","Type":"Retweet","Retweets":7,"Likes":0,"Replies":0},{"Content":"Super exited about this launch and proud to be a part of this collective!\n\nI have no doubt that we’ll all significantly benefit from the whitehat agreement and the many great things to come!\n\n❤️🙌","Type":"Retweet","Retweets":2,"Likes":0,"Replies":0},{"Content":"It's been great to work with @samczsun and many others to build the Security Alliance.\n\nCrypto is unique, and fulfilling its promise requires developing new legal and technical tools for security researchers.\n\nI hope that the Whitehat Safe Harbor Agreement is the first of many!","Type":"Retweet","Retweets":5,"Likes":0,"Replies":0},{"Content":"Happy Valentine's 🥰\n\n@_SEAL_Org meets the demand for industry cooperation, creating a framework to confront and manage active threats. \n\nA few words on our involvement and participation:\n\n💕 Wargames: A fundamental step in preparing protocols to face threats fast and decisively.…","Type":"Retweet","Retweets":6,"Likes":0,"Replies":0},{"Content":"This is an awesome initiative by some of the brightest security + legal minds in the space\n\nIncredibly proud of our very own @lex_node who played a huge role in putting this together. Truly one of the unsung heroes of the space","Type":"Retweet","Retweets":6,"Likes":0,"Replies":0},{"Content":"SEAL addresses so many of the gaps in crypto security. \n\nFirst the 911 Emergency Helpdesk to connect users and researchers to the right contacts at protocols when they discover a potential exploit\n\nThen Wargames to help protocols practice incident response before they have to…","Type":"Retweet","Retweets":10,"Likes":0,"Replies":0},{"Content":"I totally forgot to mention this in my thread but SEAL also wouldn't be possible without the support of our donors. Big thanks to @paradigm, @a16zcrypto, @dragonfly_xyz, @ElectricCapital, @ethereum, @FilFoundation, @hiFramework, and @VitalikButerin!","Type":"Tweet","Retweets":16,"Likes":191,"Replies":6},{"Content":"Zellic is proud to be a founding member of the crypto Security Alliance (SEAL) to advance the state of best practices in blockchain security.\n\nOur Co-Founder and CTO @ret2jazzy is already a first responder for SEAL 911, a group of highly trusted security researchers available on…","Type":"Retweet","Retweets":4,"Likes":0,"Replies":0},{"Content":"Happy Valentine’s Day to all of web3, thanks to the leadership of @samczsun who has turned competitors into collaborators to better secure our ecosystem.\n\nBefore @_SEAL_Org, web3 security community coordination looked more like this: https://t.co/XsYdiDoOFu","Type":"Retweet","Retweets":8,"Likes":0,"Replies":0},{"Content":"Good to have you back @samczsun.\n\nThank you for initiating  @_SEAL_Org , our CTO Blue is also a member of the group, alongside numerous security experts we’ve had the privilege of knowing throughout the years—all of whom are outstanding individuals.\n\nIn the event of a hack…","Type":"Retweet","Retweets":28,"Likes":0,"Replies":0},{"Content":"Thanks to @samczsun’s leadership, the @_SEAL_Org is making their public debut today! Web3 security will never be the same 🔐 https://t.co/SkbDXNMM5S","Type":"Retweet","Retweets":4,"Likes":0,"Replies":0},{"Content":"HackerOne is excited to support the launch of @_SEAL_Org, which has been formed to empower and protect security researchers hacking in the Web3 space. Read more about The Security Alliance's initiatives: https://t.co/YoHfrEsUwi https://t.co/q3kPCoDOcg","Type":"Retweet","Retweets":4,"Likes":0,"Replies":0},{"Content":"endless shoutouts to @lex_node @SH_Brennan and @LeXpunK_Army for the incredible amount of work that was put into the @_SEAL_Org Whitehat Safe Harbor\n\nthere was no way this ships without their long hours of work\n\ncrypto is safer thanks to you 🫡\n\nhttps://t.co/1qOz7Zk1SA","Type":"Retweet","Retweets":5,"Likes":0,"Replies":0},{"Content":"I am incredibly honored to be a part of this group who helped make SEAL a reality. This may be the most important contribution I've made to Ethereum ever and I can say that everyone Sam listed and more have spent even more time and energy than I did.\n\nIt can't be overstated how…","Type":"Retweet","Retweets":6,"Likes":0,"Replies":0},{"Content":"Extremely excited for what @samczsun is building with the @_SEAL_Org \n\nThis is the collaborative approach to security our space needs to grow and keep users safe. \n\nWe will be collaborating closely together to ensure lightning-fast protection.","Type":"Retweet","Retweets":5,"Likes":0,"Replies":0},{"Content":"Hey crypto security researchers... will you be our valentine?\n\nWe’re excited to help spread the word about the Safe Harbor Agreement, along with sending love to our security crushes @samczsun and the @_SEAL_Org ❤️ https://t.co/x51AsHDgov","Type":"Retweet","Retweets":13,"Likes":0,"Replies":0},{"Content":"Everyone in crypto should read this post and save @_SEAL_Org telegram bot\n\nIf not you then your friend would have a chance to recover your loss\n\nAmazing initiative \n\nhttps://t.co/i04YC2Q8nv","Type":"Retweet","Retweets":7,"Likes":0,"Replies":0},{"Content":"Happy Valentine's Day to all crypto whitehats and security researchers!\n\nCheck out the launch initiatives on the website. SEAL is just getting started. There's lots more to come.\n\nFun fact, the SEAL in SEcurity ALliance stands for @Samczsun's Extra Autistic Line-up.","Type":"Retweet","Retweets":8,"Likes":0,"Replies":0},{"Content":"I care deeply about security. When we launched SEAL 911 ~6 months ago, it was a big experiment and it still is. But I feel like we've already made a difference. Welcome to SEcurity ALliance, an initiative that is a beacon of hope, illuminating the path to a more secure tomorrow.","Type":"Retweet","Retweets":11,"Likes":0,"Replies":0},{"Content":"Excited about Valentine's Day? Personally I'm much more excited about @_SEAL_Org launching! SEAL is a non profit composed by some of the brightest cybersec people who want to build public good, high impact security contributions that benefit the ecosystem. 💌","Type":"Retweet","Retweets":3,"Likes":0,"Replies":0},{"Content":"Nothing has my crypto 🩷 more than keeping the ecosystem safe for builders &amp; users. Big Valentine's Day thank you to @_SEAL_Org &amp; @samczsun for making the #crypto ecosystem more safe and secure. 🦭💟🦸💪","Type":"Retweet","Retweets":7,"Likes":0,"Replies":0},{"Content":"The volunteer firefighters of crypto security band together to form a fire department.\n\n@_SEAL_Org","Type":"Retweet","Retweets":3,"Likes":0,"Replies":0},{"Content":"How ready are you for worst-case scenarios, anon? 🤔\n\nSEAL drills prepare you for potential emergencies by running simulated protocol attacks on Tenderly Virtual TestNets.\n\nLearn how to keep calm &amp; handle any emergency with maximum efficiency 👇🧵\nhttps://t.co/eqpXmNsBRF","Type":"Retweet","Retweets":3,"Likes":0,"Replies":0},{"Content":"Excited to be a part of this initiative with @_SEAL_Org alongside @samczsun and other security leaders!","Type":"Retweet","Retweets":4,"Likes":0,"Replies":0},{"Content":"In September 2023, @wh01s7 published an article to start discussions about White Hack Policy. At the same time, a dedicated group was working on something similar independently in the shadows.\n\nToday is the day to start discussions again!\n✅Check the WHITEHAT SAFE HARBOR…","Type":"Retweet","Retweets":2,"Likes":0,"Replies":0},{"Content":"🎉 Thrilled to share: Dedaub celebrates the public debut of the Security Alliance @_SEAL_Org (SEAL). As a SEAL founding collaborator, we strongly support SEAL’s mission and believe it is marking a significant milestone in crypto security. Read More https://t.co/sZNvEc8DX6 https://t.co/cXwuKntiDt","Type":"Retweet","Retweets":6,"Likes":0,"Replies":0},{"Content":"Today, the Security Alliance (SEAL, @_SEAL_Org) just launched a new initiative called Safe Harbor with a month-long request for comment period.\n\nIn short, Safe Harbor is a legal/technical framework that protocols can implement to let whitehats know it’s okay to intervene during… https://t.co/SZ5HZcviNs","Type":"Retweet","Retweets":13,"Likes":0,"Replies":0},{"Content":"SEALing the deal with @samczsun 💘\n\nUniswap Labs is proud to support the Security Alliance (SEAL), empowering white hat hackers to keep crypto safe and secure https://t.co/NHgmclIdcG","Type":"Retweet","Retweets":33,"Likes":0,"Replies":0},{"Content":"The pseudonymous cybersecurity researcher samczsun is leading an initiative to protect “white-hat hackers” from potential legal woes https://t.co/mjEyuTzgJI","Type":"Retweet","Retweets":26,"Likes":0,"Replies":0},{"Content":"haha oops i really hope someone at twitter literally stole this account https://t.co/0jmOucfa7G","Type":"Tweet","Retweets":0,"Likes":43,"Replies":7},{"Content":"sherlock going after the small but highly lucrative user demographic of \"security researchers who are also top 1% of users on linkedin\" https://t.co/yY9f7Qm0QK","Type":"Tweet","Retweets":3,"Likes":136,"Replies":16},{"Content":"security researcher:\n- too formal\n- mouthful to say\n- have fun working your 9-5\n\nhunter:\n- cool as fuck\n- rolls right off the tongue\n- plot armor guarantees critical findings\n\nthe choice is obvious (pic unrelated) https://t.co/wAIjxtqLtM","Type":"Tweet","Retweets":16,"Likes":314,"Replies":32},{"Content":"I'm all for responsible disclosure but if the timeline is correct, this is a pretty ridiculous overreaction given that (1) Twitter didn't fix the bug for over a year and (2) rabbit only made public the XSS, not the full exploit chain\n\nBesides, where do they report bugs now?","Type":"Tweet","Retweets":23,"Likes":206,"Replies":21},{"Content":"@shoucccc ✅✅✅\n\nThe bug has been fixed! Thanks again to @shoucccc for surfacing and credit to @rabbit_2333 for discovering\n\nTechnical Summary:\nReflected XSS in Twitter subdomain and CORS/CSP bypass allows for arbitrary requests to the Twitter API as locally authenticated user","Type":"Retweet","Retweets":71,"Likes":0,"Replies":0},{"Content":"They're still going around throwing multiple terabytes of traffic at projects running on Vercel, all with what seems like a common misconfiguration. If you or your friends get hit and need help mitigating, please reach out and spread the word","Type":"Tweet","Retweets":27,"Likes":110,"Replies":13},{"Content":"In the third installment of the self-audit series, we're going to be taking a look at your Google account. Note that this isn't meant to cover data privacy (such as your search/location history) as that could fill an entire textbook.\n\nhttps://t.co/csyjZ3jA2b","Type":"Tweet","Retweets":35,"Likes":177,"Replies":6}]