[{"Content":"Apparently it is the “real” Daniel Friedberg appearing on Zoom.  \n\nJudge refuses to allow Friedberg to testify through Zoom.\n\nJudge says the Friedberg declaration is also procedurally improper. \n\nSo, it is now clear where this is going to end up.","Type":"Retweet","Retweets":213,"Likes":0,"Replies":0},{"Content":"Surprised it's taken them this long to make this type of announcement.\n\nAs crazy as it sounds, this is probably the highest chance FTX has at restoring some type of value and making customers whole.","Type":"Retweet","Retweets":61,"Likes":0,"Replies":0},{"Content":"It’s interesting. This maps to some of what @SBF_FTX seems to be claiming. Does John Ray &amp; S&amp;C have egg on their face?","Type":"Retweet","Retweets":50,"Likes":0,"Replies":0},{"Content":"Well, I just finished reading the Declaration of Daniel Friedberg.  \n\nIt is fair to say that this is one of the more shocking sworn statements I have read in a good long while.\n\nIf half of what Mr. Friedberg says is true, he has just blown the top off of this bankruptcy case.","Type":"Retweet","Retweets":93,"Likes":0,"Replies":0},{"Content":"Former FTX Regulatory Officer Daniel Friedberg just laid out his opposition to the company retaining law firm Sullivan &amp; Cromwell to file for bankruptcy in the US\n\nHe alleges people at FTX aligned with the firm purposefully racked up fees and used “funds from customers” to pay 👀 https://t.co/AvOmp3yxUy","Type":"Retweet","Retweets":53,"Likes":0,"Replies":0},{"Content":"1/  There's something off with the FTX bankruptcy.\n\nAnd it's happening tomorrow.\n\nHere's what you should know.","Type":"Retweet","Retweets":331,"Likes":0,"Replies":0},{"Content":"I'm glad Mr. Ray is finally paying lip service to turning the exchange back on after months of squashing such efforts!\n\nI'm still waiting for him to finally admit FTX US is solvent and give customers their money back...\n\nhttps://t.co/XjcyYFsoU0\n\nhttps://t.co/SdvMIMXQ5K","Type":"Tweet","Retweets":309,"Likes":1676,"Replies":2790},{"Content":"Set a reminder for my upcoming Space! https://t.co/EDOb9mTHcy","Type":"Retweet","Retweets":195,"Likes":0,"Replies":0},{"Content":"Expanding on DealBook:\n\nWhen I filed, I'm fairly sure FTX US was solvent, and that all US customers could be made whole.\n\nTo my knowledge, it still is today.\n\nI was expecting that to happen.  I'm surprised it hasn't.  I'm not sure why US withdrawals were turned off.","Type":"Tweet","Retweets":655,"Likes":4380,"Replies":8076},{"Content":"We think @andrewrsorkin and @dealbook did a fantastic job. They asked the direct pointed questions and they were appropriately critical. Excellent job.","Type":"Retweet","Retweets":56,"Likes":0,"Replies":0},{"Content":"🚨SBF Joins the Show. Set your reminders 🫡\n\nhttps://t.co/1m4urdSs4C","Type":"Retweet","Retweets":1185,"Likes":0,"Replies":0},{"Content":"#HappeningNow - Senator The Hon. L. Ryan Pinder, KC, Attorney General &amp; Minister of Legal Affairs gives a National Address to discuss the government’s response and position with respect to the #FTX collapse.\n\nhttps://t.co/5zzDH68MmK","Type":"Retweet","Retweets":110,"Likes":0,"Replies":0},{"Content":"“I am fully confident that, as matters progress, and the activities of the FTX group are either restructured or wound down, The Bahamas will emerge, held in even higher esteem” - Bahamas Attorney General","Type":"Retweet","Retweets":46,"Likes":0,"Replies":0},{"Content":"Bahamas AG says it is “extremely regrettable” FTX’s new CEO, misrepresented action taken by Bahamian regulators.\n\n“It is possible that the prospect of multi-million dollar legal and consultant fees is driving both their legal strategy and the intemperate statements” \n👇","Type":"Retweet","Retweets":50,"Likes":0,"Replies":0},{"Content":"Please tune into a National Address on Behalf of The Government of The Bahamas on the Developments of FTX by Senator Ryan Leo Pinder \nhttps://t.co/HCQkXUa86A","Type":"Retweet","Retweets":28,"Likes":0,"Replies":0}]