[{"Content":"It seems I have closed 37 positions in the past 6 months. All verifiable!\n\n5 losers out of 37 positions (86% win rate) simply by moving away from LTF towards HTF trades.\n\nSimplify your methods not only for headspace clarity but improving your confidence to make larger… https://t.co/Xm4KNLIcIT","Type":"PinnedTweet","Retweets":76,"Likes":1087,"Replies":93},{"Content":"TGIF Portfolio Update.\n\nHand sitting is the name of the game.\n\nPrepare for upwards teleportation.\n\nWe’re about to hit escape velocity.\n\n$ETH $ETHBTC $DYDX $ONDO $ALT $BLUR https://t.co/vbC7I83tq0","Type":"Tweet","Retweets":13,"Likes":307,"Replies":27},{"Content":"2024 prediction:\n\nWe will simply continue buying the outperformers before they're the outperformes https://t.co/I97sYMhF9I","Type":"Retweet","Retweets":183,"Likes":0,"Replies":0},{"Content":"@MongolMode @vahrez273 Maybe, i have enough exposure with eth spot and coinM. the catchup play is a sentiment one for me as i approach trading from a Sentiment &gt;Technicals&gt;Fundamentals standpoint.\n\nIt’s a really simple question here, which is the least extended chart out there on a HTF that the market…","Type":"Retweet","Retweets":2,"Likes":0,"Replies":0},{"Content":"The greatest trick the devil ever pulled was convincing the world that $ETH is a mid curve bet.\n\nAs a sidelinoor, you open the charts and everything is overextended.\n\nWhat else do you buy here?\n\n$ETHBTC https://t.co/AhqurOYGSr","Type":"Tweet","Retweets":16,"Likes":328,"Replies":25},{"Content":"You'll make a lot of money in this cycle by following guys who actually make money and are open about it than guys who keep on larping with no proof.\n\nIt takes balls for guys like @smartestmoney_, @MacnBTC, @HighStakesCap and many such guys to post their positions with millions…","Type":"Retweet","Retweets":16,"Likes":0,"Replies":0},{"Content":"Study Teleportation.","Type":"Tweet","Retweets":15,"Likes":360,"Replies":15},{"Content":"“It never was my thinking that made the big money for me. It always was my sitting.” - Jesse Livermore \n\nHappy with my current positions. Will be sitting on them.\n\nWhen we hit teleportation time, all we can do is just sit and watch as the sidelineoors struggle to get onboard.… https://t.co/ytfSZ0ElQN","Type":"Tweet","Retweets":39,"Likes":883,"Replies":67},{"Content":"Like i said, this is teleportation time.\n\nWe are GOING VERTICAL 📈\n\nHow do i know what i know? 10,000 hours in front of the charts.\n\nThere’s really no other alternative for this. \n\nPut in the hours and you’ll get this superpower.","Type":"Tweet","Retweets":16,"Likes":445,"Replies":30},{"Content":"Hey anon,\n\nDid you get onboard the Smartestmoney train or did you choose to be sidelined?\n\nThis time, we’re about to go vertical. https://t.co/r7z8tc9oTE","Type":"Tweet","Retweets":5,"Likes":252,"Replies":16},{"Content":"altlayer : eigenlayer :: dymension : celestia\n\niykyk","Type":"Retweet","Retweets":32,"Likes":0,"Replies":0},{"Content":"P&amp;L teleporting on CoinM. (this excludes spot &amp; USDM perps) https://t.co/zjL8UeWFbI","Type":"Tweet","Retweets":16,"Likes":614,"Replies":39},{"Content":"$ONDO\n\n... idk, I just got here (updated update) https://t.co/H0nJ1EU5Tr","Type":"Retweet","Retweets":5,"Likes":0,"Replies":0},{"Content":"Commence the teleportation upwards.\n\n$ETH $ONDO $DYDX $BLUR $ALT https://t.co/R3UdRIlxk2","Type":"Tweet","Retweets":10,"Likes":226,"Replies":18},{"Content":"The ticker is $ALT &amp; its breaking out https://t.co/kkce1ZUiij","Type":"Retweet","Retweets":7,"Likes":0,"Replies":0},{"Content":"$BLUR - Ancillary proxy for ETH\n\n- Believe market generally underestimates interest from dev teams looking to build ponzis on Blast mainnet launch\n- Still the only place to bet on both Blast activity as well as ETH NFTs\n\nVery surprised PA is so anemic going into launch 🧐","Type":"Retweet","Retweets":21,"Likes":0,"Replies":0},{"Content":"$MKR at 1100 to 2200 $TIA at 2 probably. They were all called out live and in advance on CT.\n\n$ETH however has been my most profitable trading instrument with spot and trading ETH exclusively on CoinM\n\nIt’s only 11months old and i’m top amongst the live sharing crowd there. https://t.co/1x705nZfPQ","Type":"Tweet","Retweets":14,"Likes":405,"Replies":26},{"Content":"I don’t think people realize how hard it is to do this all with open live positions in real time. \n\nAll i want is to get to the top and show to the world that this can be done open, honest and completely free.","Type":"Tweet","Retweets":21,"Likes":463,"Replies":27},{"Content":"Everyone should study @smartestmoney_ with conviction trades like eth \n\nAnyways back to hiatus","Type":"Retweet","Retweets":2,"Likes":0,"Replies":0},{"Content":"@smartestmoney_ Study the dip. \n\nI think the reason ppl fail while following you is they don’t understand you average into positions, have a large stack to buy the dip with and have a long time horizon on traders.","Type":"Retweet","Retweets":1,"Likes":0,"Replies":0},{"Content":"Guess who was adding like a mad man?\n\nStudy mental illness. \nStudy Martingale.  \nStudy Nietzsche.\n\n“Whoever fights monsters should see to it that in the process he does not become a monster. And if you gaze long enough into an abyss, the abyss will gaze back into you.”\n―… https://t.co/qdTcLlyGXE","Type":"Tweet","Retweets":14,"Likes":299,"Replies":34},{"Content":"He didn’t earn the name smartestmoney by being dumb I can assure you that","Type":"Retweet","Retweets":2,"Likes":0,"Replies":0},{"Content":"I’ll take “CT TRADERS WHO DONT TRADE REAL MONEY” for a $1,000 https://t.co/xS6grue2Px","Type":"Tweet","Retweets":5,"Likes":183,"Replies":15},{"Content":"... idk, i just got here\n\n$ONDO\n\n(@Dentoshi am I doing this right?) https://t.co/RRQt2ekRmp","Type":"Retweet","Retweets":11,"Likes":0,"Replies":0},{"Content":"Extremely impressive inflows and performance from btc but still think the ethbtc bottom is in and we're just moving through a period of time-based capitulation.\n\nStrong btc etf inflows tells the market there will be strong eth etf inflows. That uncertainty was what squashed the…","Type":"Retweet","Retweets":48,"Likes":0,"Replies":0},{"Content":"Smartest Money realized that any crypto asset will go up if you hold it long enough","Type":"Retweet","Retweets":21,"Likes":0,"Replies":0},{"Content":"Quick Rorschach Test Thought Experiment\n\nLook at these 2 charts what do you see? Reply to this thread.\n\nI’ll share what i see after.","Type":"Tweet","Retweets":11,"Likes":118,"Replies":59},{"Content":"How does it feel like underperforming a hentai-watching squirting weeb that daydreams of life with a penis?","Type":"Tweet","Retweets":2,"Likes":70,"Replies":8},{"Content":"Study mental illness. #study","Type":"Tweet","Retweets":5,"Likes":110,"Replies":9},{"Content":"https://t.co/aJttt7WCrw\n\nI guess there is no hard and fast rule to trading, every successful trader has a different approach and perspective of concepts. \n\nBut it seems like all the traders with real results recognize this first and foremost:\n\nIt’s all just a Risk Management…","Type":"Tweet","Retweets":7,"Likes":133,"Replies":4},{"Content":"@smartestmoney_ Agreed, nothing beats hard work. What I great about trading is that you can learn more. It’s especially true with sizing. The rules change as it increases. \n\nAlso, the more you study the better, but more importantly you also need skin in the game.\n\nOne can be a great analyst but…","Type":"Retweet","Retweets":3,"Likes":0,"Replies":0},{"Content":"@0xJov1 @ChingonETH @armslookcute @GiganticRebirth @Saint_Pump Narratives come after price action.\n\nLike money, they are a social construct that requires belief. \n\nIt’s not that hard to create narratives, we humans believe almost anything we want to believe.","Type":"Retweet","Retweets":9,"Likes":0,"Replies":0},{"Content":"@armslookcute @GiganticRebirth @smartestmoney_ @Saint_Pump this smartmoney guy doesn't even believe in narratives. Just drawing lines and he is top-1 on binance leaderboard. Da fuck is going on","Type":"Retweet","Retweets":2,"Likes":0,"Replies":0},{"Content":"SKILL ISSUE.","Type":"Tweet","Retweets":1,"Likes":74,"Replies":3},{"Content":"plz wake up.\n\nSKILL ISSUE @JoshuaDeuk \n\nLearn to grow a pair before you start fading @smartestmoney_ \n\n$DYDX $BLUR $ONDO $ETH $ALT https://t.co/VbuLv2xDsH","Type":"Tweet","Retweets":5,"Likes":133,"Replies":10},{"Content":"How are you liking them apples today boys ?","Type":"Tweet","Retweets":3,"Likes":57,"Replies":6},{"Content":"$BLUR $ALT $ONDO $DYDX $ETH https://t.co/Zx0x8AjRWp","Type":"Tweet","Retweets":6,"Likes":75,"Replies":5},{"Content":"Typically have a weeks to months holding period for my trades. As i’ve mentioned before increase your timeframe increase your win rates.\n\nMedian holding period of 477 hours (20 days) translating into the highest win rate on the leaderboard at 85%\n\nhttps://t.co/O825Vkh5zO","Type":"Tweet","Retweets":14,"Likes":243,"Replies":13},{"Content":"Live Position Updates are now back Online at https://t.co/EfqkF7641e\n\nWill continue to use this MO of going off the leaderboard before making portfolio changes as the opportunity costs of front running have been too high for me recently. \n\nCheers for understanding.","Type":"Tweet","Retweets":9,"Likes":125,"Replies":14},{"Content":"@0x_CaptainKim @chaingangmulla TA first then narrative.\n\nPrices go through periods of price acceptance and consolidation before price discovery. I know when things are about to move mainly from experience.\n\nMy setups entries are during consolidation about to move into price discovery as these give the best…","Type":"Retweet","Retweets":6,"Likes":0,"Replies":0},{"Content":"As much as i enjoy fishing with you guys in the old live open updates telegram channel, my trade execution has to come first before delayed ANNs.\n\nRegardless, my main objective here is to teach you how to fish by prioritizing overall portfolio risk management above all else.…","Type":"Tweet","Retweets":20,"Likes":261,"Replies":28},{"Content":"Yes this is a better detailed narrative for $ALT but it’s alt season and i’ll still go with this https://t.co/pcrQQR2laf","Type":"Tweet","Retweets":5,"Likes":123,"Replies":4},{"Content":"How does one keep getting away with buying the dip?\n\nYou have to simply grow some gonads and stop being a pussy.\n\n$DYDX https://t.co/O4dpyLOjA2","Type":"Retweet","Retweets":6,"Likes":0,"Replies":0},{"Content":"Position Update :\n\nMY FAVORITE COLOR IS GREEN.\n\nI have not been selling a single thing, only Max Bidding.\n\n$DYDX $ALT $ONDO $BLUR $ETH $ETHBTC https://t.co/pvO8KdpWQU","Type":"Tweet","Retweets":35,"Likes":573,"Replies":67},{"Content":"On days like today, you should take the time to remember who was max bidding and telling you to MAX BID.\n\nRemember who told you to wait for 32K and FUDing you out of your positions.\n\nI’ve been non stop bidding NEW POSITION ANN to come shortly 🚀","Type":"Tweet","Retweets":9,"Likes":280,"Replies":30},{"Content":"$ONDO\n\nnot a lot of history on this one, but on first glance my gut says this should go for the highs\n\nyou're smashing into sr level now, so a bad place to enter longs\n\neither wait for a flip or see if you get a pullback that sweeps some of these lows, then enter on ltf bullish… https://t.co/fZAnntauty","Type":"Retweet","Retweets":6,"Likes":0,"Replies":0},{"Content":"“You can save her.”\n\nThe 4 most dangerous ever uttered to a man.","Type":"Tweet","Retweets":1,"Likes":87,"Replies":12},{"Content":"Hey @onlyfans and all #onlyfansbabe i’m retiring @graciehartie into her own CONDO once i’m done training her into becoming a top trader.\n\nRT this with  “1 $ONDO = 1 CONDO” to all your simps and you might be the lucky next student. https://t.co/yrnPdpwh4f","Type":"Tweet","Retweets":16,"Likes":140,"Replies":34},{"Content":"1 $ONDO = 1 CONDO for you?","Type":"Tweet","Retweets":6,"Likes":111,"Replies":18},{"Content":"Have you been bidding?\n\nI’m back in the trenches all guns blazing. https://t.co/0WDmWeEQ7V","Type":"Tweet","Retweets":2,"Likes":188,"Replies":19}]