[{"Content":"This year you're going to see me support projects my team invested in over the last few years.\n\nI'll give a heads up about tokens we're an early investor in - if there's any confusion whether I'm just trading something or have deeper involvement, just ask and I'll let you know.","Type":"PinnedTweet","Retweets":48,"Likes":358,"Replies":142},{"Content":"Here’s what’s currently in the pipeline:\n\n1. Gene therapy for follistatin 💪 ✅ \n2. Gene therapy for LH (testosterone over 1500 ng/dl without TRT) 💉 \n3. Cloned gut bacteria transplants from Olympic athletes to increase Vo2MAX 🦠 \n4. Gene therapy for endogenous BPC 💊 \n5.…","Type":"Retweet","Retweets":39,"Likes":0,"Replies":0},{"Content":"The Vision Pro is missing collaborative spatial computing - the ability for several devices to share one space.\n\nThe @posemesh is building a universal protocol for collaborative spatial computing, and we've been showing the way for years on handhelds.\n\nhttps://t.co/VoxKRV0yBG","Type":"Retweet","Retweets":15,"Likes":0,"Replies":0},{"Content":"Geographically speaking, would you survive the first day of global nuclear war? Just curious","Type":"Tweet","Retweets":4,"Likes":80,"Replies":124},{"Content":"https://t.co/sfTKRUocHC","Type":"Tweet","Retweets":14,"Likes":415,"Replies":90},{"Content":"We are a lot closer to ATH than it feels like.","Type":"Retweet","Retweets":17,"Likes":0,"Replies":0},{"Content":"Haven't sold a Bitcoin since 2021.","Type":"Tweet","Retweets":11,"Likes":409,"Replies":60},{"Content":"it's Bitcoin L2 szn. in a manner that is truly unprecedented and i mean that literally","Type":"Retweet","Retweets":87,"Likes":0,"Replies":0},{"Content":"What do we need to help with the mess we have created in pharamcology? \n\nA symposium that comes togther to fuse Russian and American medicine.  @TuckerCarlson with Putin was just the start\n\nThey use drugs that we don't even have FDA approval on\n\nInstead of spending billions…","Type":"Retweet","Retweets":3,"Likes":0,"Replies":0},{"Content":"Probably close to here. About -$60k. \n\nEverything I owned in my apartment (just a bedroom in a stranger's house I rented) and computer at office this day 4 years ago.\n\nIt only takes one bull market. https://t.co/fU0kChNFvW","Type":"Tweet","Retweets":53,"Likes":1324,"Replies":120},{"Content":"You’re going to see a lot of people doing this soon\n\nThe divide between the haves and have nots is going to become giant\n\nGenetically enhanced, peptide infused, bio-optimized people vs normie, obese, depressed people\n\nAdd AI, neurolink to all of this \n\nGet ready https://t.co/qwAlzU5bGe","Type":"Retweet","Retweets":20,"Likes":0,"Replies":0},{"Content":"Hope you get rich","Type":"Retweet","Retweets":35,"Likes":0,"Replies":0},{"Content":"Why should you care about #DePIN? Have a seat.\n\nWith the rise of AI, civilization will grow to 100 billion thinking, productive inhabitants. What happens the majority of economic agents will be AI?🧵 https://t.co/36T1opFgmL","Type":"Retweet","Retweets":34,"Likes":0,"Replies":0},{"Content":"新年快乐！\nHappy Chinese New Year！","Type":"Retweet","Retweets":3187,"Likes":0,"Replies":0},{"Content":"You know we got the real shit $MOUTAI https://t.co/vR8azFx6f0","Type":"Tweet","Retweets":42,"Likes":329,"Replies":99},{"Content":"I will give 1 BTC to the first person who recognizes me in public and comes up to say hi.\n\nI'm south of Beijing, west of Shanghai, north of Hong Kong, east of Tibet.\n\nYou have 10 days.","Type":"Tweet","Retweets":19,"Likes":1012,"Replies":327},{"Content":"Grandpa stayed up til 3 to make it fresh https://t.co/fw2CsBjoon","Type":"Tweet","Retweets":8,"Likes":310,"Replies":49},{"Content":"BTC really going to pump into CNY?\n\nI don't like it","Type":"Tweet","Retweets":13,"Likes":399,"Replies":77},{"Content":"chinese new years soon\n\nevery cny meme is gonna be worth punting if ur early","Type":"Retweet","Retweets":10,"Likes":0,"Replies":0},{"Content":"How much do you usually tip your business class shuttle hostess? \n\nAll I have is Alipay on me today https://t.co/bdINZfoMH6","Type":"Tweet","Retweets":3,"Likes":250,"Replies":87},{"Content":"I bet you wish you were here https://t.co/i136NDKrFo","Type":"Tweet","Retweets":7,"Likes":125,"Replies":42},{"Content":"you know how u hate nfts cuz theyre non fungible\n\nnow theyre fungible natively without having to use a fractionalization protocol\n\nwhich means more ways for liquidity to enter the nft vertical\n\nwhich is the number 1 thing everyone has been complaining about\n\naped","Type":"Tweet","Retweets":50,"Likes":517,"Replies":107},{"Content":"Still time to be early on an upcoming narrative: BTC L2s.\n\nLike it or not maxis are retreating. Development (and investment) is accelerating in Bitcoin defi.\n\nHonestly it's been a long time coming.","Type":"Tweet","Retweets":67,"Likes":952,"Replies":170},{"Content":"We are about to see an explosion of L2s, Dapps, and new financial primitives on Bitcoin.   \n\nAnd both the puritan maxis and altcoiners are sleeping on it.   \n\nThis is going to be a paradigm shift. Great ready 👏","Type":"Retweet","Retweets":75,"Likes":0,"Replies":0},{"Content":"Monero will never compromise on privacy. \n\nYou can trade Monero on other exchanges, on DEXs, and with atomic swaps. Please self-custody your XMR.","Type":"Retweet","Retweets":1238,"Likes":0,"Replies":0},{"Content":"Should I hold my $DYM?","Type":"Tweet","Retweets":5,"Likes":196,"Replies":96},{"Content":"Tarochi is the 1st game deploying to Xai mainnet\n\nThe game is monitoring Xai stakers, so let's just say if you're staking on Xai you'll want to keep an eye on Tarochi tokenomics👀","Type":"Retweet","Retweets":167,"Likes":0,"Replies":0},{"Content":"Focusing on Blockchain, can you explain parallel compute and modularity in the simplest terms possible?\n\nWhat are the pros, cons?\n\nDoes Solana use parallel compute?\n\nWhy might someone choose a monolithic approach instead?","Type":"Tweet","Retweets":11,"Likes":115,"Replies":55},{"Content":"Quick thoughts from Satoshi Round Table in Dubai:\n\n- The Bitcoin L2 session yesterday was the largest session I’ve seen here. Packed and 5 Bitcoin L2 projects there.\n\n- Today, multiple parallel sessions going on about Bitcoin L2s, BitVM, peg security, Bitcoin Defi etc.\n\n- BitVM…","Type":"Retweet","Retweets":276,"Likes":0,"Replies":0},{"Content":"The longer I'm here the further my time horizon grows.\n\nWhen I first found CT early '17 I saw it all as little more than a opportunity to make a quick buck.\n\nThinking more and more these days how I want to be involved in 10, 20 years time.","Type":"Tweet","Retweets":24,"Likes":419,"Replies":56},{"Content":"I have the deepest respect for hardcore nerds reading and writing crypto tech and research at the bleeding edge. The 1%.\n\nDoing my best consulting, listening to these guys, playing catch up on everything technical so I can break it down and communicate as simple as possible.","Type":"Tweet","Retweets":20,"Likes":315,"Replies":78},{"Content":"If you haven't made money recently don't worry you're still a genius. The market just isn't pumping right now.","Type":"Tweet","Retweets":55,"Likes":750,"Replies":100},{"Content":"I take big size positions for big swings when I have big confidence.\n\nSmall scalps, squeezing money out of a range, etc, is not interesting to me.\n\nNo big confidence lately, will post trades again when it is back.","Type":"Tweet","Retweets":23,"Likes":547,"Replies":59},{"Content":"In light of the recent conversation around EVM L2s on Bitcoin, we wanted to express our commitment to transparency and rigour, both in our tech/product stack and our thesis for the space.","Type":"Retweet","Retweets":36,"Likes":0,"Replies":0},{"Content":"$CHZ break out in progress https://t.co/G9rM9dDYHz","Type":"Tweet","Retweets":27,"Likes":155,"Replies":54},{"Content":"Playing around on @particle_trade. New way to trade anything on Uniswap v3 with leverage.\n\nClosed beta by invite atm, just testnet money. Here's a few codes:\n\nVAgnTX\nBIaVQs\nSajCcE\nTIQSZP\ngzqtYS\nTEzOqn\n\nIDK if there's gonna be airdrop but... doesn't hurt to try new things.","Type":"Tweet","Retweets":29,"Likes":115,"Replies":148},{"Content":"What makes me happy and fulfilled is consistent exercise, consistent sleep, consistent nutrition, and time outside in the sun.\n\nSo simple, but easy to fall off track. Junk snacks, late nights, skipped workouts bc not feeling it.\n\nI'm making it a priority to stay in a good loop.","Type":"Tweet","Retweets":40,"Likes":579,"Replies":119},{"Content":"Oh jeez. I forgot I longed something and come to find myself underwater. Now I am vigorously watching the 1 min chart for a bounce.\n\nCurrently up 1.17% from the low it made 10 minutes ago so you could say I'm optimistic.\n\nJust give me break even I promise I won't do that again.","Type":"Tweet","Retweets":21,"Likes":430,"Replies":73},{"Content":"When I was 13 I hosted a forum board for graphic designers (mostly PS but had some GIMP nerds) to share tutorials, brushes, hone their craft, outdo each other in weekly contests.\n\nRemember forum signatures? Lol\n\nDid all my own CSS and hosted that shit with a .com it was clean.","Type":"Tweet","Retweets":9,"Likes":161,"Replies":42},{"Content":"Tornado Cash is the most important project in crypto, and their lawsuits are the most critical.\n\nDo we have the right to financial privacy and peer-to-peer transactions?\n\nIf not, the Fourth Amendment in the U.S. is dead. https://t.co/OcWTob0xAo","Type":"Retweet","Retweets":145,"Likes":0,"Replies":0},{"Content":"Putting the feelers out there: looking to add a stellar BD to the @BotanixLabs team - smart, nice, driven; obsessed with the vision of scaling on #Bitcoin; excellent communicator; equal thought partner; and vibes on point. DM me if you have any referrals!","Type":"Retweet","Retweets":10,"Likes":0,"Replies":0},{"Content":"Don't feel like going to the gym today. Going anyway.\n\nRun the madarchod numbers","Type":"Tweet","Retweets":20,"Likes":612,"Replies":145},{"Content":"What happened to my for you page?\n\nGetting a bunch of viral tweets complaining about lack of job security and inflation.\n\nWe love both of those things.","Type":"Tweet","Retweets":11,"Likes":105,"Replies":29},{"Content":"Imagine sitting in a Starbucks with $8900 in cash on the table in unmarked envelopes in front of you it's been an hour and a half and the OTC dealer says, \"sorry bro I need to see 2 confirmations.\"","Type":"Tweet","Retweets":19,"Likes":232,"Replies":40},{"Content":"Wake up, you were asleep saying something about a Bitcoin ETF.\n\nThe group chat is wondering where you are, a new coin just dropped called $based https://t.co/QO0hNLcKGr","Type":"Retweet","Retweets":11,"Likes":0,"Replies":0},{"Content":"$FAR is trending globally \n\nYou know how we do 💥👊🏼 https://t.co/DbJV4jRimu","Type":"Retweet","Retweets":13,"Likes":0,"Replies":0},{"Content":"Insane performance of $FAR despite the shitty market sentiment.\n\nI think it's up like 14x from the private sale price but the vesting was pretty shitty with a 6 months cliff without any coins up front (I didn't invest). Just bought it on the market since there will be no unlocks.… https://t.co/UGfT46baZe","Type":"Retweet","Retweets":5,"Likes":0,"Replies":0},{"Content":"How soon until GBTC starts selling off again? 1-2 hrs from now is when they usually do it?","Type":"Tweet","Retweets":9,"Likes":358,"Replies":67},{"Content":"Have you lost significant money trading in the last few days?","Type":"Tweet","Retweets":10,"Likes":54,"Replies":73},{"Content":"My winning strategy is only trade easy market conditions. No adventurous knife catching. No holding bad entries underwater for days. No trying to play it fancy.\n\nJust waiting for real easy money.","Type":"Tweet","Retweets":63,"Likes":859,"Replies":76}]