[{"Content":"Bittersweet feeling today. The house I spent my entire life in sold, so I drove with daughter by it one last time. All memories, good and bad, in one spot ready to be assumed by future occupants that will ultimately anchor their life and experiences here in one way or another.… https://t.co/r694FqBvcF","Type":"PinnedTweet","Retweets":11,"Likes":814,"Replies":60},{"Content":"BTC funding is lowest and baseline level at Bybit and Binance. ETH edging up a little bit at Binance, still baseline at Bybit. Most alts funding quite high. \n[OKX an outlier since they changed their leverage limits]\n\nToo many retail degen traders long alts with leverage\n(1/x) https://t.co/ecSKM9sMBL","Type":"Retweet","Retweets":4,"Likes":0,"Replies":0},{"Content":"Study options. A lot of you seem incapable of trading beyond one dimension, so if you don’t wanna learn: for the bulls out there, take fucking profit, and for the bears, markets won’t go down until every one of you is squeezed out of their last penny (sorry, those are the rules).…","Type":"Retweet","Retweets":44,"Likes":0,"Replies":0},{"Content":"@TheFlowHorse Horse thanks for sharing this. And as far as crypto vol goes as people use the tool we will love feedback on how to improve what we show.","Type":"Retweet","Retweets":1,"Likes":0,"Replies":0},{"Content":"So @KrisAbdelmessih gave me access to his new https://t.co/OjvhVVk1Ub tool and honestly even if you just used the \"cheat sheet\" alone you could benefit massively.\n\nThis is great for vol traders looking for a clear view on the relative value of options across multiple assets, or… https://t.co/VcjmdvZovY","Type":"Tweet","Retweets":4,"Likes":43,"Replies":8},{"Content":"So our friends have a dog that is pretty famous in the Hollywood dog world, and she is currently in an America's Favorite Pet competition.\n\nYou know I am going to call on the collective forces of my following to give her a boost. \n\nIf you love dogs like a normal person vote for… https://t.co/7MKyJQeTfw","Type":"Tweet","Retweets":1,"Likes":80,"Replies":22},{"Content":"Continuing to buy $WIF on intraday dips. No top until major blow off.\n\nWeekly VWAPs have remained good entries. Expecting this to persist while short term leverage is continually wiped and a strong spot bid remains.\n\nTargeting at least .80 https://t.co/vXHWCu6HLm","Type":"Tweet","Retweets":49,"Likes":428,"Replies":41},{"Content":"Useful chart to keep an eye on #BTC ETF flows moving forward. \n\nChart this.\nhttps://t.co/vOgIyPTLPe https://t.co/CdKRWhjOqf","Type":"Tweet","Retweets":10,"Likes":125,"Replies":6},{"Content":"Here's some perspective on trading short-dated options versus perpetuals. When I streamed two nights ago, Ethereum (ETH) was at $2,631. It traded almost 10% higher and has now settled at a 7% increase.\n\nAt @Synquote the 2700 strike calls, expiring tomorrow, were priced at $20 and… https://t.co/hd6iwb0WW7","Type":"Tweet","Retweets":2,"Likes":55,"Replies":11},{"Content":"Going live now, come through!","Type":"Tweet","Retweets":1,"Likes":15,"Replies":2},{"Content":"These dudes pay upwards of 15k in some cases just to get some **man's man** qualities.\n\nAbsolute dorks. Go join a bjj or fighting gym. Combat and humility will cleanse your weakness and plant the seeds for your strength. Also, it will leave no evidence of this corniness behind.","Type":"Tweet","Retweets":1,"Likes":97,"Replies":28},{"Content":"So many stupidly bullish looking charts.","Type":"Tweet","Retweets":23,"Likes":361,"Replies":29},{"Content":"Notice Google trends only picks up at an ATH break.\n\nThe ultimate retail phone punter signal.","Type":"Tweet","Retweets":31,"Likes":376,"Replies":13},{"Content":"25% off the highest weekly close for #BTC \n\nBeing this closer creates a certain gravitational pull that will suck out liquidity from other assets as people pile in. \n\nA new all time high is a forgone conclusion. Just a matter of when, not if at this point. https://t.co/lmLk3D73M9","Type":"Tweet","Retweets":33,"Likes":420,"Replies":27},{"Content":"Gm my friends. Get the f*ck after it. https://t.co/qGtcVj8YGh","Type":"Tweet","Retweets":8,"Likes":129,"Replies":14},{"Content":"Update on where things stand from my vantage point:\n\nAt the moment, I'm most concerned with protecting the gwei value of my portfolio. Plenty of great looking alt setups out there, but find it increasingly difficult to move in and out of rotations while there is such a strong…","Type":"Retweet","Retweets":41,"Likes":0,"Replies":0},{"Content":"It's 2024 &amp; people are still posting hyblock liquidation charts","Type":"Retweet","Retweets":3,"Likes":0,"Replies":0},{"Content":"Happy Valentine’s day folks. \n\nIt’s a bull market. Caviar and Pringles it is. https://t.co/HfG5aEdWXN","Type":"Tweet","Retweets":8,"Likes":329,"Replies":38},{"Content":"In the quarters ahead into 2025, liquidity will be the event, just as much as adoption &amp; price formation. \n\nLiquidity of protocols\nLiquidity of builders\nLiquidity of users\nLiquidity of mkts\n\nLiquidity begets liquidity, and liquidity tends to rush around, until the tides turn.","Type":"Retweet","Retweets":63,"Likes":0,"Replies":0},{"Content":"Delivering the perfect match with our 'Risk and HR Assessment Tool' – a blend of precision and diversity in recruitment.\n\nRedefine talent acquisition for your business. #HRInnovation #DiverseTalent 🚀 Explore &gt;&gt; https://t.co/C69ykaSV7B","Type":"Tweet","Retweets":35,"Likes":178,"Replies":5},{"Content":"Retail always is going to come back at an all time high break. It is an attention grabber. Right now it is still natives redeploying and buying.","Type":"Tweet","Retweets":18,"Likes":274,"Replies":12},{"Content":"A few things that look like they are about to rip much higher.\n\nI don't even care for NFTs but I know a lot of other people do.\n\nWaiting for $BLUR to send - Things that touch 8s end up hitting 10s. \n\ne.g. The .80 to 1  will be an easy trade https://t.co/8dGoRn4Gnf","Type":"Tweet","Retweets":4,"Likes":108,"Replies":17},{"Content":"Join us for a market discussion with @TheFlowHorse this Thursday at 1PM ET! \n\nThis week's agenda includes: \n🔭 Market outlook \n💹 Altcoin spotlight\n🌊 Options flows \n🎙️ Community Q&amp;A\n\nYou won't want to miss this!\n\nhttps://t.co/8z9HQ4L1pM","Type":"Retweet","Retweets":1,"Likes":0,"Replies":0},{"Content":"⚠️ PENTAGON OFFICIAL SAYS SECURITY THREAT ALSO TIED TO SPACE: FOX","Type":"Retweet","Retweets":115,"Likes":0,"Replies":0},{"Content":"The year is 2035, #Bitcoin  is some exorbitantly high number after central banks added it, and no one even thinks in terms of buying whole units of it anymore.\n\nYou kick yourself because you rolled your perp profits into CatLitterInuRocket token instead of doing the smart thing… https://t.co/D8HTJmDkID","Type":"Tweet","Retweets":15,"Likes":195,"Replies":24},{"Content":"Ah I see $FLIP is finally coming back to my entry price.\n\nI have sat in this underwater bag for longer than any other.","Type":"Tweet","Retweets":0,"Likes":43,"Replies":10},{"Content":"There is a lot of meat on the bone between an $ETH etf being priced at a 60% probability (now) and a 90% probability. https://t.co/PfwaJY1jEx","Type":"Tweet","Retweets":4,"Likes":104,"Replies":8},{"Content":"If you ever find yourself asking “Where would the capital come from?”, just remember $XRP and $ADA have 50b of market cap between them.","Type":"Tweet","Retweets":28,"Likes":320,"Replies":25},{"Content":"You ready? It's about to get wonky. https://t.co/JUpHO0lQRZ","Type":"Tweet","Retweets":4,"Likes":262,"Replies":20},{"Content":"Avoid giving up good positions by sitting on the bike instead of at the desk. https://t.co/MyBfoDgnJo","Type":"Tweet","Retweets":8,"Likes":456,"Replies":53},{"Content":"Remember, stupid bulls tend to outperform smart bears.","Type":"Tweet","Retweets":86,"Likes":706,"Replies":20},{"Content":"I think that $DYM trade I talked about last night in the stream is setting up here.\n\nEarly hedgers probably close out soon. Spot volume picking up.\n\nShould be a very easy play to $10 if you are just considering the most obvious move. Higher prices in these conditions are probably… https://t.co/Z4KPKUWtBr","Type":"Tweet","Retweets":8,"Likes":93,"Replies":7},{"Content":"If this pattern repeats, similar to prior instances, the next part of the cycle is the craziest. Generally, the second leg often is.\n\nA new Bitcoin all-time high would make everyone here ravenous and extremely risk-on, but alts, specifically, are entering a period that often… https://t.co/S7LgieXdRe","Type":"Tweet","Retweets":133,"Likes":861,"Replies":42},{"Content":"Gm.\n\nWhen $SOL God candle?","Type":"Tweet","Retweets":10,"Likes":324,"Replies":48},{"Content":"This stream summary is so much better than that stream was. Still shot from being sick, apologies if you tuned in and my brain was on power down mode.😂\n\n\"Uhh, ummm, urrrr, uhhhh, I tired, uhhhh, umm, urrrr, my brain doesn't work right now\"","Type":"Tweet","Retweets":2,"Likes":78,"Replies":11},{"Content":"Live in 5 minutes","Type":"Tweet","Retweets":0,"Likes":20,"Replies":10},{"Content":"What follows is some information that tends to induce people to make bad decisions. So, disclaimer: Don't make bad decisions.\n\nThere's some unique positioning in S&amp;P options right now.\n\nDealer SPX vanna exposure (VEX) is at all-time highs.","Type":"Retweet","Retweets":110,"Likes":0,"Replies":0},{"Content":"Good afternoon\n\nSome of you are ok....\n\nDon't fall for bull market genius up only zuper cycle chanting again this round.\n\nLater,\nN.","Type":"Retweet","Retweets":62,"Likes":0,"Replies":0},{"Content":"Stairs up, elevator down.\n\n$LYFT after-hours chasers smoked. https://t.co/y1b59o0wZf","Type":"Tweet","Retweets":3,"Likes":53,"Replies":15},{"Content":"Coinbase Q4 earnings and full year results this Thursday.\n\nWho isn't yolo'ing $COIN calls already? https://t.co/a3pRh9AHHR","Type":"Tweet","Retweets":6,"Likes":152,"Replies":12},{"Content":"@TheFlowHorse Hikes probably wont get priced in, there is still 3.5 of cuts priced in, what gets re-priced is a soft landing because rates would stay too high for too long","Type":"Retweet","Retweets":2,"Likes":0,"Replies":0},{"Content":"I have a genuine question.\n\nOctober 7th was obviously a horrible act of violence, but what is the reason for continued bombing of what are densely civilian populated areas in Palestine?\n\nDoes Israel only have hammers and no scalpels?\n\nSeems like a great way to continually produce…","Type":"Tweet","Retweets":10,"Likes":275,"Replies":135},{"Content":"@TheFlowHorse If there are no signs of a recession and inflation is unclear, there's no rush to cut.","Type":"Retweet","Retweets":2,"Likes":0,"Replies":0},{"Content":"Great post, great content. \n\nI had the privledge to sit next to an extreme Q3 trader who didn’t want to take any pain at one point but later developed into an 8-figure trader a decade later. So I asked him directly:\n\nClockwork: “Make 1k/day for 5 years. Get 300-500k in bank…","Type":"Tweet","Retweets":5,"Likes":98,"Replies":10},{"Content":"What a wild period we're living through.\n\nEvery day on YouTube, one can witness firsthand footage of trench warfare, capturing the intense close-quarters combat between Russia and Ukraine, often showing soldiers engaging each other from just a meter away, all without any edits.","Type":"Tweet","Retweets":2,"Likes":83,"Replies":17},{"Content":"This man has to clear some snow from the paths. Stream rescheduled to tonight at 7pm EST, 12am UTC.  \n\n-Some great news and changes coming to @Synquote\n\n-Trade ideas  I don't really share my trades on X so if you want to know how I am positioning show up and ask questions!…","Type":"Tweet","Retweets":0,"Likes":35,"Replies":10},{"Content":"Winner winner chicken dinner.","Type":"Tweet","Retweets":0,"Likes":26,"Replies":3},{"Content":"Last minute Nor'easter on Long Island. 100$ in #BTC to the first person that can guess that bird in the background. https://t.co/ne0h2LFL9r","Type":"Tweet","Retweets":1,"Likes":135,"Replies":48},{"Content":"Bitcoin is 490pts from the entire timeline talking about a swing failure.","Type":"Tweet","Retweets":0,"Likes":188,"Replies":20},{"Content":"Simple heuristic\n\nSPX above 5000, risk assets good.\n\nSPX below 5000, risk assets probably no good.","Type":"Tweet","Retweets":12,"Likes":140,"Replies":10}]