[{"Content":"I have ~6hrs worth of educational content covering various things from psychology, TA, directional bias throughout the year, searching for setups, and everything in-between.\n\nMade a playlist for all the homies grinding during the bear market🤝\n\nCheers🖤\nhttps://t.co/DWy6v2Thew","Type":"PinnedTweet","Retweets":119,"Likes":771,"Replies":40},{"Content":"a surfer doesn’t ride a wave and hyper-fixate on the fact that it inevitably crashes\n\nthey’d be unable to enjoy the thrill of riding the wave in the first place\n\nsame concept. as a *trend trader* you shouldn’t be focused on when the market tops\n\njust enjoy the ride while it lasts https://t.co/jxPBsqLYTy","Type":"Tweet","Retweets":8,"Likes":110,"Replies":5},{"Content":"I still have no idea what parallelized evm or modularity means, and at this point I’m too afraid to ask\n\n(no I’m not. If the coins go up the tech is good and I subscribe to any bull thesis you might have) https://t.co/y1qLCnQzv5","Type":"Tweet","Retweets":2,"Likes":154,"Replies":10},{"Content":"$ETH\n\nstarting to shape up very nicely\n\nreclaimed 4H 200MAs HTF trend, and now threatening breakout above this range\n\nDaily chart also maintained a higher low\n\nthink we may finally see that proper ETH-led rally\n\n70IQ narrative to attach along with it as well if you need one (ETF) https://t.co/mG0JcdSvGg","Type":"Retweet","Retweets":7,"Likes":0,"Replies":0},{"Content":"we really get to run back the playbook from Oct-Jan where all you have to do is turn your brain off and say “top-right corner” https://t.co/W7dSGmetH6","Type":"Retweet","Retweets":11,"Likes":0,"Replies":0},{"Content":"this is just straight up false\n\nmost alts are struggling against the king, but I'm looking at a handful right now that are trending in price discovery, or soon going to be\n\nyou're just not looking in the right places","Type":"Tweet","Retweets":2,"Likes":87,"Replies":12},{"Content":"even if you’re sidelined, you should always be cheering for green candles.\n\nopportunities get compounded in this industry. It’s fruitless worrying about the ones you’ve missed out on, cause it’s likely there’s better ones on the horizon.\n\nyou’ve got this. https://t.co/QcvtyHbJzH","Type":"Tweet","Retweets":16,"Likes":220,"Replies":9},{"Content":"price is moving vertically, green candles only, bears stepping in front of trains get ran over. Feels good.\n\nplease don’t ruin it by calling for $1M BTC in 6 weeks or changing your pfp to laser eyes\n\nThanks.","Type":"Tweet","Retweets":3,"Likes":176,"Replies":17},{"Content":"Study the ‘class of 2017’ mindset:\n\nif your altcoin isn’t outperforming BTC, you have no business trading it","Type":"Tweet","Retweets":11,"Likes":198,"Replies":7},{"Content":"people are so eager to apply narratives for every little market movement\n\nthey open up a thesaurus and start putting together a thesis that sounds smart\n\nyou can't fool me though. It wasn't long ago when you guys were trying to convince me this dude is from the future\n\niykyk. https://t.co/QxjAghioAJ","Type":"Tweet","Retweets":2,"Likes":101,"Replies":9},{"Content":"Had a great time recording this podcast with @Stoiiic \n\nHope you guys enjoy🫡🖤","Type":"Tweet","Retweets":1,"Likes":27,"Replies":1},{"Content":"Everyone keeps telling me “people aren’t euphoric on this move because alts aren’t doing well against BTC”\n\n&gt; find better alts","Type":"Tweet","Retweets":6,"Likes":170,"Replies":6},{"Content":"BTC just flirted with $50k and timeline is quiet\n\nWHAT ARE YA’LL DOING THIS IS WHY WE’RE HERE ARE YOU NOT ENTERTAINED?!?! https://t.co/b6rKtj2FGh","Type":"Tweet","Retweets":9,"Likes":399,"Replies":54},{"Content":"it’s always more fun being bullish. https://t.co/EdWPsR22m3","Type":"Tweet","Retweets":13,"Likes":198,"Replies":1},{"Content":"$BTC &amp; $ETH 3-minute analysis\n\nPlaying Chess against the market https://t.co/w6rOxgOt6B","Type":"Retweet","Retweets":10,"Likes":0,"Replies":0},{"Content":"Gm\n\nMy quant loves playing in the snow https://t.co/5SGfzss10g","Type":"Tweet","Retweets":1,"Likes":121,"Replies":13},{"Content":"Yeah idc how big this account gets or what the $ is. I will never sell my soul and start doing undisclosed shills. Never have and never will.\n\nmoney isn’t worth losing sleep over when you actually have a conscience\n\nsounds like skill issue anyways.","Type":"Tweet","Retweets":1,"Likes":196,"Replies":19},{"Content":"can’t believe all I have to do is create a subpar ripoff of a mobile game in order for crypto bros to invest 7figs into it and start shilling it relentlessly as the greatest game to ever exist to millions of people\n\nshow us your seed round allo’s\n\nbunch of leeches","Type":"Tweet","Retweets":7,"Likes":267,"Replies":31},{"Content":"Homeless at the age of 14. My fam and I lived in a car for ~2 weeks\n\nBefore that we used to wash and reuse paper plates, and I remember having Kraft singles cheese and crackers for dinner\n\nCame from nothing. Truly blessed now and grateful","Type":"Tweet","Retweets":6,"Likes":519,"Replies":35},{"Content":"NVDA stock has the same market cap as all of crypto combined\n\nwe are unironically still so fucking early https://t.co/sHGscKB889","Type":"Tweet","Retweets":17,"Likes":160,"Replies":14},{"Content":"added some threads I’ve written on important trading concepts to the ‘highlights’ section of my profile for ease of access.\n\nhope you find value there.\n\nmuch love🖤 https://t.co/mATYVs3lBi","Type":"Tweet","Retweets":3,"Likes":123,"Replies":9},{"Content":"btw, Grayscale is still selling.\n\nthe narrative remains applicable but the chart stopped caring, so now many will find themselves paralyzed after attempting to justify market movements using things they don’t understand\n\nlesson in there. https://t.co/v8wwmjz7WJ","Type":"Tweet","Retweets":6,"Likes":92,"Replies":11},{"Content":"Friendly reminder that FOMO does not exist. It's in your head\n\nIf your biggest issue is; nothing in your life changed between yesterday and today, but the market changed - that's not a real issue\n\nDon't paralyze yourself for no reason. Just look for the next opportunity https://t.co/s2C5g7TqmM","Type":"Tweet","Retweets":5,"Likes":124,"Replies":5},{"Content":"there's just no way this market gives us up-only for 3 months straight where even BTC manages to pull an 80% move, free 5-figure airdrops for a month, and then more uptrend\n\nbro how is this even f*cking real?\n\nif you were here through 2022 toughing it out, you deserve this. https://t.co/yCFouJJ5MA","Type":"Tweet","Retweets":14,"Likes":305,"Replies":15},{"Content":"we really get to run back the playbook from Oct-Jan where all you have to do is turn your brain off and say “top-right corner” https://t.co/W7dSGmetH6","Type":"Tweet","Retweets":11,"Likes":173,"Replies":8},{"Content":"Key concepts I always remind myself of in Crypto:\n\n- Discipline &gt; intelligence.\n\n- There’s beauty in simplicity.\n\n- Opportunity is abundant. ‘Luck’ is correlated to those who put themselves in positions for opportunity to find them frequently.\n\n- Laziness is a disease.","Type":"Tweet","Retweets":21,"Likes":212,"Replies":9},{"Content":"$BTC &amp; $ETH 3-minute analysis\n\nPlaying Chess against the market https://t.co/w6rOxgOt6B","Type":"Tweet","Retweets":10,"Likes":125,"Replies":11},{"Content":"$ETH\n\nstarting to shape up very nicely\n\nreclaimed 4H 200MAs HTF trend, and now threatening breakout above this range\n\nDaily chart also maintained a higher low\n\nthink we may finally see that proper ETH-led rally\n\n70IQ narrative to attach along with it as well if you need one (ETF) https://t.co/mG0JcdSvGg","Type":"Tweet","Retweets":7,"Likes":125,"Replies":6},{"Content":"I got airdropped an average US yearly salary for using chains I was going to use anyways, and staking a coin that’s up 100% past 2 months\n\nnowhere but crypto :D https://t.co/cjXC4lr2tW","Type":"Tweet","Retweets":9,"Likes":283,"Replies":12},{"Content":"feels like the optimism in the market died because we were all waiting for $ETH to rally after spot etf approval and it just…didn’t\n\na part of me thinks I might’ve just been too early to that idea\n\nconsider this post hopium. my system doesn’t agree yet.\n\ncharts when/if it does https://t.co/zaB5CAyHKB","Type":"Tweet","Retweets":2,"Likes":91,"Replies":8},{"Content":"market feels kinda dead, and my Twitter feed reflects that\n\nwhich is crazy to think about, considering we’re trading at the exact same prices from 2 months ago where everyone was euphoric\n\nfunny how that works. https://t.co/1K0JFVaOYz","Type":"Tweet","Retweets":2,"Likes":173,"Replies":8},{"Content":"Don’t suddenly lose interest in this market when things slowdown, even if you won’t be trading it.\n\nIt helps to stay in-tune with what’s going on.\n\nYou’re interested when things are hot, and walk away when things are boring? \n\nSounds like a great way to always lose.","Type":"Tweet","Retweets":11,"Likes":223,"Replies":10},{"Content":"In the bear market; I went hard on creating (hopefully) valuable content in the form of educational videos. Clarifying my system and strategies, discussing my philosophy, fine-tuning trading psychology\n\nsince 2023, and looking back now, I feel like I've really dropped the ball… https://t.co/Hgd35SCK0r","Type":"Tweet","Retweets":3,"Likes":310,"Replies":42},{"Content":"I'm largely open to the idea that my HTF bearish bias on $BTC is wrong. I have to be willing to adapt at all times, but especially for the upside - I'm here for the euphoria stages just like anyone else is.\n\nbut when the market is showing clear signs of exhaustion, and the trend… https://t.co/Gd1Spee0eV","Type":"Tweet","Retweets":12,"Likes":191,"Replies":14},{"Content":"&gt; kid gets popular playing Fortnite\n\n&gt; changes his Twitter pfp to the dogwifhat in 2019 (he did not create the meme)\n\n&gt; sees wif Solana memecoin blowing up\n\n&gt; “I made that meme popular😡”\n\n&gt; “if they grifted so can I😡”\n\nThe simulation is hilarious bro LMAO how is this real","Type":"Tweet","Retweets":22,"Likes":247,"Replies":22},{"Content":"people are so appalled by the fact that I do not short this market\n\nlet me explain something to you\n\nI watched my ledger account drawdown -80% in 2022\n\nI was bearish the whole way, but didn't touch my long-term investments\n\nI averaged 2-3 trades a month that entire year, even…","Type":"Tweet","Retweets":14,"Likes":374,"Replies":28},{"Content":"remember the team that gave us this incredible meme?\n\nwell they just raised another $8M recently…\n\nMy conclusion: You are not bullish enough on greed/stupidity long-term. https://t.co/QErtvtFgwj","Type":"Tweet","Retweets":2,"Likes":135,"Replies":11},{"Content":"I think it’s safe to say we’re in for more chop before anything exciting happens for $BTC https://t.co/t6c17BKJnE","Type":"Tweet","Retweets":3,"Likes":130,"Replies":11},{"Content":"Trading New Coins\n\nMy strategy is pretty simple\n\nfor context: I'm purely a TA guy, and rely on friends who are great at FA to spoonfeed me alpha\n\nso for new coins, I have to wait for price action to develop. It usually takes about a week or so\n\nafter a week, if they look like… https://t.co/b6qK6HMc40","Type":"Tweet","Retweets":29,"Likes":260,"Replies":14},{"Content":"wait I thought you guys bought the bottom why are you freaking out over -1% pullbacks?🤔","Type":"Tweet","Retweets":2,"Likes":131,"Replies":15},{"Content":"You’re worried about which direction Bitcoin goes next\n\nI’m worried about how much money can I make swinging shitcoins before Bitcoin picks a direction\n\nWe are not the same.\n\n(I’m mentally ill) https://t.co/7faqIs02X5","Type":"Tweet","Retweets":7,"Likes":196,"Replies":16},{"Content":"POV, you focused on narratives you don't understand:\n\n- \"Grayscale is STILL SELLING, why is price going UP?\"\n\n- \"Grayscale is DONE SELLING, why is price still going DOWN?\"\n\nme using MAs, blissfully ignorant to narratives:\n\n- pretty lines make numba go boing👍 https://t.co/yqGfBXJjlG","Type":"Tweet","Retweets":4,"Likes":144,"Replies":8},{"Content":"If I'm ever posting bearish thoughts, please do not take that as an invitation to flex your scalp shorts in the replies\n\nI really don't care that you made money on -3% of downside. You're going to get ran over in anything that even closely resembles a bull market👍","Type":"Tweet","Retweets":2,"Likes":123,"Replies":6},{"Content":"$SUI\n\nI see you guys getting euphoric on a 5% bounce on the orange coin that's clearly losing momentum on HTFs,\n\nbut I present to you an outperforming altcoin that bounced 15% and threatens price discovery https://t.co/Fl5vFVXk6X","Type":"Tweet","Retweets":6,"Likes":138,"Replies":10},{"Content":"crypto bros ridiculing hard working, honest people, who actually contribute to society by working ‘9-5’s’, is something I’ll never understand.\n\nyour parents worked 9-5 so that you could trade magic internet ponzis for a living, you dork.\n\nI’ll never forget where I came from. https://t.co/sIY1a0IwZI","Type":"Tweet","Retweets":119,"Likes":1206,"Replies":70},{"Content":"I think traders tend to over-glorify the Y-axis (price)\n\nwhen you first approach markets you're taught that as something trades lower, it becomes a more appealing buy\n\nand as something trades higher, it becomes less appealing to buy\n\nI don't think that way, *necessarily* (yes… https://t.co/tC9ueYDts1","Type":"Tweet","Retweets":22,"Likes":168,"Replies":7},{"Content":"one of the ETF tickers is called $BRRR lmfao\n\nthese boomers are trying so hard to fit in with crypto culture\n\nI’m going to absolutely obliterate them in the orderbooks and take all their money\n\ncan’t wait. https://t.co/KKby76Ro2L","Type":"Tweet","Retweets":2,"Likes":119,"Replies":13},{"Content":"Trend reversals:\n\nWhen a trend reverses, I like to think “directionally proportional” to the trend prior\n\nMeaning; if we breakdown below a 3-month, 80% uptrend, I’m not just going to look for a measly -5% pullback before we run it back turbo again\n\nThe same idea applies to… https://t.co/wmtwp77rJy","Type":"Tweet","Retweets":17,"Likes":220,"Replies":7},{"Content":"For all the people who are upset because your following isn’t giving you the clout you deserve:\n\n1) it’s Twitter, who cares\n\n2) how can you take this place seriously, when people still respect Algod after rugging his following for a year straight?\n\nNo need to be upset :D","Type":"Tweet","Retweets":1,"Likes":137,"Replies":14},{"Content":"you didn't have enough time to scout airdrops and farm protocols, it was too overwhelming and the market was running too hot.\n\nnow you do.\n\nmost of your regrets during exciting periods will stem from your laziness during boring/drought periods.\n\njust saying. https://t.co/dTqoNv2sD7","Type":"Tweet","Retweets":12,"Likes":208,"Replies":13}]