[{"Content":"DWF Ventures didi an overview of the LRT protocol. In the past month, this track has grown rapidly, with TVL increasing by more than 8x, reaching $3.3 billion. It has compiled statistics for different assets, stages, TVL, and potential airdrops for 14 projects, including Etherfi,… https://t.co/mczYdUDVFJ","Type":"Tweet","Retweets":3,"Likes":18,"Replies":10},{"Content":"Feb. 16 Options Data\n21,000 BTC options are about to expire with a Put Call Ratio of 0.9, a Maxpain point of $46,000 and a notional value of $1.1 billion.\n200,000 ETH options are about to expire with a Put Call Ratio of 0.62, Maxpain point of $2,400 and notional value of $570…","Type":"Tweet","Retweets":4,"Likes":33,"Replies":11},{"Content":"QCP Capital: Strong BTC spot ETF inflows, we flipped into firm net inflow territory towards the end of Jan and saw massive sizes in the last week up to $632M in a day. While we remain bullish with liquidity rushing back into risk assets, inflation being sticky over 3% remains a… https://t.co/VBHC9ZeWKi","Type":"Tweet","Retweets":11,"Likes":52,"Replies":7},{"Content":"State-owned Ethiopian Investment Holdings has signed a Memorandum of Understanding with Data Center Service, a subsidiary of Hong Kong’s West Data Group. They will cooperate on a $250-million project to establishing cutting-edge infrastructure for bitcoin mining and AI training.…","Type":"Tweet","Retweets":5,"Likes":33,"Replies":13},{"Content":"The Aptos Foundation announced the launch of the JamboPhone in conjunction with Web3 application Jambo. Priced at $99, it is now available in more than 40 countries/regions and aims to open up the digital economy for users in Africa, Southeast Asia and Latin America.…","Type":"Tweet","Retweets":14,"Likes":74,"Replies":10},{"Content":"With bitcoin's price rise to just shy of $53,000, MicroStrategy (MSTR), the largest corporate owner of the crypto has seen its holdings move above $10 billion, amassing a profit of more than $4 billion. MicroStrategy at the end of January held 190,000 bitcoins purchased for a…","Type":"Tweet","Retweets":6,"Likes":76,"Replies":12},{"Content":"The Uniswap Foundation announced that the launch of Uniswap v4 is tentatively scheduled for the Q3 of 2024 and is currently in the first phase, including core code completion, testing, gas optimization, security enhancements, and the finalization of peripherals. The second phase…","Type":"Tweet","Retweets":8,"Likes":53,"Replies":7},{"Content":"New York law firm Sullivan &amp; Cromwell, the same law firm handling FTX’s bankruptcy case, is set to be appointed as Binance’s independent monitor. The responsibilities are to ensure that Binance complies with its plea agreement and takes steps to address deficiencies in its…","Type":"Tweet","Retweets":9,"Likes":46,"Replies":6},{"Content":"Coinbase’s revenue in the fourth quarter of 2023 was $953.8 million, up 41% from the previous quarter, and net profit was $273 million, compared with a loss of $557 million in the same period in 2022.\nhttps://t.co/I5fDW3Pyj5","Type":"Tweet","Retweets":4,"Likes":36,"Replies":7},{"Content":"Tranchess, the liquid staking protocol that provides users with diversified risk-return solutions with its unique structured product design, is stepping into the LSDFi narrative with its launch of V3, unveiled on Ethereum on Feb 15, starting with stETH/wstETH.…","Type":"Tweet","Retweets":1,"Likes":27,"Replies":5},{"Content":"According to Arkham, at 22:41 UTC+8 on February 15, Grayscale transferred 2,399.6 BTC to the address of Coinbase Prime Deposit, worth approximately US$126 million; it transferred 1,756.2 BTC to a new address, which is suspected to be Grayscale's new custody address.…","Type":"Tweet","Retweets":7,"Likes":54,"Replies":10},{"Content":"According to SoSoValue, on February 14th, the total net inflow for Bitcoin spot ETFs was $339 million, marking fourteen consecutive trading days of net inflows. Grayscale ETF GBTC experienced a net outflow of $131 million in a single day, while Invesco's Bitcoin ETF BTCO saw a… https://t.co/nu7H2pPKph","Type":"Tweet","Retweets":7,"Likes":86,"Replies":9},{"Content":"Binance announced the first batch of S6 Incubation projects that made an investment in: Ethena Labs、NFP and Shogun. Ethena Labs is a derivative infrastructure provider to transform ETH into the first crypto-native yield-bearing stablecoin. NFP is an AI-driven UGC platform.…","Type":"Tweet","Retweets":6,"Likes":54,"Replies":14},{"Content":"According to Coinglass, the current BTC contract holdings in US dollar-denominated exchanges have reached $22.84 billion, of which CME has reached 6.77 billion, Binance has 6 billion, Bybit has 4 billion, etc. Overall, it is close to the previous bull market. On November 9, 2021,…","Type":"Tweet","Retweets":12,"Likes":81,"Replies":68},{"Content":"ApeCoin DAO will utilize the Arbitrum technology stack to develop ApeChain, build ApeChain as the Arbitrum Orbit chain developed using AnyTrust technology, and use APE as the gas and governance token. The ApeCoin community will have the option to implement upcoming features such…","Type":"Tweet","Retweets":13,"Likes":89,"Replies":9},{"Content":"Starkware co-founder Eli Ben-Sasson said in an interview with Decrypt that although more than 1.3 billion STRK tokens (valued at more than $2.15 billion) will be unlocked in April, he believes this will not cause harm to the community and the team’s main focus is Drive the…","Type":"Tweet","Retweets":25,"Likes":196,"Replies":57},{"Content":"Grayscale’s email notification shows that private placement subscriptions for some cryptocurrency trusts have been opened to accredited investors, including Grayscale Bitcoin Cash Trust, Grayscale Chainlink Trust, Grayscale Litecoin Trust, Grayscale Solana Trust, and Grayscale…","Type":"Tweet","Retweets":15,"Likes":91,"Replies":17},{"Content":"QCP: BTC has broken above the 50k level again after more than 2 years. This has been on the back of impressive inflows from the BTC spot ETFs of about $500-650m a day, which works out to 10-13k BTC bought daily. We expect these inflows to continue as global liquidity rotates into…","Type":"Tweet","Retweets":3,"Likes":57,"Replies":9},{"Content":"BTC broke through $52,000 and is now quoted at $52,371, up 5.9% in 24 hours. ETH broke through $2,800 and is now quoted at $2,816, a 24-hour increase of 6.89%. The entire market liquidated $206 million in 24 hours, including $35.15 million for long orders and $171 million for…","Type":"Tweet","Retweets":7,"Likes":92,"Replies":14},{"Content":"FDUSD, launched by a Hong Kong company, has replaced BUSD on Binance. On February 12, trading pairs containing FDUSD accounted for 38% of total Binance spot trading volume, an increase of 42.6% compared to the previous month. Binance’s previously launched BUSD was banned by the…","Type":"Tweet","Retweets":10,"Likes":62,"Replies":10},{"Content":"Genesis Global Holdco LLC received permission from the bankruptcy court to begin redeeming approximately 35 million Grayscale Bitcoin Trust shares worth more than $1.3 billion, converting GBTC shares into Bitcoin or cash to compensate for the loans lent to it Digital asset…","Type":"Tweet","Retweets":6,"Likes":51,"Replies":14},{"Content":"Jeffrey Wilcke, one of Ethereum’s early co-founders, transferred 10,000 ETH ($27.52m) to Kraken. Four days ago, he transferred 4,300 ETH ($10.75m) to Kraken. He has transferred a total of 14,300 ETH ($38.27m) to Kraken and currently holds more than 135,000 ETH ($373m).…","Type":"Tweet","Retweets":15,"Likes":89,"Replies":28},{"Content":"According to Arkham, at 22:05 UTC+8 on February 14, Grayscale transferred 294.6 BTC to the address of Coinbase Prime Deposit, worth approximately US$15 million; it transferred 2,582 BTC to a new address, which is suspected to be Grayscale's new custody address.…","Type":"Tweet","Retweets":11,"Likes":75,"Replies":12},{"Content":"Glassnode: Bitcoin has reclaimed the $1T market cap today, a key milestone, for the first time since December 2021. It now has a bigger capitalization than giants such as Walmart, Tesla, or even Berkshire Hathaway. https://t.co/b2MHfXDVIi https://t.co/UBKPtZaSdj","Type":"Tweet","Retweets":17,"Likes":93,"Replies":9},{"Content":"Binance Web3 Wallet completes 24 new dApp integrations, including: 48 Club, Avascriptions, BakerySwap, BIIS, CyberWallet, Etch Market, Ethscriptions, EthsMarket, EVM Ink, EVMs, Facet, Frc20 Market, Friend3, IERC 20, KiloEx, Owlto Finance , Pols Market, QnA3AI, Swell Network,…","Type":"Tweet","Retweets":3,"Likes":55,"Replies":10},{"Content":"The Starknet Foundation will distribute STRK tokens on February 20. The total distribution amount exceeds 700 million STRK, and approximately 1.297 million wallets are eligible to claim it, including early users of ecosystem dapps, networks Contributors, Ethereum builders and…","Type":"Tweet","Retweets":12,"Likes":94,"Replies":14},{"Content":"After the release of US CPI data that exceeded expectations, CME showed that the probability of the FOMC keeping interest rates unchanged in March has increased to 92%, which was only 53% on January 29. The probability of the May FOMC cutting interest rates by 25bps was 62.1 %.…","Type":"Tweet","Retweets":4,"Likes":61,"Replies":5},{"Content":"According to Spot On Chain, Kenetic Capital deposited the last 4.1 million RNDR (approximately $20.4 million) into Binance today. Before all 6.6 million RNDR (approximately $32.5 million) were deposited into CEX on December 24, 2023, Kenetic Capital was the largest institutional…","Type":"Tweet","Retweets":9,"Likes":74,"Replies":15},{"Content":"According to Arkham, at 22:23 UTC+8 on February 13, Grayscale transferred 878.2 BTC to the address of Coinbase Prime Deposit, worth approximately US$43 million; it transferred 1,551.8 BTC to a new address, which is suspected to be Grayscale's new custody address.…","Type":"Tweet","Retweets":6,"Likes":71,"Replies":10},{"Content":"According to Lookonchain, a whale is going long ETH through circular lending on Spark Protocol. Since February 1, the whale has withdrawn 39,900 ETH from Binance, Bybit, OKX, and Bitfinex at an average price of $2,492, and borrowed 56.8 million DAI from Spark.…","Type":"Tweet","Retweets":7,"Likes":73,"Replies":15},{"Content":"Founders Fund, founded by Peter Thiel, invested $200 million, half in Bitcoin and the other half in ETH, from late summer to early fall last year, when the price of Bitcoin was below $30,000, according to Reuters.   https://t.co/I3BK30GiWG","Type":"Tweet","Retweets":11,"Likes":68,"Replies":11},{"Content":"According to CNBC, the latest notice from the federal court in Seattle shows that the criminal sentencing against Binance founder CZ on money laundering rules charges has been postponed to April 30.  The reason for the delay in sentencing is unknown. CZ was scheduled to be…","Type":"Tweet","Retweets":32,"Likes":114,"Replies":23},{"Content":"Franklin Templeton has applied for a spot Ethereum exchange-traded fund (ETF), a filing with the Securities and Exchange Commission (SEC) shows. The asset manager joins BlackRock, Fidelity, Ark and 21Shares, Grayscale, VanEck, Invesco and Galaxy, and Hashdex, who have all…","Type":"Tweet","Retweets":24,"Likes":135,"Replies":18},{"Content":"According to Binance, Bitcoin exceeded 50,000 US dollars, reaching a maximum of 50,334 US dollars today, with a 24-hour increase of 3.7% and a 7-day increase of 17.7%, driving Bitcoin concepts such as STX ORDI to rise sharply, with 7-day increases of 37% and 32.5% respectively.… https://t.co/ZiRpMrT9s8","Type":"Tweet","Retweets":11,"Likes":86,"Replies":14},{"Content":"WuBlockchain Podcast EP-03: API3, What is OEV (Oracle Extractable Value)? Why is it important? \n\nBy @lasertheend and @UgurMersin61 \n\nYoutube https://t.co/9ICLrJNyiX\nSpotify：https://t.co/TZLpPmul1n\npodcast：https://t.co/sqN7EHDEVv https://t.co/pmopPlqkfP","Type":"Tweet","Retweets":7,"Likes":29,"Replies":11},{"Content":"Cex Data in Jan: The spot trading volume of major exchanges increased by 2.6% MOM. The top three in terms of change rate were Bitfinex at 20%, Cryptocom at 16%, and Huobi at 16%. Binance also increased by 4.8%. Read more： https://t.co/zL33dl19K4 https://t.co/bNqniGpOLQ","Type":"Tweet","Retweets":5,"Likes":32,"Replies":9},{"Content":"According to Arkham, at 22:14 UTC+8 on February 12, Grayscale transferred 2,044 BTC to the address of Coinbase Prime Deposit, worth approximately US$98 million; it transferred 827.8 BTC to a new address, which is suspected to be Grayscale's new custody address.…","Type":"Tweet","Retweets":8,"Likes":76,"Replies":13},{"Content":"According to CoinShares, inflows into digital asset investment products reached $1.1 billion last week, with Bitcoin accounting for 98%.  That’s because the newly launched U.S. spot Bitcoin ETF saw net inflows of $1.1 billion last week, taking inflows since its launch on January…","Type":"Tweet","Retweets":9,"Likes":84,"Replies":13},{"Content":"New Zealand Central Bank Governor Adrian Orr warned against cryptocurrencies such as stablecoins, saying that they cannot replace legal tender, stablecoins are the biggest misnomer and contradiction, stablecoins are not stable and their value depends entirely on the assets and…","Type":"Tweet","Retweets":17,"Likes":91,"Replies":21},{"Content":"According to Coingecko, in the last 24 hours, the ERC-404 sector has seen a significant decline, with the overall market capitalization falling by 29%. Key targets such as PANDORA dropped over 15%, DEFROGS dropped over 22%, RUG dropped over 38%, etc. ERC-404 is an experimental…","Type":"Tweet","Retweets":13,"Likes":96,"Replies":12},{"Content":"This week the United States will release January CPI and PP1 data, and several FOMC voting committee members will also give speeches. CME currently has a probability of 82.5% that the FOMC will decide to keep interest rates unchanged on March 20. https://t.co/nGgrVQN0to","Type":"Tweet","Retweets":5,"Likes":72,"Replies":5},{"Content":"Asia's weekly TOP10 crypto news: UN Investigates North Korea's Cryptographic Network Attacks, Thailand to Exempt Digital Assets from Value-Added Tax and Top10 News（0205-0211）\nRead more https://t.co/2ZuKBK0UE4 https://t.co/QXZuOY4J1R","Type":"Tweet","Retweets":3,"Likes":16,"Replies":9},{"Content":"Grayscale report: Bitcoin's issuance will halve around April 2024. Fundamental onchain activity and positive market structure updates make this halving different on a fundamental level. The continued adoption of Bitcoin ETFs could significantly absorb sell pressure. The advent of…","Type":"Tweet","Retweets":24,"Likes":112,"Replies":19},{"Content":"According to HODL15Capital, nine spot Bitcoin ETFs have purchased 216,309 Bitcoins (worth $10.3 billion) in the 21 days since their launch, surpassing MicroStrategy’s current holdings of 190,000 Bitcoins. By @HODL15Capital https://t.co/GiKqMj9b2L","Type":"Tweet","Retweets":38,"Likes":151,"Replies":19},{"Content":"Ethereum client Go Ethereum sad that Geth v1.13.12 has been released in preparation for the Ethereum mainnet upgrade scheduled for March 13, 2024. Also fixed a Geth miner tip enforcement bug. https://t.co/5ZUr6r5Z1T","Type":"Tweet","Retweets":2,"Likes":41,"Replies":13},{"Content":"FTX plans to sell Digital Custody, a subsidiary it acquired for $10 million, to CoinList for $500,000. FTX had planned to provide custody services for FTXUS and LedgerX through DCI. https://t.co/mFJTOrPAP8","Type":"Tweet","Retweets":5,"Likes":54,"Replies":11},{"Content":"Ethiopia has already risen to become one of the world’s top recipients of Bitcoin mining machines. The state power monopoly says it has struck power supply deals with 21 Bitcoin miners. All but two of them are Chinese. The African country’s capacity to supply electricity for…","Type":"Tweet","Retweets":22,"Likes":107,"Replies":17},{"Content":"Starknet blockchain explorer Voyager released the STRK airdrop data dashboard page, showing that the STRK airdrop is coming soon. StarkWare released a STRK inflation management proposal on February 7, proposing to increase the total supply of STRK with an inflation rate of up to…","Type":"Tweet","Retweets":31,"Likes":208,"Replies":22},{"Content":"Weekly Project Updates: Wormhole Reveals W Token Economics, EigenLayer Temporarily Opens Staking, ENS Contemplates Launching Exclusive L2 Solution, etc\n\nRead more https://t.co/SbGej49j7R https://t.co/j5e930grWl","Type":"Tweet","Retweets":0,"Likes":15,"Replies":7},{"Content":"According to SoSoValue, the Bitcoin spot ETF saw a net inflow of US$541 million on February 9, setting a record high in net inflows excluding the first trading day, and has achieved net inflows for eleven consecutive trading days. Grayscale ETF GBTC had a single-day net outflow…","Type":"Tweet","Retweets":7,"Likes":81,"Replies":17}]